Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
/* Based on CPU DB MC9S12XET256_144, version 3.00.004 (RegistersPrg V2.23) */
/*
** ###################################################################
**     Filename  : mc9s12xet256.h
**     Processor : MC9S12XET256CAG
**     FileFormat: V2.23
**     DataSheet : MC9S12XEP100 Rev. 1.13 11/2007
**     Compiler  : CodeWarrior compiler
**     Date/Time : 22.2.2008, 10:55
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     (c) Copyright UNIS, spol. s r.o. 1997-2008
**     UNIS, spol. s r.o.
**     Jundrovska 33
**     624 00 Brno
**     Czech Republic
**     http      : www.processorexpert.com
**     mail      : info@processorexpert.com
**
**     CPU Registers Revisions:
**      - 02.05.2006, VV2.87.007:
**              - Corrected registers addresses:
**              - MPUSEL 118 => 119
**              - MPUDESC0 119 => 11A
**              - MPUDESC1 11A => 11B
**              - MPUDESC2 11B => 11C
**              - MPUDESC3 11C => 11D
**              - MPUDESC4 11D => 11E
**              - MPUDESC5 11E => 11F
**              -   REASON: Bug-fix (#3266 from UNIS issue manager)
**      - 15.08.2006, VV2.87.056:
**              - Added register POSTDIV.
**              -   REASON: Bug-fix (#3605 from UNIS issue manager)
**      - 17.04.2007, VV2.87.068:
**              - Renamed bits DBGXDH_BIT0..7 ==> DBGXDH_BIT8..15, SYNR_SYNx ==> SYNR_SYNDIVx,
**              - REFDV_REFDVx ==> REFDV_REFDIVx,ECT_PAyH_BITx ==> ECT_PAyH_PAyHx, ECT_TCyH_BITx ==> ECT_TCyH_TCx, ATD1CTL2_ASCIF ==>  ATD1CTL2_ACMPIE,
**              - FCLKDIV_PRDIV8 ==> FCLKDIV_FDIV6, TIM_TCNTH/L_BITx ==> TIM_TCNTH/L_TCNTx, TIM_PACNT_BITx ==> TIM_PACNT_PACNTx,
**              - NVFPROT_NV6 ==>  NVFPROT_RNV6, NVFSEC_NVx ==>  NVFSEC_RNVx.
**              - Renamed registers XGIF0 ==> XGIF_7F_70 ... XGIF7 ==> XGIF_0F_00.
**              - Renamed CAN buffers *RX/TX* ==> *R/T*(for example CAN1TXIDR1 ==> CAN1TIDR1).
**              - Redefined PT/DDR/RDR/PERxAD0/1 registers.
**              -   REASON: Bug-fix (#4548 from UNIS issue manager).
**      - 04.10.2007, V3.00.0:
**              - Renamed bits IICx_IBCR2[ADx] ==> IICx_IBCR2[ADRx].
**              -   REASON: Bug-fix (#5072 from UNIS issue manager).
**              - Removed bits PAxH_BIT0..BIT7/15, TCxH..BIT0..BIT7/15.
**              -   REASON: Access to the individual bits is not necessary (issue #5192 from the UNIS Issue Manager).
**              - Removed interrupt vectors for TIM module(No. 85-95).
**              - Renamed interrupt vectors VReserved65 ==> Vhti, Vflashfault ==> Vflashfd.
**              - Renamed bits ATDxCTL2_AWAI ==> ATDxCTL2_ICLKSTP, XGMCTL_XGSWEIFM ==> XGMCTL_XGSWEFM, NVFSEC_RNV6 ==> NVFSEC_KEYEN0.
**              - Renamed CAN Buffers: *R/T* ==> *RX/TX* (for example CAN1TIDR1 ==> CAN1TXIDR1).
**              - Removed bit FERCNFG_EACCEIE.
**              - Added register VREGHTTR, added bits VREGHTCL[HTIF, HTIE, HTDS, HTEN].
**              - Corrected registers addresses: NVEPROT 0xFF0C => 0xFF0D, NVFPROT 0xFF0D => 0xFF0C.
**              -   REASON: Bug-fix (#5330 from UNIS issue manager).
**      - 11.01.2008, V3.00.1:
**              - Renamed interrupt vectors Vtimmdcu ==> Vectmdcu, Vtimpabovf ==> Vectpabovf.
**              -   REASON: Bug-fix (#5415 from UNIS issue manager).
**
**     File-Format-Revisions:
**      - 27.10.2006, V2.10 :
**               - __RESET_WATCHDOG improved formating and re-definition
**      - 23.11.2006, V2.11 :
**               -  Changes have not affected this file (because they are related to another family)
**      - 22.01.2007, V2.12 :
**               - Fixed declaration of non volatile registers. Now it does not require (but allows) their initialization, see issue #4086.
**      - 01.03.2007, V2.13 :
**               - Flash commands constants values converted to HEX format
**      - 02.03.2007, V2.14 :
**               - Interrupt vector numbers added into .H, see VectorNumber_*
**      - 26.03.2007, V2.15 :
**               -  Changes have not affected this file (because they are related to another family)
**      - 10.05.2007, V2.16 :
**               -  Changes have not affected this file (because they are related to another family)
**      - 05.06.2007, V2.17 :
**               -  Changes have not affected this file (because they are related to another family)
**      - 19.07.2007, V2.18 :
**               - Improved number of blanked lines inside register structures
**      - 06.08.2007, V2.19 :
**               - CPUDB revisions generated ahead of the file-format revisions.
**      - 11.09.2007, V2.20 :
**               - Added comment about initialization of unbonded pins.
**      - 02.01.2008, V2.21 :
**               -  Changes have not affected this file (because they are related to another family)
**      - 13.02.2008, V2.22 :
**               -  Changes have not affected this file (because they are related to another family)
**      - 20.02.2008, V2.23 :
**               - Termination of pragma V30toV31Compatible added, #5708
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S12XET256_H
#define _MC9S12XET256_H

/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */
#pragma OPTION ADD V30toV31Compatible "-BfaGapLimitBits4294967295" /*this guarantee correct bitfield positions*/

/**************** interrupt vector numbers ****************/
#define VectorNumber_Vsi                119
#define VectorNumber_Vsyscall           118
#define VectorNumber_Vmpuaccesserr      117
#define VectorNumber_Vxsei              116
#define VectorNumber_VReserved115       115
#define VectorNumber_VReserved114       114
#define VectorNumber_VReserved113       113
#define VectorNumber_VReserved112       112
#define VectorNumber_VReserved111       111
#define VectorNumber_VReserved110       110
#define VectorNumber_VReserved109       109
#define VectorNumber_VReserved108       108
#define VectorNumber_VReserved107       107
#define VectorNumber_VReserved106       106
#define VectorNumber_VReserved105       105
#define VectorNumber_VReserved104       104
#define VectorNumber_VReserved103       103
#define VectorNumber_VReserved102       102
#define VectorNumber_VReserved101       101
#define VectorNumber_VReserved100       100
#define VectorNumber_VReserved99        99
#define VectorNumber_VReserved98        98
#define VectorNumber_Vatd1compare       97
#define VectorNumber_Vatd0compare       96
#define VectorNumber_VReserved95        95
#define VectorNumber_VReserved94        94
#define VectorNumber_VReserved93        93
#define VectorNumber_VReserved92        92
#define VectorNumber_VReserved91        91
#define VectorNumber_VReserved90        90
#define VectorNumber_VReserved89        89
#define VectorNumber_VReserved88        88
#define VectorNumber_VReserved87        87
#define VectorNumber_VReserved86        86
#define VectorNumber_VReserved85        85
#define VectorNumber_VReserved84        84
#define VectorNumber_VReserved83        83
#define VectorNumber_VReserved82        82
#define VectorNumber_VReserved81        81
#define VectorNumber_VReserved80        80
#define VectorNumber_VReserved79        79
#define VectorNumber_VReserved78        78
#define VectorNumber_Vxst7              77
#define VectorNumber_Vxst6              76
#define VectorNumber_Vxst5              75
#define VectorNumber_Vxst4              74
#define VectorNumber_Vxst3              73
#define VectorNumber_Vxst2              72
#define VectorNumber_Vxst1              71
#define VectorNumber_Vxst0              70
#define VectorNumber_Vpit3              69
#define VectorNumber_Vpit2              68
#define VectorNumber_Vpit1              67
#define VectorNumber_Vpit0              66
#define VectorNumber_Vhti               65
#define VectorNumber_Vapi               64
#define VectorNumber_Vlvi               63
#define VectorNumber_VReserved62        62
#define VectorNumber_VReserved61        61
#define VectorNumber_Vsci4              60
#define VectorNumber_VReserved59        59
#define VectorNumber_Vsci2              58
#define VectorNumber_Vpwmesdn           57
#define VectorNumber_Vportp             56
#define VectorNumber_Vcan4tx            55
#define VectorNumber_Vcan4rx            54
#define VectorNumber_Vcan4err           53
#define VectorNumber_Vcan4wkup          52
#define VectorNumber_VReserved51        51
#define VectorNumber_VReserved50        50
#define VectorNumber_VReserved49        49
#define VectorNumber_VReserved48        48
#define VectorNumber_VReserved47        47
#define VectorNumber_VReserved46        46
#define VectorNumber_VReserved45        45
#define VectorNumber_VReserved44        44
#define VectorNumber_Vcan1tx            43
#define VectorNumber_Vcan1rx            42
#define VectorNumber_Vcan1err           41
#define VectorNumber_Vcan1wkup          40
#define VectorNumber_Vcan0tx            39
#define VectorNumber_Vcan0rx            38
#define VectorNumber_Vcan0err           37
#define VectorNumber_Vcan0wkup          36
#define VectorNumber_Vflash             35
#define VectorNumber_Vflashfd           34
#define VectorNumber_Vspi2              33
#define VectorNumber_Vspi1              32
#define VectorNumber_Viic0              31
#define VectorNumber_VReserved30        30
#define VectorNumber_Vcrgscm            29
#define VectorNumber_Vcrgplllck         28
#define VectorNumber_Vectpabovf         27
#define VectorNumber_Vectmdcu           26
#define VectorNumber_Vporth             25
#define VectorNumber_Vportj             24
#define VectorNumber_Vatd1              23
#define VectorNumber_Vatd0              22
#define VectorNumber_Vsci1              21
#define VectorNumber_Vsci0              20
#define VectorNumber_Vspi0              19
#define VectorNumber_Vectpaie           18
#define VectorNumber_Vectpaaovf         17
#define VectorNumber_Vectovf            16
#define VectorNumber_Vectch7            15
#define VectorNumber_Vectch6            14
#define VectorNumber_Vectch5            13
#define VectorNumber_Vectch4            12
#define VectorNumber_Vectch3            11
#define VectorNumber_Vectch2            10
#define VectorNumber_Vectch1            9
#define VectorNumber_Vectch0            8
#define VectorNumber_Vrti               7
#define VectorNumber_Virq               6
#define VectorNumber_Vxirq              5
#define VectorNumber_Vswi               4
#define VectorNumber_Vtrap              3
#define VectorNumber_Vcop               2
#define VectorNumber_Vclkmon            1
#define VectorNumber_Vreset             0

