Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
/**************** interrupt vector table ****************/
#define Vsi                             0x0000FF10
#define Vsyscall                        0x0000FF12
#define Vmpuaccesserr                   0x0000FF14
#define Vxsei                           0x0000FF16
#define VReserved115                    0x0000FF18
#define VReserved114                    0x0000FF1A
#define VReserved113                    0x0000FF1C
#define VReserved112                    0x0000FF1E
#define VReserved111                    0x0000FF20
#define VReserved110                    0x0000FF22
#define VReserved109                    0x0000FF24
#define VReserved108                    0x0000FF26
#define VReserved107                    0x0000FF28
#define VReserved106                    0x0000FF2A
#define VReserved105                    0x0000FF2C
#define VReserved104                    0x0000FF2E
#define VReserved103                    0x0000FF30
#define VReserved102                    0x0000FF32
#define VReserved101                    0x0000FF34
#define VReserved100                    0x0000FF36
#define VReserved99                     0x0000FF38
#define VReserved98                     0x0000FF3A
#define Vatd1compare                    0x0000FF3C
#define Vatd0compare                    0x0000FF3E
#define VReserved95                     0x0000FF40
#define VReserved94                     0x0000FF42
#define VReserved93                     0x0000FF44
#define VReserved92                     0x0000FF46
#define VReserved91                     0x0000FF48
#define VReserved90                     0x0000FF4A
#define VReserved89                     0x0000FF4C
#define VReserved88                     0x0000FF4E
#define VReserved87                     0x0000FF50
#define VReserved86                     0x0000FF52
#define VReserved85                     0x0000FF54
#define VReserved84                     0x0000FF56
#define VReserved83                     0x0000FF58
#define VReserved82                     0x0000FF5A
#define VReserved81                     0x0000FF5C
#define VReserved80                     0x0000FF5E
#define VReserved79                     0x0000FF60
#define VReserved78                     0x0000FF62
#define Vxst7                           0x0000FF64
#define Vxst6                           0x0000FF66
#define Vxst5                           0x0000FF68
#define Vxst4                           0x0000FF6A
#define Vxst3                           0x0000FF6C
#define Vxst2                           0x0000FF6E
#define Vxst1                           0x0000FF70
#define Vxst0                           0x0000FF72
#define Vpit3                           0x0000FF74
#define Vpit2                           0x0000FF76
#define Vpit1                           0x0000FF78
#define Vpit0                           0x0000FF7A
#define Vhti                            0x0000FF7C
#define Vapi                            0x0000FF7E
#define Vlvi                            0x0000FF80
#define VReserved62                     0x0000FF82
#define VReserved61                     0x0000FF84
#define Vsci4                           0x0000FF86
#define VReserved59                     0x0000FF88
#define Vsci2                           0x0000FF8A
#define Vpwmesdn                        0x0000FF8C
#define Vportp                          0x0000FF8E
#define Vcan4tx                         0x0000FF90
#define Vcan4rx                         0x0000FF92
#define Vcan4err                        0x0000FF94
#define Vcan4wkup                       0x0000FF96
#define VReserved51                     0x0000FF98
#define VReserved50                     0x0000FF9A
#define VReserved49                     0x0000FF9C
#define VReserved48                     0x0000FF9E
#define VReserved47                     0x0000FFA0
#define VReserved46                     0x0000FFA2
#define VReserved45                     0x0000FFA4
#define VReserved44                     0x0000FFA6
#define Vcan1tx                         0x0000FFA8
#define Vcan1rx                         0x0000FFAA
#define Vcan1err                        0x0000FFAC
#define Vcan1wkup                       0x0000FFAE
#define Vcan0tx                         0x0000FFB0
#define Vcan0rx                         0x0000FFB2
#define Vcan0err                        0x0000FFB4
#define Vcan0wkup                       0x0000FFB6
#define Vflash                          0x0000FFB8
#define Vflashfd                        0x0000FFBA
#define Vspi2                           0x0000FFBC
#define Vspi1                           0x0000FFBE
#define Viic0                           0x0000FFC0
#define VReserved30                     0x0000FFC2
#define Vcrgscm                         0x0000FFC4
#define Vcrgplllck                      0x0000FFC6
#define Vectpabovf                      0x0000FFC8
#define Vectmdcu                        0x0000FFCA
#define Vporth                          0x0000FFCC
#define Vportj                          0x0000FFCE
#define Vatd1                           0x0000FFD0
#define Vatd0                           0x0000FFD2
#define Vsci1                           0x0000FFD4
#define Vsci0                           0x0000FFD6
#define Vspi0                           0x0000FFD8
#define Vectpaie                        0x0000FFDA
#define Vectpaaovf                      0x0000FFDC
#define Vectovf                         0x0000FFDE
#define Vectch7                         0x0000FFE0
#define Vectch6                         0x0000FFE2
#define Vectch5                         0x0000FFE4
#define Vectch4                         0x0000FFE6
#define Vectch3                         0x0000FFE8
#define Vectch2                         0x0000FFEA
#define Vectch1                         0x0000FFEC
#define Vectch0                         0x0000FFEE
#define Vrti                            0x0000FFF0
#define Virq                            0x0000FFF2
#define Vxirq                           0x0000FFF4
#define Vswi                            0x0000FFF6
#define Vtrap                           0x0000FFF8
#define Vcop                            0x0000FFFA
#define Vclkmon                         0x0000FFFC
#define Vreset                          0x0000FFFE

/**************** registers I/O map ****************/

