Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
extern volatile ECT_OC7MSTR _ECT_OC7M @(REG_BASE + 0x00000042);
#define ECT_OC7M                        _ECT_OC7M.Byte
#define ECT_OC7M_OC7M0                  _ECT_OC7M.Bits.OC7M0
#define ECT_OC7M_OC7M1                  _ECT_OC7M.Bits.OC7M1
#define ECT_OC7M_OC7M2                  _ECT_OC7M.Bits.OC7M2
#define ECT_OC7M_OC7M3                  _ECT_OC7M.Bits.OC7M3
#define ECT_OC7M_OC7M4                  _ECT_OC7M.Bits.OC7M4
#define ECT_OC7M_OC7M5                  _ECT_OC7M.Bits.OC7M5
#define ECT_OC7M_OC7M6                  _ECT_OC7M.Bits.OC7M6
#define ECT_OC7M_OC7M7                  _ECT_OC7M.Bits.OC7M7

#define ECT_OC7M_OC7M0_MASK             1
#define ECT_OC7M_OC7M1_MASK             2
#define ECT_OC7M_OC7M2_MASK             4
#define ECT_OC7M_OC7M3_MASK             8
#define ECT_OC7M_OC7M4_MASK             16
#define ECT_OC7M_OC7M5_MASK             32
#define ECT_OC7M_OC7M6_MASK             64
#define ECT_OC7M_OC7M7_MASK             128


/*** ECT_OC7D - Output Compare 7 Data Register; 0x00000043 ***/
typedef union {
  byte Byte;
} ECT_OC7DSTR;
extern volatile ECT_OC7DSTR _ECT_OC7D @(REG_BASE + 0x00000043);
#define ECT_OC7D                        _ECT_OC7D.Byte


/*** ECT_TCNT - Timer Count Register; 0x00000044 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TCNTHi - Timer Count Register High; 0x00000044 ***/
    union {
      byte Byte;
    } ECT_TCNTHiSTR;
    #define ECT_TCNTHi                  _ECT_TCNT.Overlap_STR.ECT_TCNTHiSTR.Byte
    

    /*** ECT_TCNTLo - Timer Count Register Low; 0x00000045 ***/
    union {
      byte Byte;
    } ECT_TCNTLoSTR;
    #define ECT_TCNTLo                  _ECT_TCNT.Overlap_STR.ECT_TCNTLoSTR.Byte
    
  } Overlap_STR;

} ECT_TCNTSTR;
extern volatile ECT_TCNTSTR _ECT_TCNT @(REG_BASE + 0x00000044);
#define ECT_TCNT                        _ECT_TCNT.Word


/*** ECT_TSCR1 - Timer System Control Register1; 0x00000046 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PRNT        :1;                                       /* Precision Timer */
    byte TFFCA       :1;                                       /* Timer Fast Flag Clear All */
    byte TSFRZ       :1;                                       /* Timer and Modulus Counter Stop While in Freeze Mode */
    byte TSWAI       :1;                                       /* Timer Module Stops While in Wait */
    byte TEN         :1;                                       /* Timer Enable */
  } Bits;
} ECT_TSCR1STR;
extern volatile ECT_TSCR1STR _ECT_TSCR1 @(REG_BASE + 0x00000046);
#define ECT_TSCR1                       _ECT_TSCR1.Byte
#define ECT_TSCR1_PRNT                  _ECT_TSCR1.Bits.PRNT
#define ECT_TSCR1_TFFCA                 _ECT_TSCR1.Bits.TFFCA
#define ECT_TSCR1_TSFRZ                 _ECT_TSCR1.Bits.TSFRZ
#define ECT_TSCR1_TSWAI                 _ECT_TSCR1.Bits.TSWAI
#define ECT_TSCR1_TEN                   _ECT_TSCR1.Bits.TEN

#define ECT_TSCR1_PRNT_MASK             8
#define ECT_TSCR1_TFFCA_MASK            16
#define ECT_TSCR1_TSFRZ_MASK            32
#define ECT_TSCR1_TSWAI_MASK            64
#define ECT_TSCR1_TEN_MASK              128


/*** ECT_TTOV - Timer Toggle On Overflow Register; 0x00000047 ***/
typedef union {
  byte Byte;
  struct {
    byte TOV0        :1;                                       /* Toggle On Overflow Bit 0 */
    byte TOV1        :1;                                       /* Toggle On Overflow Bit 1 */
    byte TOV2        :1;                                       /* Toggle On Overflow Bit 2 */
    byte TOV3        :1;                                       /* Toggle On Overflow Bit 3 */
    byte TOV4        :1;                                       /* Toggle On Overflow Bit 4 */
    byte TOV5        :1;                                       /* Toggle On Overflow Bit 5 */
    byte TOV6        :1;                                       /* Toggle On Overflow Bit 6 */
    byte TOV7        :1;                                       /* Toggle On Overflow Bit 7 */
  } Bits;
} ECT_TTOVSTR;
extern volatile ECT_TTOVSTR _ECT_TTOV @(REG_BASE + 0x00000047);
#define ECT_TTOV                        _ECT_TTOV.Byte
#define ECT_TTOV_TOV0                   _ECT_TTOV.Bits.TOV0
#define ECT_TTOV_TOV1                   _ECT_TTOV.Bits.TOV1
#define ECT_TTOV_TOV2                   _ECT_TTOV.Bits.TOV2
#define ECT_TTOV_TOV3                   _ECT_TTOV.Bits.TOV3
#define ECT_TTOV_TOV4                   _ECT_TTOV.Bits.TOV4
#define ECT_TTOV_TOV5                   _ECT_TTOV.Bits.TOV5
#define ECT_TTOV_TOV6                   _ECT_TTOV.Bits.TOV6
#define ECT_TTOV_TOV7                   _ECT_TTOV.Bits.TOV7

#define ECT_TTOV_TOV0_MASK              1
#define ECT_TTOV_TOV1_MASK              2
#define ECT_TTOV_TOV2_MASK              4
#define ECT_TTOV_TOV3_MASK              8
#define ECT_TTOV_TOV4_MASK              16
#define ECT_TTOV_TOV5_MASK              32
#define ECT_TTOV_TOV6_MASK              64
#define ECT_TTOV_TOV7_MASK              128


/*** ECT_TCTL1 - Timer Control Register 1; 0x00000048 ***/
typedef union {
  byte Byte;
  struct {
    byte OL4         :1;                                       /* Output Level Bit 4 */
    byte OM4         :1;                                       /* Output Mode Bit 4 */
    byte OL5         :1;                                       /* Output Level Bit 5 */
    byte OM5         :1;                                       /* Output Mode Bit 5 */
    byte OL6         :1;                                       /* Output Level Bit 6 */
    byte OM6         :1;                                       /* Output Mode Bit 6 */
    byte OL7         :1;                                       /* Output Level Bit 7 */
    byte OM7         :1;                                       /* Output Mode Bit 7 */
  } Bits;
} ECT_TCTL1STR;
extern volatile ECT_TCTL1STR _ECT_TCTL1 @(REG_BASE + 0x00000048);
#define ECT_TCTL1                       _ECT_TCTL1.Byte
#define ECT_TCTL1_OL4                   _ECT_TCTL1.Bits.OL4
#define ECT_TCTL1_OM4                   _ECT_TCTL1.Bits.OM4
#define ECT_TCTL1_OL5                   _ECT_TCTL1.Bits.OL5
#define ECT_TCTL1_OM5                   _ECT_TCTL1.Bits.OM5
#define ECT_TCTL1_OL6                   _ECT_TCTL1.Bits.OL6
#define ECT_TCTL1_OM6                   _ECT_TCTL1.Bits.OM6
#define ECT_TCTL1_OL7                   _ECT_TCTL1.Bits.OL7
#define ECT_TCTL1_OM7                   _ECT_TCTL1.Bits.OM7

#define ECT_TCTL1_OL4_MASK              1
#define ECT_TCTL1_OM4_MASK              2
#define ECT_TCTL1_OL5_MASK              4
#define ECT_TCTL1_OM5_MASK              8
#define ECT_TCTL1_OL6_MASK              16
#define ECT_TCTL1_OM6_MASK              32
#define ECT_TCTL1_OL7_MASK              64
#define ECT_TCTL1_OM7_MASK              128


/*** ECT_TCTL2 - Timer Control Register 2; 0x00000049 ***/
typedef union {
  byte Byte;
  struct {
    byte OL0         :1;                                       /* Output Level Bit 0 */
    byte OM0         :1;                                       /* Output Mode Bit 0 */
    byte OL1         :1;                                       /* Output Lecel Bit 1 */
    byte OM1         :1;                                       /* Output Mode Bit 1 */
    byte OL2         :1;                                       /* Output Level Bit 2 */
    byte OM2         :1;                                       /* Output Mode Bit 2 */
    byte OL3         :1;                                       /* Output Level Bit 3 */
    byte OM3         :1;                                       /* Output Mode Bit 3 */
  } Bits;
} ECT_TCTL2STR;
