Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
extern volatile ECT_MCFLGSTR _ECT_MCFLG @(REG_BASE + 0x00000067);
#define ECT_MCFLG                       _ECT_MCFLG.Byte
#define ECT_MCFLG_POLF0                 _ECT_MCFLG.Bits.POLF0
#define ECT_MCFLG_POLF1                 _ECT_MCFLG.Bits.POLF1
#define ECT_MCFLG_POLF2                 _ECT_MCFLG.Bits.POLF2
#define ECT_MCFLG_POLF3                 _ECT_MCFLG.Bits.POLF3
#define ECT_MCFLG_MCZF                  _ECT_MCFLG.Bits.MCZF
#define ECT_MCFLG_POLF                  _ECT_MCFLG.MergedBits.grpPOLF

#define ECT_MCFLG_POLF0_MASK            1
#define ECT_MCFLG_POLF1_MASK            2
#define ECT_MCFLG_POLF2_MASK            4
#define ECT_MCFLG_POLF3_MASK            8
#define ECT_MCFLG_MCZF_MASK             128
#define ECT_MCFLG_POLF_MASK             15
#define ECT_MCFLG_POLF_BITNUM           0


/*** ECT_ICPAR - Input Control Pulse Accumulator Register; 0x00000068 ***/
typedef union {
  byte Byte;
  struct {
    byte PA0EN       :1;                                       /* 8-Bit Pulse Accumulator 0 Enable */
    byte PA1EN       :1;                                       /* 8-Bit Pulse Accumulator 1 Enable */
    byte PA2EN       :1;                                       /* 8-Bit Pulse Accumulator 2 Enable */
    byte PA3EN       :1;                                       /* 8-Bit Pulse Accumulator 3 Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ECT_ICPARSTR;
extern volatile ECT_ICPARSTR _ECT_ICPAR @(REG_BASE + 0x00000068);
#define ECT_ICPAR                       _ECT_ICPAR.Byte
#define ECT_ICPAR_PA0EN                 _ECT_ICPAR.Bits.PA0EN
#define ECT_ICPAR_PA1EN                 _ECT_ICPAR.Bits.PA1EN
#define ECT_ICPAR_PA2EN                 _ECT_ICPAR.Bits.PA2EN
#define ECT_ICPAR_PA3EN                 _ECT_ICPAR.Bits.PA3EN

#define ECT_ICPAR_PA0EN_MASK            1
#define ECT_ICPAR_PA1EN_MASK            2
#define ECT_ICPAR_PA2EN_MASK            4
#define ECT_ICPAR_PA3EN_MASK            8


/*** ECT_DLYCT - Delay Counter Control Register; 0x00000069 ***/
typedef union {
  byte Byte;
  struct {
    byte DLY0        :1;                                       /* Delay Counter Select 0 */
    byte DLY1        :1;                                       /* Delay Counter Select 1 */
    byte DLY2        :1;                                       /* Delay Counter Select 2 */
    byte DLY3        :1;                                       /* Delay Counter Select 3 */
    byte DLY4        :1;                                       /* Delay Counter Select 4 */
    byte DLY5        :1;                                       /* Delay Counter Select 5 */
    byte DLY6        :1;                                       /* Delay Counter Select 6 */
    byte DLY7        :1;                                       /* Delay Counter Select 7 */
  } Bits;
} ECT_DLYCTSTR;
extern volatile ECT_DLYCTSTR _ECT_DLYCT @(REG_BASE + 0x00000069);
#define ECT_DLYCT                       _ECT_DLYCT.Byte
#define ECT_DLYCT_DLY0                  _ECT_DLYCT.Bits.DLY0
#define ECT_DLYCT_DLY1                  _ECT_DLYCT.Bits.DLY1
#define ECT_DLYCT_DLY2                  _ECT_DLYCT.Bits.DLY2
#define ECT_DLYCT_DLY3                  _ECT_DLYCT.Bits.DLY3
#define ECT_DLYCT_DLY4                  _ECT_DLYCT.Bits.DLY4
#define ECT_DLYCT_DLY5                  _ECT_DLYCT.Bits.DLY5
#define ECT_DLYCT_DLY6                  _ECT_DLYCT.Bits.DLY6
#define ECT_DLYCT_DLY7                  _ECT_DLYCT.Bits.DLY7

#define ECT_DLYCT_DLY0_MASK             1
#define ECT_DLYCT_DLY1_MASK             2
#define ECT_DLYCT_DLY2_MASK             4
#define ECT_DLYCT_DLY3_MASK             8
#define ECT_DLYCT_DLY4_MASK             16
#define ECT_DLYCT_DLY5_MASK             32
#define ECT_DLYCT_DLY6_MASK             64
#define ECT_DLYCT_DLY7_MASK             128


/*** ECT_ICOVW - Input Control Overwrite Register; 0x0000006A ***/
typedef union {
  byte Byte;
  struct {
    byte NOVW0       :1;                                       /* No Input Capture Overwrite 0 */
    byte NOVW1       :1;                                       /* No Input Capture Overwrite 1 */
    byte NOVW2       :1;                                       /* No Input Capture Overwrite 2 */
    byte NOVW3       :1;                                       /* No Input Capture Overwrite 3 */
    byte NOVW4       :1;                                       /* No Input Capture Overwrite 4 */
    byte NOVW5       :1;                                       /* No Input Capture Overwrite 5 */
    byte NOVW6       :1;                                       /* No Input Capture Overwrite 6 */
    byte NOVW7       :1;                                       /* No Input Capture Overwrite 7 */
  } Bits;
} ECT_ICOVWSTR;
extern volatile ECT_ICOVWSTR _ECT_ICOVW @(REG_BASE + 0x0000006A);
#define ECT_ICOVW                       _ECT_ICOVW.Byte
#define ECT_ICOVW_NOVW0                 _ECT_ICOVW.Bits.NOVW0
#define ECT_ICOVW_NOVW1                 _ECT_ICOVW.Bits.NOVW1
#define ECT_ICOVW_NOVW2                 _ECT_ICOVW.Bits.NOVW2
#define ECT_ICOVW_NOVW3                 _ECT_ICOVW.Bits.NOVW3
#define ECT_ICOVW_NOVW4                 _ECT_ICOVW.Bits.NOVW4
#define ECT_ICOVW_NOVW5                 _ECT_ICOVW.Bits.NOVW5
#define ECT_ICOVW_NOVW6                 _ECT_ICOVW.Bits.NOVW6
#define ECT_ICOVW_NOVW7                 _ECT_ICOVW.Bits.NOVW7

#define ECT_ICOVW_NOVW0_MASK            1
#define ECT_ICOVW_NOVW1_MASK            2
#define ECT_ICOVW_NOVW2_MASK            4
#define ECT_ICOVW_NOVW3_MASK            8
#define ECT_ICOVW_NOVW4_MASK            16
#define ECT_ICOVW_NOVW5_MASK            32
#define ECT_ICOVW_NOVW6_MASK            64
#define ECT_ICOVW_NOVW7_MASK            128


/*** ECT_ICSYS - Input Control System Control Register; 0x0000006B ***/
typedef union {
  byte Byte;
  struct {
    byte LATQ        :1;                                       /* Input Control Latch or Queue Mode Enable */
    byte BUFEN       :1;                                       /* IC Buffer Enable */
    byte PACMX       :1;                                       /* 8-Bit Pulse Accumulators Maximum Count */
    byte TFMOD       :1;                                       /* Timer Flag-setting Mode */
    byte SH04        :1;                                       /* Share Input action of Input Capture Channels 0 and 4 */
    byte SH15        :1;                                       /* Share Input action of Input Capture Channels 1 and 5 */
    byte SH26        :1;                                       /* Share Input action of Input Capture Channels 2 and 6 */
    byte SH37        :1;                                       /* Share Input action of Input Capture Channels 3 and 7 */
  } Bits;
} ECT_ICSYSSTR;
