Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
extern volatile ECT_ICSYSSTR _ECT_ICSYS @(REG_BASE + 0x0000006B);
#define ECT_ICSYS                       _ECT_ICSYS.Byte
#define ECT_ICSYS_LATQ                  _ECT_ICSYS.Bits.LATQ
#define ECT_ICSYS_BUFEN                 _ECT_ICSYS.Bits.BUFEN
#define ECT_ICSYS_PACMX                 _ECT_ICSYS.Bits.PACMX
#define ECT_ICSYS_TFMOD                 _ECT_ICSYS.Bits.TFMOD
#define ECT_ICSYS_SH04                  _ECT_ICSYS.Bits.SH04
#define ECT_ICSYS_SH15                  _ECT_ICSYS.Bits.SH15
#define ECT_ICSYS_SH26                  _ECT_ICSYS.Bits.SH26
#define ECT_ICSYS_SH37                  _ECT_ICSYS.Bits.SH37

#define ECT_ICSYS_LATQ_MASK             1
#define ECT_ICSYS_BUFEN_MASK            2
#define ECT_ICSYS_PACMX_MASK            4
#define ECT_ICSYS_TFMOD_MASK            8
#define ECT_ICSYS_SH04_MASK             16
#define ECT_ICSYS_SH15_MASK             32
#define ECT_ICSYS_SH26_MASK             64
#define ECT_ICSYS_SH37_MASK             128


/*** ECT_OCPD - Output Compare Pin Disconnect Register; 0x0000006C ***/
typedef union {
  byte Byte;
  struct {
    byte OCPD0       :1;                                       /* Output Compare Pin Disconnect Bit 0 */
    byte OCPD1       :1;                                       /* Output Compare Pin Disconnect Bit 1 */
    byte OCPD2       :1;                                       /* Output Compare Pin Disconnect Bit 2 */
    byte OCPD3       :1;                                       /* Output Compare Pin Disconnect Bit 3 */
    byte OCPD4       :1;                                       /* Output Compare Pin Disconnect Bit 4 */
    byte OCPD5       :1;                                       /* Output Compare Pin Disconnect Bit 5 */
    byte OCPD6       :1;                                       /* Output Compare Pin Disconnect Bit 6 */
    byte OCPD7       :1;                                       /* Output Compare Pin Disconnect Bit 7 */
  } Bits;
} ECT_OCPDSTR;
extern volatile ECT_OCPDSTR _ECT_OCPD @(REG_BASE + 0x0000006C);
#define ECT_OCPD                        _ECT_OCPD.Byte
#define ECT_OCPD_OCPD0                  _ECT_OCPD.Bits.OCPD0
#define ECT_OCPD_OCPD1                  _ECT_OCPD.Bits.OCPD1
#define ECT_OCPD_OCPD2                  _ECT_OCPD.Bits.OCPD2
#define ECT_OCPD_OCPD3                  _ECT_OCPD.Bits.OCPD3
#define ECT_OCPD_OCPD4                  _ECT_OCPD.Bits.OCPD4
#define ECT_OCPD_OCPD5                  _ECT_OCPD.Bits.OCPD5
#define ECT_OCPD_OCPD6                  _ECT_OCPD.Bits.OCPD6
#define ECT_OCPD_OCPD7                  _ECT_OCPD.Bits.OCPD7

#define ECT_OCPD_OCPD0_MASK             1
#define ECT_OCPD_OCPD1_MASK             2
#define ECT_OCPD_OCPD2_MASK             4
#define ECT_OCPD_OCPD3_MASK             8
#define ECT_OCPD_OCPD4_MASK             16
#define ECT_OCPD_OCPD5_MASK             32
#define ECT_OCPD_OCPD6_MASK             64
#define ECT_OCPD_OCPD7_MASK             128


/*** ECT_PTPSR - Precision Timer Prescaler Select Register; 0x0000006E ***/
typedef union {
  byte Byte;
  struct {
    byte PTPS0       :1;                                       /* Precision Timer Prescaler Select, bit 0 */
    byte PTPS1       :1;                                       /* Precision Timer Prescaler Select, bit 1 */
    byte PTPS2       :1;                                       /* Precision Timer Prescaler Select, bit 2 */
    byte PTPS3       :1;                                       /* Precision Timer Prescaler Select, bit 3 */
    byte PTPS4       :1;                                       /* Precision Timer Prescaler Select, bit 4 */
    byte PTPS5       :1;                                       /* Precision Timer Prescaler Select, bit 5 */
    byte PTPS6       :1;                                       /* Precision Timer Prescaler Select, bit 6 */
    byte PTPS7       :1;                                       /* Precision Timer Prescaler Select, bit 7 */
  } Bits;
} ECT_PTPSRSTR;
extern volatile ECT_PTPSRSTR _ECT_PTPSR @(REG_BASE + 0x0000006E);
#define ECT_PTPSR                       _ECT_PTPSR.Byte
#define ECT_PTPSR_PTPS0                 _ECT_PTPSR.Bits.PTPS0
#define ECT_PTPSR_PTPS1                 _ECT_PTPSR.Bits.PTPS1
#define ECT_PTPSR_PTPS2                 _ECT_PTPSR.Bits.PTPS2
#define ECT_PTPSR_PTPS3                 _ECT_PTPSR.Bits.PTPS3
#define ECT_PTPSR_PTPS4                 _ECT_PTPSR.Bits.PTPS4
#define ECT_PTPSR_PTPS5                 _ECT_PTPSR.Bits.PTPS5
#define ECT_PTPSR_PTPS6                 _ECT_PTPSR.Bits.PTPS6
#define ECT_PTPSR_PTPS7                 _ECT_PTPSR.Bits.PTPS7

#define ECT_PTPSR_PTPS0_MASK            1
#define ECT_PTPSR_PTPS1_MASK            2
#define ECT_PTPSR_PTPS2_MASK            4
#define ECT_PTPSR_PTPS3_MASK            8
#define ECT_PTPSR_PTPS4_MASK            16
#define ECT_PTPSR_PTPS5_MASK            32
#define ECT_PTPSR_PTPS6_MASK            64
#define ECT_PTPSR_PTPS7_MASK            128


/*** ECT_PTMCPSR - Precision Timer Modulus Counter Prescaler Select Register; 0x0000006F ***/
typedef union {
  byte Byte;
  struct {
    byte PTMPS0      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 0 */
    byte PTMPS1      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 1 */
    byte PTMPS2      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 2 */
    byte PTMPS3      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 3 */
    byte PTMPS4      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 4 */
    byte PTMPS5      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 5 */
    byte PTMPS6      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 6 */
    byte PTMPS7      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 7 */
  } Bits;
} ECT_PTMCPSRSTR;
extern volatile ECT_PTMCPSRSTR _ECT_PTMCPSR @(REG_BASE + 0x0000006F);
#define ECT_PTMCPSR                     _ECT_PTMCPSR.Byte
#define ECT_PTMCPSR_PTMPS0              _ECT_PTMCPSR.Bits.PTMPS0
#define ECT_PTMCPSR_PTMPS1              _ECT_PTMCPSR.Bits.PTMPS1
#define ECT_PTMCPSR_PTMPS2              _ECT_PTMCPSR.Bits.PTMPS2
#define ECT_PTMCPSR_PTMPS3              _ECT_PTMCPSR.Bits.PTMPS3
#define ECT_PTMCPSR_PTMPS4              _ECT_PTMCPSR.Bits.PTMPS4
#define ECT_PTMCPSR_PTMPS5              _ECT_PTMCPSR.Bits.PTMPS5
#define ECT_PTMCPSR_PTMPS6              _ECT_PTMCPSR.Bits.PTMPS6
#define ECT_PTMCPSR_PTMPS7              _ECT_PTMCPSR.Bits.PTMPS7

#define ECT_PTMCPSR_PTMPS0_MASK         1
#define ECT_PTMCPSR_PTMPS1_MASK         2
#define ECT_PTMCPSR_PTMPS2_MASK         4
#define ECT_PTMCPSR_PTMPS3_MASK         8
#define ECT_PTMCPSR_PTMPS4_MASK         16
#define ECT_PTMCPSR_PTMPS5_MASK         32
#define ECT_PTMCPSR_PTMPS6_MASK         64
#define ECT_PTMCPSR_PTMPS7_MASK         128


/*** ECT_PBCTL - 16-Bit Pulse Accumulator B Control Register; 0x00000070 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte PBOVI       :1;                                       /* Pulse Accumulator B Overflow Interrupt enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PBEN        :1;                                       /* Pulse Accumulator B System Enable */
    byte             :1; 
  } Bits;
} ECT_PBCTLSTR;
