Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
    /*** ATD1CMPHTL - ATD 1 Compare Higher Than Register Low; 0x0000008F ***/
    union {
      byte Byte;
      struct {
        byte CMPHT0      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 0 of a Sequence */
        byte CMPHT1      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 1 of a Sequence */
        byte CMPHT2      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 2 of a Sequence */
        byte CMPHT3      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 3 of a Sequence */
        byte CMPHT4      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 4 of a Sequence */
        byte CMPHT5      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 5 of a Sequence */
        byte CMPHT6      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 6 of a Sequence */
        byte CMPHT7      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 7 of a Sequence */
      } Bits;
    } ATD1CMPHTLSTR;
    #define ATD1CMPHTL                  _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Byte
    #define ATD1CMPHTL_CMPHT0           _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Bits.CMPHT0
    #define ATD1CMPHTL_CMPHT1           _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Bits.CMPHT1
    #define ATD1CMPHTL_CMPHT2           _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Bits.CMPHT2
    #define ATD1CMPHTL_CMPHT3           _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Bits.CMPHT3
    #define ATD1CMPHTL_CMPHT4           _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Bits.CMPHT4
    #define ATD1CMPHTL_CMPHT5           _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Bits.CMPHT5
    #define ATD1CMPHTL_CMPHT6           _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Bits.CMPHT6
    #define ATD1CMPHTL_CMPHT7           _ATD1CMPHT.Overlap_STR.ATD1CMPHTLSTR.Bits.CMPHT7
    
    #define ATD1CMPHTL_CMPHT0_MASK      1
    #define ATD1CMPHTL_CMPHT1_MASK      2
    #define ATD1CMPHTL_CMPHT2_MASK      4
    #define ATD1CMPHTL_CMPHT3_MASK      8
    #define ATD1CMPHTL_CMPHT4_MASK      16
    #define ATD1CMPHTL_CMPHT5_MASK      32
    #define ATD1CMPHTL_CMPHT6_MASK      64
    #define ATD1CMPHTL_CMPHT7_MASK      128
    
  } Overlap_STR;

  struct {
    word CMPHT0      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 0 of a Sequence */
    word CMPHT1      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 1 of a Sequence */
    word CMPHT2      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 2 of a Sequence */
    word CMPHT3      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 3 of a Sequence */
    word CMPHT4      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 4 of a Sequence */
    word CMPHT5      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 5 of a Sequence */
    word CMPHT6      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 6 of a Sequence */
    word CMPHT7      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 7 of a Sequence */
    word CMPHT8      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 8 of a Sequence */
    word CMPHT9      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 9 of a Sequence */
    word CMPHT10     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 10 of a Sequence */
    word CMPHT11     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 11 of a Sequence */
    word CMPHT12     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 12 of a Sequence */
    word CMPHT13     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 13 of a Sequence */
    word CMPHT14     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 14 of a Sequence */
    word CMPHT15     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 15 of a Sequence */
  } Bits;
} ATD1CMPHTSTR;
extern volatile ATD1CMPHTSTR _ATD1CMPHT @(REG_BASE + 0x0000008E);
#define ATD1CMPHT                       _ATD1CMPHT.Word
#define ATD1CMPHT_CMPHT0                _ATD1CMPHT.Bits.CMPHT0
#define ATD1CMPHT_CMPHT1                _ATD1CMPHT.Bits.CMPHT1
#define ATD1CMPHT_CMPHT2                _ATD1CMPHT.Bits.CMPHT2
#define ATD1CMPHT_CMPHT3                _ATD1CMPHT.Bits.CMPHT3
#define ATD1CMPHT_CMPHT4                _ATD1CMPHT.Bits.CMPHT4
#define ATD1CMPHT_CMPHT5                _ATD1CMPHT.Bits.CMPHT5
#define ATD1CMPHT_CMPHT6                _ATD1CMPHT.Bits.CMPHT6
#define ATD1CMPHT_CMPHT7                _ATD1CMPHT.Bits.CMPHT7
#define ATD1CMPHT_CMPHT8                _ATD1CMPHT.Bits.CMPHT8
#define ATD1CMPHT_CMPHT9                _ATD1CMPHT.Bits.CMPHT9
#define ATD1CMPHT_CMPHT10               _ATD1CMPHT.Bits.CMPHT10
#define ATD1CMPHT_CMPHT11               _ATD1CMPHT.Bits.CMPHT11
#define ATD1CMPHT_CMPHT12               _ATD1CMPHT.Bits.CMPHT12
#define ATD1CMPHT_CMPHT13               _ATD1CMPHT.Bits.CMPHT13
#define ATD1CMPHT_CMPHT14               _ATD1CMPHT.Bits.CMPHT14
#define ATD1CMPHT_CMPHT15               _ATD1CMPHT.Bits.CMPHT15

#define ATD1CMPHT_CMPHT0_MASK           1
#define ATD1CMPHT_CMPHT1_MASK           2
#define ATD1CMPHT_CMPHT2_MASK           4
#define ATD1CMPHT_CMPHT3_MASK           8
#define ATD1CMPHT_CMPHT4_MASK           16
#define ATD1CMPHT_CMPHT5_MASK           32
#define ATD1CMPHT_CMPHT6_MASK           64
#define ATD1CMPHT_CMPHT7_MASK           128
#define ATD1CMPHT_CMPHT8_MASK           256
#define ATD1CMPHT_CMPHT9_MASK           512
#define ATD1CMPHT_CMPHT10_MASK          1024
#define ATD1CMPHT_CMPHT11_MASK          2048
#define ATD1CMPHT_CMPHT12_MASK          4096
#define ATD1CMPHT_CMPHT13_MASK          8192
#define ATD1CMPHT_CMPHT14_MASK          16384
#define ATD1CMPHT_CMPHT15_MASK          32768


/*** ATD1DR0 - ATD 1 Conversion Result Register 0; 0x00000090 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR0H - ATD 1 Conversion Result Register 0 High; 0x00000090 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD1DR0HSTR;
    #define ATD1DR0H                    _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Byte
    #define ATD1DR0H_BIT8               _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT8
    #define ATD1DR0H_BIT9               _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT9
    #define ATD1DR0H_BIT10              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT10
    #define ATD1DR0H_BIT11              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT11
    #define ATD1DR0H_BIT12              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT12
    #define ATD1DR0H_BIT13              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT13
    #define ATD1DR0H_BIT14              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT14
    #define ATD1DR0H_BIT15              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT15
    
