Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD1DR10STR;
extern volatile ATD1DR10STR _ATD1DR10 @(REG_BASE + 0x000000A4);
#define ATD1DR10                        _ATD1DR10.Word
#define ATD1DR10_BIT0                   _ATD1DR10.Bits.BIT0
#define ATD1DR10_BIT1                   _ATD1DR10.Bits.BIT1
#define ATD1DR10_BIT2                   _ATD1DR10.Bits.BIT2
#define ATD1DR10_BIT3                   _ATD1DR10.Bits.BIT3
#define ATD1DR10_BIT4                   _ATD1DR10.Bits.BIT4
#define ATD1DR10_BIT5                   _ATD1DR10.Bits.BIT5
#define ATD1DR10_BIT6                   _ATD1DR10.Bits.BIT6
#define ATD1DR10_BIT7                   _ATD1DR10.Bits.BIT7
#define ATD1DR10_BIT8                   _ATD1DR10.Bits.BIT8
#define ATD1DR10_BIT9                   _ATD1DR10.Bits.BIT9
#define ATD1DR10_BIT10                  _ATD1DR10.Bits.BIT10
#define ATD1DR10_BIT11                  _ATD1DR10.Bits.BIT11
#define ATD1DR10_BIT12                  _ATD1DR10.Bits.BIT12
#define ATD1DR10_BIT13                  _ATD1DR10.Bits.BIT13
#define ATD1DR10_BIT14                  _ATD1DR10.Bits.BIT14
#define ATD1DR10_BIT15                  _ATD1DR10.Bits.BIT15

#define ATD1DR10_BIT0_MASK              1
#define ATD1DR10_BIT1_MASK              2
#define ATD1DR10_BIT2_MASK              4
#define ATD1DR10_BIT3_MASK              8
#define ATD1DR10_BIT4_MASK              16
#define ATD1DR10_BIT5_MASK              32
#define ATD1DR10_BIT6_MASK              64
#define ATD1DR10_BIT7_MASK              128
#define ATD1DR10_BIT8_MASK              256
#define ATD1DR10_BIT9_MASK              512
#define ATD1DR10_BIT10_MASK             1024
#define ATD1DR10_BIT11_MASK             2048
#define ATD1DR10_BIT12_MASK             4096
#define ATD1DR10_BIT13_MASK             8192
#define ATD1DR10_BIT14_MASK             16384
#define ATD1DR10_BIT15_MASK             32768


/*** ATD1DR11 - ATD 1 Conversion Result Register 11; 0x000000A6 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR11H - ATD 1 Conversion Result Register 11 High; 0x000000A6 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD1DR11HSTR;
    #define ATD1DR11H                   _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Byte
    #define ATD1DR11H_BIT8              _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Bits.BIT8
    #define ATD1DR11H_BIT9              _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Bits.BIT9
    #define ATD1DR11H_BIT10             _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Bits.BIT10
    #define ATD1DR11H_BIT11             _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Bits.BIT11
    #define ATD1DR11H_BIT12             _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Bits.BIT12
    #define ATD1DR11H_BIT13             _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Bits.BIT13
    #define ATD1DR11H_BIT14             _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Bits.BIT14
    #define ATD1DR11H_BIT15             _ATD1DR11.Overlap_STR.ATD1DR11HSTR.Bits.BIT15
    
    #define ATD1DR11H_BIT8_MASK         1
    #define ATD1DR11H_BIT9_MASK         2
    #define ATD1DR11H_BIT10_MASK        4
    #define ATD1DR11H_BIT11_MASK        8
    #define ATD1DR11H_BIT12_MASK        16
    #define ATD1DR11H_BIT13_MASK        32
    #define ATD1DR11H_BIT14_MASK        64
    #define ATD1DR11H_BIT15_MASK        128
    

    /*** ATD1DR11L - ATD 1 Conversion Result Register 11 Low; 0x000000A7 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD1DR11LSTR;
    #define ATD1DR11L                   _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Byte
    #define ATD1DR11L_BIT0              _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Bits.BIT0
    #define ATD1DR11L_BIT1              _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Bits.BIT1
    #define ATD1DR11L_BIT2              _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Bits.BIT2
    #define ATD1DR11L_BIT3              _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Bits.BIT3
    #define ATD1DR11L_BIT4              _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Bits.BIT4
    #define ATD1DR11L_BIT5              _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Bits.BIT5
    #define ATD1DR11L_BIT6              _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Bits.BIT6
    #define ATD1DR11L_BIT7              _ATD1DR11.Overlap_STR.ATD1DR11LSTR.Bits.BIT7
    
    #define ATD1DR11L_BIT0_MASK         1
    #define ATD1DR11L_BIT1_MASK         2
    #define ATD1DR11L_BIT2_MASK         4
    #define ATD1DR11L_BIT3_MASK         8
    #define ATD1DR11L_BIT4_MASK         16
    #define ATD1DR11L_BIT5_MASK         32
    #define ATD1DR11L_BIT6_MASK         64
    #define ATD1DR11L_BIT7_MASK         128
    
  } Overlap_STR;

