Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
extern volatile PIFJSTR _PIFJ @(REG_BASE + 0x0000026F);
#define PIFJ                            _PIFJ.Byte
#define PIFJ_PIFJ0                      _PIFJ.Bits.PIFJ0
#define PIFJ_PIFJ1                      _PIFJ.Bits.PIFJ1
#define PIFJ_PIFJ2                      _PIFJ.Bits.PIFJ2
#define PIFJ_PIFJ3                      _PIFJ.Bits.PIFJ3
#define PIFJ_PIFJ4                      _PIFJ.Bits.PIFJ4
#define PIFJ_PIFJ5                      _PIFJ.Bits.PIFJ5
#define PIFJ_PIFJ6                      _PIFJ.Bits.PIFJ6
#define PIFJ_PIFJ7                      _PIFJ.Bits.PIFJ7

#define PIFJ_PIFJ0_MASK                 1
#define PIFJ_PIFJ1_MASK                 2
#define PIFJ_PIFJ2_MASK                 4
#define PIFJ_PIFJ3_MASK                 8
#define PIFJ_PIFJ4_MASK                 16
#define PIFJ_PIFJ5_MASK                 32
#define PIFJ_PIFJ6_MASK                 64
#define PIFJ_PIFJ7_MASK                 128


/*** PT01AD0 - Port AD0 Data Register; 0x00000270 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PT0AD0 - Port AD0H Data Register; 0x00000270 ***/
    union {
      byte Byte;
      struct {
        byte PT0AD00     :1;                                       /* Port AD0 data bit 0 */
        byte PT0AD01     :1;                                       /* Port AD0 data bit 1 */
        byte PT0AD02     :1;                                       /* Port AD0 data bit 2 */
        byte PT0AD03     :1;                                       /* Port AD0 data bit 3 */
        byte PT0AD04     :1;                                       /* Port AD0 data bit 4 */
        byte PT0AD05     :1;                                       /* Port AD0 data bit 5 */
        byte PT0AD06     :1;                                       /* Port AD0 data bit 6 */
        byte PT0AD07     :1;                                       /* Port AD0 data bit 7 */
      } Bits;
    } PT0AD0STR;
    #define PT0AD0                      _PT01AD0.Overlap_STR.PT0AD0STR.Byte
    #define PT0AD0_PT0AD00              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD00
    #define PT0AD0_PT0AD01              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD01
    #define PT0AD0_PT0AD02              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD02
    #define PT0AD0_PT0AD03              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD03
    #define PT0AD0_PT0AD04              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD04
    #define PT0AD0_PT0AD05              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD05
    #define PT0AD0_PT0AD06              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD06
    #define PT0AD0_PT0AD07              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD07
    
    #define PT0AD0_PT0AD00_MASK         1
    #define PT0AD0_PT0AD01_MASK         2
    #define PT0AD0_PT0AD02_MASK         4
    #define PT0AD0_PT0AD03_MASK         8
    #define PT0AD0_PT0AD04_MASK         16
    #define PT0AD0_PT0AD05_MASK         32
    #define PT0AD0_PT0AD06_MASK         64
    #define PT0AD0_PT0AD07_MASK         128
    

    /*** PT1AD0 - Port AD0L Data Register; 0x00000271 ***/
    union {
      byte Byte;
      struct {
        byte PT1AD00     :1;                                       /* Port AD0 data bit 0 */
        byte PT1AD01     :1;                                       /* Port AD0 data bit 1 */
        byte PT1AD02     :1;                                       /* Port AD0 data bit 2 */
        byte PT1AD03     :1;                                       /* Port AD0 data bit 3 */
        byte PT1AD04     :1;                                       /* Port AD0 data bit 4 */
        byte PT1AD05     :1;                                       /* Port AD0 data bit 5 */
        byte PT1AD06     :1;                                       /* Port AD0 data bit 6 */
        byte PT1AD07     :1;                                       /* Port AD0 data bit 7 */
      } Bits;
    } PT1AD0STR;
    #define PT1AD0                      _PT01AD0.Overlap_STR.PT1AD0STR.Byte
    #define PT1AD0_PT1AD00              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD00
    #define PT1AD0_PT1AD01              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD01
    #define PT1AD0_PT1AD02              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD02
    #define PT1AD0_PT1AD03              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD03
    #define PT1AD0_PT1AD04              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD04
    #define PT1AD0_PT1AD05              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD05
    #define PT1AD0_PT1AD06              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD06
    #define PT1AD0_PT1AD07              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD07
    
    #define PT1AD0_PT1AD00_MASK         1
    #define PT1AD0_PT1AD01_MASK         2
    #define PT1AD0_PT1AD02_MASK         4
    #define PT1AD0_PT1AD03_MASK         8
    #define PT1AD0_PT1AD04_MASK         16
    #define PT1AD0_PT1AD05_MASK         32
    #define PT1AD0_PT1AD06_MASK         64
    #define PT1AD0_PT1AD07_MASK         128
    
  } Overlap_STR;

  struct {
    word PT1AD00     :1;                                       /* Port AD0 data bit 0 */
    word PT1AD01     :1;                                       /* Port AD0 data bit 1 */
    word PT1AD02     :1;                                       /* Port AD0 data bit 2 */
    word PT1AD03     :1;                                       /* Port AD0 data bit 3 */
    word PT1AD04     :1;                                       /* Port AD0 data bit 4 */
    word PT1AD05     :1;                                       /* Port AD0 data bit 5 */
    word PT1AD06     :1;                                       /* Port AD0 data bit 6 */
    word PT1AD07     :1;                                       /* Port AD0 data bit 7 */
    word PT0AD00     :1;                                       /* Port AD0 data bit 8 */
    word PT0AD01     :1;                                       /* Port AD0 data bit 9 */
    word PT0AD02     :1;                                       /* Port AD0 data bit 10 */
    word PT0AD03     :1;                                       /* Port AD0 data bit 11 */
    word PT0AD04     :1;                                       /* Port AD0 data bit 12 */
    word PT0AD05     :1;                                       /* Port AD0 data bit 13 */
    word PT0AD06     :1;                                       /* Port AD0 data bit 14 */
    word PT0AD07     :1;                                       /* Port AD0 data bit 15 */
  } Bits;
  struct {
    word grpPT1AD0 :8;
    word grpPT0AD0 :8;
  } MergedBits;
} PT01AD0STR;
