Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
extern volatile PT01AD0STR _PT01AD0 @(REG_BASE + 0x00000270);
#define PT01AD0                         _PT01AD0.Word
#define PT01AD0_PT1AD00                 _PT01AD0.Bits.PT1AD00
#define PT01AD0_PT1AD01                 _PT01AD0.Bits.PT1AD01
#define PT01AD0_PT1AD02                 _PT01AD0.Bits.PT1AD02
#define PT01AD0_PT1AD03                 _PT01AD0.Bits.PT1AD03
#define PT01AD0_PT1AD04                 _PT01AD0.Bits.PT1AD04
#define PT01AD0_PT1AD05                 _PT01AD0.Bits.PT1AD05
#define PT01AD0_PT1AD06                 _PT01AD0.Bits.PT1AD06
#define PT01AD0_PT1AD07                 _PT01AD0.Bits.PT1AD07
#define PT01AD0_PT0AD00                 _PT01AD0.Bits.PT0AD00
#define PT01AD0_PT0AD01                 _PT01AD0.Bits.PT0AD01
#define PT01AD0_PT0AD02                 _PT01AD0.Bits.PT0AD02
#define PT01AD0_PT0AD03                 _PT01AD0.Bits.PT0AD03
#define PT01AD0_PT0AD04                 _PT01AD0.Bits.PT0AD04
#define PT01AD0_PT0AD05                 _PT01AD0.Bits.PT0AD05
#define PT01AD0_PT0AD06                 _PT01AD0.Bits.PT0AD06
#define PT01AD0_PT0AD07                 _PT01AD0.Bits.PT0AD07
#define PT01AD0_PT1AD0                  _PT01AD0.MergedBits.grpPT1AD0
#define PT01AD0_PT0AD0                  _PT01AD0.MergedBits.grpPT0AD0

#define PT01AD0_PT1AD00_MASK            1
#define PT01AD0_PT1AD01_MASK            2
#define PT01AD0_PT1AD02_MASK            4
#define PT01AD0_PT1AD03_MASK            8
#define PT01AD0_PT1AD04_MASK            16
#define PT01AD0_PT1AD05_MASK            32
#define PT01AD0_PT1AD06_MASK            64
#define PT01AD0_PT1AD07_MASK            128
#define PT01AD0_PT0AD00_MASK            256
#define PT01AD0_PT0AD01_MASK            512
#define PT01AD0_PT0AD02_MASK            1024
#define PT01AD0_PT0AD03_MASK            2048
#define PT01AD0_PT0AD04_MASK            4096
#define PT01AD0_PT0AD05_MASK            8192
#define PT01AD0_PT0AD06_MASK            16384
#define PT01AD0_PT0AD07_MASK            32768
#define PT01AD0_PT1AD0_MASK             255
#define PT01AD0_PT1AD0_BITNUM           0
#define PT01AD0_PT0AD0_MASK             65280
#define PT01AD0_PT0AD0_BITNUM           8


/*** DDR01AD0 - Port AD0 Data Direction Register; 0x00000272 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DDR0AD0 - Port AD0H Data Direction Register; 0x00000272 ***/
    union {
      byte Byte;
      struct {
        byte DDR0AD00    :1;                                       /* Port AD0 data direction bit 0 */
        byte DDR0AD01    :1;                                       /* Port AD0 data direction bit 1 */
        byte DDR0AD02    :1;                                       /* Port AD0 data direction bit 2 */
        byte DDR0AD03    :1;                                       /* Port AD0 data direction bit 3 */
        byte DDR0AD04    :1;                                       /* Port AD0 data direction bit 4 */
        byte DDR0AD05    :1;                                       /* Port AD0 data direction bit 5 */
        byte DDR0AD06    :1;                                       /* Port AD0 data direction bit 6 */
        byte DDR0AD07    :1;                                       /* Port AD0 data direction bit 7 */
      } Bits;
    } DDR0AD0STR;
    #define DDR0AD0                     _DDR01AD0.Overlap_STR.DDR0AD0STR.Byte
    #define DDR0AD0_DDR0AD00            _DDR01AD0.Overlap_STR.DDR0AD0STR.Bits.DDR0AD00
    #define DDR0AD0_DDR0AD01            _DDR01AD0.Overlap_STR.DDR0AD0STR.Bits.DDR0AD01
    #define DDR0AD0_DDR0AD02            _DDR01AD0.Overlap_STR.DDR0AD0STR.Bits.DDR0AD02
    #define DDR0AD0_DDR0AD03            _DDR01AD0.Overlap_STR.DDR0AD0STR.Bits.DDR0AD03
    #define DDR0AD0_DDR0AD04            _DDR01AD0.Overlap_STR.DDR0AD0STR.Bits.DDR0AD04
    #define DDR0AD0_DDR0AD05            _DDR01AD0.Overlap_STR.DDR0AD0STR.Bits.DDR0AD05
    #define DDR0AD0_DDR0AD06            _DDR01AD0.Overlap_STR.DDR0AD0STR.Bits.DDR0AD06
    #define DDR0AD0_DDR0AD07            _DDR01AD0.Overlap_STR.DDR0AD0STR.Bits.DDR0AD07
    
    #define DDR0AD0_DDR0AD00_MASK       1
    #define DDR0AD0_DDR0AD01_MASK       2
    #define DDR0AD0_DDR0AD02_MASK       4
    #define DDR0AD0_DDR0AD03_MASK       8
    #define DDR0AD0_DDR0AD04_MASK       16
    #define DDR0AD0_DDR0AD05_MASK       32
    #define DDR0AD0_DDR0AD06_MASK       64
    #define DDR0AD0_DDR0AD07_MASK       128
    

    /*** DDR1AD0 - Port AD0L Data Direction Register; 0x00000273 ***/
    union {
      byte Byte;
      struct {
        byte DDR1AD00    :1;                                       /* Port AD0 data direction bit 0 */
        byte DDR1AD01    :1;                                       /* Port AD0 data direction bit 1 */
        byte DDR1AD02    :1;                                       /* Port AD0 data direction bit 2 */
        byte DDR1AD03    :1;                                       /* Port AD0 data direction bit 3 */
        byte DDR1AD04    :1;                                       /* Port AD0 data direction bit 4 */
        byte DDR1AD05    :1;                                       /* Port AD0 data direction bit 5 */
        byte DDR1AD06    :1;                                       /* Port AD0 data direction bit 6 */
        byte DDR1AD07    :1;                                       /* Port AD0 data direction bit 7 */
      } Bits;
    } DDR1AD0STR;
    #define DDR1AD0                     _DDR01AD0.Overlap_STR.DDR1AD0STR.Byte
    #define DDR1AD0_DDR1AD00            _DDR01AD0.Overlap_STR.DDR1AD0STR.Bits.DDR1AD00
    #define DDR1AD0_DDR1AD01            _DDR01AD0.Overlap_STR.DDR1AD0STR.Bits.DDR1AD01
    #define DDR1AD0_DDR1AD02            _DDR01AD0.Overlap_STR.DDR1AD0STR.Bits.DDR1AD02
    #define DDR1AD0_DDR1AD03            _DDR01AD0.Overlap_STR.DDR1AD0STR.Bits.DDR1AD03
    #define DDR1AD0_DDR1AD04            _DDR01AD0.Overlap_STR.DDR1AD0STR.Bits.DDR1AD04
    #define DDR1AD0_DDR1AD05            _DDR01AD0.Overlap_STR.DDR1AD0STR.Bits.DDR1AD05
    #define DDR1AD0_DDR1AD06            _DDR01AD0.Overlap_STR.DDR1AD0STR.Bits.DDR1AD06
    #define DDR1AD0_DDR1AD07            _DDR01AD0.Overlap_STR.DDR1AD0STR.Bits.DDR1AD07
    
