Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
    #define RDR0AD0_RDR0AD00_MASK       1
    #define RDR0AD0_RDR0AD01_MASK       2
    #define RDR0AD0_RDR0AD02_MASK       4
    #define RDR0AD0_RDR0AD03_MASK       8
    #define RDR0AD0_RDR0AD04_MASK       16
    #define RDR0AD0_RDR0AD05_MASK       32
    #define RDR0AD0_RDR0AD06_MASK       64
    #define RDR0AD0_RDR0AD07_MASK       128
    

    /*** RDR1AD0 - Port AD0L Reduced Drive Register; 0x00000275 ***/
    union {
      byte Byte;
      struct {
        byte RDR1AD00    :1;                                       /* Port AD0L reduced drive bit 0 */
        byte RDR1AD01    :1;                                       /* Port AD0L reduced drive bit 1 */
        byte RDR1AD02    :1;                                       /* Port AD0L reduced drive bit 2 */
        byte RDR1AD03    :1;                                       /* Port AD0L reduced drive bit 3 */
        byte RDR1AD04    :1;                                       /* Port AD0L reduced drive bit 4 */
        byte RDR1AD05    :1;                                       /* Port AD0L reduced drive bit 5 */
        byte RDR1AD06    :1;                                       /* Port AD0L reduced drive bit 6 */
        byte RDR1AD07    :1;                                       /* Port AD0L reduced drive bit 7 */
      } Bits;
    } RDR1AD0STR;
    #define RDR1AD0                     _RDR01AD0.Overlap_STR.RDR1AD0STR.Byte
    #define RDR1AD0_RDR1AD00            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD00
    #define RDR1AD0_RDR1AD01            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD01
    #define RDR1AD0_RDR1AD02            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD02
    #define RDR1AD0_RDR1AD03            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD03
    #define RDR1AD0_RDR1AD04            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD04
    #define RDR1AD0_RDR1AD05            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD05
    #define RDR1AD0_RDR1AD06            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD06
    #define RDR1AD0_RDR1AD07            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD07
    
    #define RDR1AD0_RDR1AD00_MASK       1
    #define RDR1AD0_RDR1AD01_MASK       2
    #define RDR1AD0_RDR1AD02_MASK       4
    #define RDR1AD0_RDR1AD03_MASK       8
    #define RDR1AD0_RDR1AD04_MASK       16
    #define RDR1AD0_RDR1AD05_MASK       32
    #define RDR1AD0_RDR1AD06_MASK       64
    #define RDR1AD0_RDR1AD07_MASK       128
    
  } Overlap_STR;

  struct {
    word RDR1AD00    :1;                                       /* Port AD0 reduced drive bit 0 */
    word RDR1AD01    :1;                                       /* Port AD0 reduced drive bit 1 */
    word RDR1AD02    :1;                                       /* Port AD0 reduced drive bit 2 */
    word RDR1AD03    :1;                                       /* Port AD0 reduced drive bit 3 */
    word RDR1AD04    :1;                                       /* Port AD0 reduced drive bit 4 */
    word RDR1AD05    :1;                                       /* Port AD0 reduced drive bit 5 */
    word RDR1AD06    :1;                                       /* Port AD0 reduced drive bit 6 */
    word RDR1AD07    :1;                                       /* Port AD0 reduced drive bit 7 */
    word RDR0AD00    :1;                                       /* Port AD0 reduced drive bit 8 */
    word RDR0AD01    :1;                                       /* Port AD0 reduced drive bit 9 */
    word RDR0AD02    :1;                                       /* Port AD0 reduced drive bit 10 */
    word RDR0AD03    :1;                                       /* Port AD0 reduced drive bit 11 */
    word RDR0AD04    :1;                                       /* Port AD0 reduced drive bit 12 */
    word RDR0AD05    :1;                                       /* Port AD0 reduced drive bit 13 */
    word RDR0AD06    :1;                                       /* Port AD0 reduced drive bit 14 */
    word RDR0AD07    :1;                                       /* Port AD0 reduced drive bit 15 */
  } Bits;
  struct {
    word grpRDR1AD0 :8;
    word grpRDR0AD0 :8;
  } MergedBits;
} RDR01AD0STR;
extern volatile RDR01AD0STR _RDR01AD0 @(REG_BASE + 0x00000274);
#define RDR01AD0                        _RDR01AD0.Word
#define RDR01AD0_RDR1AD00               _RDR01AD0.Bits.RDR1AD00
#define RDR01AD0_RDR1AD01               _RDR01AD0.Bits.RDR1AD01
#define RDR01AD0_RDR1AD02               _RDR01AD0.Bits.RDR1AD02
#define RDR01AD0_RDR1AD03               _RDR01AD0.Bits.RDR1AD03
#define RDR01AD0_RDR1AD04               _RDR01AD0.Bits.RDR1AD04
#define RDR01AD0_RDR1AD05               _RDR01AD0.Bits.RDR1AD05
#define RDR01AD0_RDR1AD06               _RDR01AD0.Bits.RDR1AD06
#define RDR01AD0_RDR1AD07               _RDR01AD0.Bits.RDR1AD07
#define RDR01AD0_RDR0AD00               _RDR01AD0.Bits.RDR0AD00
#define RDR01AD0_RDR0AD01               _RDR01AD0.Bits.RDR0AD01
#define RDR01AD0_RDR0AD02               _RDR01AD0.Bits.RDR0AD02
#define RDR01AD0_RDR0AD03               _RDR01AD0.Bits.RDR0AD03
#define RDR01AD0_RDR0AD04               _RDR01AD0.Bits.RDR0AD04
#define RDR01AD0_RDR0AD05               _RDR01AD0.Bits.RDR0AD05
#define RDR01AD0_RDR0AD06               _RDR01AD0.Bits.RDR0AD06
#define RDR01AD0_RDR0AD07               _RDR01AD0.Bits.RDR0AD07
#define RDR01AD0_RDR1AD0                _RDR01AD0.MergedBits.grpRDR1AD0
#define RDR01AD0_RDR0AD0                _RDR01AD0.MergedBits.grpRDR0AD0

#define RDR01AD0_RDR1AD00_MASK          1
#define RDR01AD0_RDR1AD01_MASK          2
#define RDR01AD0_RDR1AD02_MASK          4
#define RDR01AD0_RDR1AD03_MASK          8
#define RDR01AD0_RDR1AD04_MASK          16
#define RDR01AD0_RDR1AD05_MASK          32
#define RDR01AD0_RDR1AD06_MASK          64
#define RDR01AD0_RDR1AD07_MASK          128
#define RDR01AD0_RDR0AD00_MASK          256
#define RDR01AD0_RDR0AD01_MASK          512
#define RDR01AD0_RDR0AD02_MASK          1024
#define RDR01AD0_RDR0AD03_MASK          2048
#define RDR01AD0_RDR0AD04_MASK          4096
#define RDR01AD0_RDR0AD05_MASK          8192
#define RDR01AD0_RDR0AD06_MASK          16384
#define RDR01AD0_RDR0AD07_MASK          32768
#define RDR01AD0_RDR1AD0_MASK           255
#define RDR01AD0_RDR1AD0_BITNUM         0
#define RDR01AD0_RDR0AD0_MASK           65280
#define RDR01AD0_RDR0AD0_BITNUM         8


/*** PER01AD0 - Port AD0 Pull Up Enable Register; 0x00000276 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PER0AD0 - Port AD0H Pull Up Enable Register; 0x00000276 ***/
    union {
      byte Byte;
      struct {
        byte PER0AD00    :1;                                       /* Port AD0H pull up enable bit 0 */
        byte PER0AD01    :1;                                       /* Port AD0H pull up enable bit 1 */
        byte PER0AD02    :1;                                       /* Port AD0H pull up enable bit 2 */
        byte PER0AD03    :1;                                       /* Port AD0H pull up enable bit 3 */
        byte PER0AD04    :1;                                       /* Port AD0H pull up enable bit 4 */
        byte PER0AD05    :1;                                       /* Port AD0H pull up enable bit 5 */
        byte PER0AD06    :1;                                       /* Port AD0H pull up enable bit 6 */
        byte PER0AD07    :1;                                       /* Port AD0H pull up enable bit 7 */
      } Bits;
    } PER0AD0STR;
    #define PER0AD0                     _PER01AD0.Overlap_STR.PER0AD0STR.Byte
    #define PER0AD0_PER0AD00            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD00
    #define PER0AD0_PER0AD01            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD01
    #define PER0AD0_PER0AD02            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD02
    #define PER0AD0_PER0AD03            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD03
    #define PER0AD0_PER0AD04            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD04
    #define PER0AD0_PER0AD05            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD05
    #define PER0AD0_PER0AD06            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD06
    #define PER0AD0_PER0AD07            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD07
    
    #define PER0AD0_PER0AD00_MASK       1
    #define PER0AD0_PER0AD01_MASK       2
    #define PER0AD0_PER0AD02_MASK       4
    #define PER0AD0_PER0AD03_MASK       8
    #define PER0AD0_PER0AD04_MASK       16
    #define PER0AD0_PER0AD05_MASK       32
    #define PER0AD0_PER0AD06_MASK       64
    #define PER0AD0_PER0AD07_MASK       128
    

    /*** PER1AD0 - Port AD0L Pull Up Enable Register; 0x00000277 ***/
    union {
      byte Byte;
      struct {
        byte PER1AD00    :1;                                       /* Port AD0L pull up enable bit 0 */
        byte PER1AD01    :1;                                       /* Port AD0L pull up enable bit 1 */
        byte PER1AD02    :1;                                       /* Port AD0L pull up enable bit 2 */
        byte PER1AD03    :1;                                       /* Port AD0L pull up enable bit 3 */
        byte PER1AD04    :1;                                       /* Port AD0L pull up enable bit 4 */
        byte PER1AD05    :1;                                       /* Port AD0L pull up enable bit 5 */
        byte PER1AD06    :1;                                       /* Port AD0L pull up enable bit 6 */
        byte PER1AD07    :1;                                       /* Port AD0L pull up enable bit 7 */
      } Bits;
    } PER1AD0STR;
    #define PER1AD0                     _PER01AD0.Overlap_STR.PER1AD0STR.Byte
    #define PER1AD0_PER1AD00            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD00
    #define PER1AD0_PER1AD01            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD01
    #define PER1AD0_PER1AD02            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD02
    #define PER1AD0_PER1AD03            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD03
    #define PER1AD0_PER1AD04            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD04
    #define PER1AD0_PER1AD05            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD05
    #define PER1AD0_PER1AD06            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD06
    #define PER1AD0_PER1AD07            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD07
    
