Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
    #define PER1AD0_PER1AD00_MASK       1
    #define PER1AD0_PER1AD01_MASK       2
    #define PER1AD0_PER1AD02_MASK       4
    #define PER1AD0_PER1AD03_MASK       8
    #define PER1AD0_PER1AD04_MASK       16
    #define PER1AD0_PER1AD05_MASK       32
    #define PER1AD0_PER1AD06_MASK       64
    #define PER1AD0_PER1AD07_MASK       128
    
  } Overlap_STR;

  struct {
    word PER1AD00    :1;                                       /* Port AD0 pull up enable bit 0 */
    word PER1AD01    :1;                                       /* Port AD0 pull up enable bit 1 */
    word PER1AD02    :1;                                       /* Port AD0 pull up enable bit 2 */
    word PER1AD03    :1;                                       /* Port AD0 pull up enable bit 3 */
    word PER1AD04    :1;                                       /* Port AD0 pull up enable bit 4 */
    word PER1AD05    :1;                                       /* Port AD0 pull up enable bit 5 */
    word PER1AD06    :1;                                       /* Port AD0 pull up enable bit 6 */
    word PER1AD07    :1;                                       /* Port AD0 pull up enable bit 7 */
    word PER0AD00    :1;                                       /* Port AD0 pull up enable bit 8 */
    word PER0AD01    :1;                                       /* Port AD0 pull up enable bit 9 */
    word PER0AD02    :1;                                       /* Port AD0 pull up enable bit 10 */
    word PER0AD03    :1;                                       /* Port AD0 pull up enable bit 11 */
    word PER0AD04    :1;                                       /* Port AD0 pull up enable bit 12 */
    word PER0AD05    :1;                                       /* Port AD0 pull up enable bit 13 */
    word PER0AD06    :1;                                       /* Port AD0 pull up enable bit 14 */
    word PER0AD07    :1;                                       /* Port AD0 pull up enable bit 15 */
  } Bits;
  struct {
    word grpPER1AD0 :8;
    word grpPER0AD0 :8;
  } MergedBits;
} PER01AD0STR;
extern volatile PER01AD0STR _PER01AD0 @(REG_BASE + 0x00000276);
#define PER01AD0                        _PER01AD0.Word
#define PER01AD0_PER1AD00               _PER01AD0.Bits.PER1AD00
#define PER01AD0_PER1AD01               _PER01AD0.Bits.PER1AD01
#define PER01AD0_PER1AD02               _PER01AD0.Bits.PER1AD02
#define PER01AD0_PER1AD03               _PER01AD0.Bits.PER1AD03
#define PER01AD0_PER1AD04               _PER01AD0.Bits.PER1AD04
#define PER01AD0_PER1AD05               _PER01AD0.Bits.PER1AD05
#define PER01AD0_PER1AD06               _PER01AD0.Bits.PER1AD06
#define PER01AD0_PER1AD07               _PER01AD0.Bits.PER1AD07
#define PER01AD0_PER0AD00               _PER01AD0.Bits.PER0AD00
#define PER01AD0_PER0AD01               _PER01AD0.Bits.PER0AD01
#define PER01AD0_PER0AD02               _PER01AD0.Bits.PER0AD02
#define PER01AD0_PER0AD03               _PER01AD0.Bits.PER0AD03
#define PER01AD0_PER0AD04               _PER01AD0.Bits.PER0AD04
#define PER01AD0_PER0AD05               _PER01AD0.Bits.PER0AD05
#define PER01AD0_PER0AD06               _PER01AD0.Bits.PER0AD06
#define PER01AD0_PER0AD07               _PER01AD0.Bits.PER0AD07
#define PER01AD0_PER1AD0                _PER01AD0.MergedBits.grpPER1AD0
#define PER01AD0_PER0AD0                _PER01AD0.MergedBits.grpPER0AD0

#define PER01AD0_PER1AD00_MASK          1
#define PER01AD0_PER1AD01_MASK          2
#define PER01AD0_PER1AD02_MASK          4
#define PER01AD0_PER1AD03_MASK          8
#define PER01AD0_PER1AD04_MASK          16
#define PER01AD0_PER1AD05_MASK          32
#define PER01AD0_PER1AD06_MASK          64
#define PER01AD0_PER1AD07_MASK          128
#define PER01AD0_PER0AD00_MASK          256
#define PER01AD0_PER0AD01_MASK          512
#define PER01AD0_PER0AD02_MASK          1024
#define PER01AD0_PER0AD03_MASK          2048
#define PER01AD0_PER0AD04_MASK          4096
#define PER01AD0_PER0AD05_MASK          8192
#define PER01AD0_PER0AD06_MASK          16384
#define PER01AD0_PER0AD07_MASK          32768
#define PER01AD0_PER1AD0_MASK           255
#define PER01AD0_PER1AD0_BITNUM         0
#define PER01AD0_PER0AD0_MASK           65280
#define PER01AD0_PER0AD0_BITNUM         8


/*** PT01AD1 - Port AD1 Data Register; 0x00000278 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PT0AD1 - Port AD1H Data Register; 0x00000278 ***/
    union {
      byte Byte;
      struct {
        byte PT0AD10     :1;                                       /* Port AD1 data bit 0 */
        byte PT0AD11     :1;                                       /* Port AD1 data bit 1 */
        byte PT0AD12     :1;                                       /* Port AD1 data bit 2 */
        byte PT0AD13     :1;                                       /* Port AD1 data bit 3 */
        byte PT0AD14     :1;                                       /* Port AD1 data bit 4 */
        byte PT0AD15     :1;                                       /* Port AD1 data bit 5 */
        byte PT0AD16     :1;                                       /* Port AD1 data bit 6 */
        byte PT0AD17     :1;                                       /* Port AD1 data bit 7 */
      } Bits;
    } PT0AD1STR;
    #define PT0AD1                      _PT01AD1.Overlap_STR.PT0AD1STR.Byte
    #define PT0AD1_PT0AD10              _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD10
    #define PT0AD1_PT0AD11              _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD11
    #define PT0AD1_PT0AD12              _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD12
    #define PT0AD1_PT0AD13              _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD13
    #define PT0AD1_PT0AD14              _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD14
    #define PT0AD1_PT0AD15              _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD15
    #define PT0AD1_PT0AD16              _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD16
    #define PT0AD1_PT0AD17              _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD17
    
    #define PT0AD1_PT0AD10_MASK         1
    #define PT0AD1_PT0AD11_MASK         2
    #define PT0AD1_PT0AD12_MASK         4
    #define PT0AD1_PT0AD13_MASK         8
    #define PT0AD1_PT0AD14_MASK         16
    #define PT0AD1_PT0AD15_MASK         32
    #define PT0AD1_PT0AD16_MASK         64
    #define PT0AD1_PT0AD17_MASK         128
    

