Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
    /*** PER1AD1 - Port AD1L Pull Up Enable Register; 0x0000027F ***/
    union {
      byte Byte;
      struct {
        byte PER1AD10    :1;                                       /* Port AD1L pull up enable bit 0 */
        byte PER1AD11    :1;                                       /* Port AD1L pull up enable bit 1 */
        byte PER1AD12    :1;                                       /* Port AD1L pull up enable bit 2 */
        byte PER1AD13    :1;                                       /* Port AD1L pull up enable bit 3 */
        byte PER1AD14    :1;                                       /* Port AD1L pull up enable bit 4 */
        byte PER1AD15    :1;                                       /* Port AD1L pull up enable bit 5 */
        byte PER1AD16    :1;                                       /* Port AD1L pull up enable bit 6 */
        byte PER1AD17    :1;                                       /* Port AD1L pull up enable bit 7 */
      } Bits;
    } PER1AD1STR;
    #define PER1AD1                     _PER01AD1.Overlap_STR.PER1AD1STR.Byte
    #define PER1AD1_PER1AD10            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD10
    #define PER1AD1_PER1AD11            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD11
    #define PER1AD1_PER1AD12            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD12
    #define PER1AD1_PER1AD13            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD13
    #define PER1AD1_PER1AD14            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD14
    #define PER1AD1_PER1AD15            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD15
    #define PER1AD1_PER1AD16            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD16
    #define PER1AD1_PER1AD17            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD17
    
    #define PER1AD1_PER1AD10_MASK       1
    #define PER1AD1_PER1AD11_MASK       2
    #define PER1AD1_PER1AD12_MASK       4
    #define PER1AD1_PER1AD13_MASK       8
    #define PER1AD1_PER1AD14_MASK       16
    #define PER1AD1_PER1AD15_MASK       32
    #define PER1AD1_PER1AD16_MASK       64
    #define PER1AD1_PER1AD17_MASK       128
    
  } Overlap_STR;

  struct {
    word PER1AD10    :1;                                       /* Port AD1 pull up enable bit 0 */
    word PER1AD11    :1;                                       /* Port AD1 pull up enable bit 1 */
    word PER1AD12    :1;                                       /* Port AD1 pull up enable bit 2 */
    word PER1AD13    :1;                                       /* Port AD1 pull up enable bit 3 */
    word PER1AD14    :1;                                       /* Port AD1 pull up enable bit 4 */
    word PER1AD15    :1;                                       /* Port AD1 pull up enable bit 5 */
    word PER1AD16    :1;                                       /* Port AD1 pull up enable bit 6 */
    word PER1AD17    :1;                                       /* Port AD1 pull up enable bit 7 */
    word PER0AD10    :1;                                       /* Port AD1 pull up enable bit 8 */
    word PER0AD11    :1;                                       /* Port AD1 pull up enable bit 9 */
    word PER0AD12    :1;                                       /* Port AD1 pull up enable bit 10 */
    word PER0AD13    :1;                                       /* Port AD1 pull up enable bit 11 */
    word PER0AD14    :1;                                       /* Port AD1 pull up enable bit 12 */
    word PER0AD15    :1;                                       /* Port AD1 pull up enable bit 13 */
    word PER0AD16    :1;                                       /* Port AD1 pull up enable bit 14 */
    word PER0AD17    :1;                                       /* Port AD1 pull up enable bit 15 */
  } Bits;
  struct {
    word grpPER1AD_10 :8;
    word grpPER0AD_10 :8;
  } MergedBits;
} PER01AD1STR;
extern volatile PER01AD1STR _PER01AD1 @(REG_BASE + 0x0000027E);
#define PER01AD1                        _PER01AD1.Word
#define PER01AD1_PER1AD10               _PER01AD1.Bits.PER1AD10
#define PER01AD1_PER1AD11               _PER01AD1.Bits.PER1AD11
#define PER01AD1_PER1AD12               _PER01AD1.Bits.PER1AD12
#define PER01AD1_PER1AD13               _PER01AD1.Bits.PER1AD13
#define PER01AD1_PER1AD14               _PER01AD1.Bits.PER1AD14
#define PER01AD1_PER1AD15               _PER01AD1.Bits.PER1AD15
#define PER01AD1_PER1AD16               _PER01AD1.Bits.PER1AD16
#define PER01AD1_PER1AD17               _PER01AD1.Bits.PER1AD17
#define PER01AD1_PER0AD10               _PER01AD1.Bits.PER0AD10
#define PER01AD1_PER0AD11               _PER01AD1.Bits.PER0AD11
#define PER01AD1_PER0AD12               _PER01AD1.Bits.PER0AD12
#define PER01AD1_PER0AD13               _PER01AD1.Bits.PER0AD13
#define PER01AD1_PER0AD14               _PER01AD1.Bits.PER0AD14
#define PER01AD1_PER0AD15               _PER01AD1.Bits.PER0AD15
#define PER01AD1_PER0AD16               _PER01AD1.Bits.PER0AD16
#define PER01AD1_PER0AD17               _PER01AD1.Bits.PER0AD17
#define PER01AD1_PER1AD_10              _PER01AD1.MergedBits.grpPER1AD_10
#define PER01AD1_PER0AD_10              _PER01AD1.MergedBits.grpPER0AD_10
#define PER01AD1_PER1AD                 PER01AD1_PER1AD_10
#define PER01AD1_PER0AD                 PER01AD1_PER0AD_10

#define PER01AD1_PER1AD10_MASK          1
#define PER01AD1_PER1AD11_MASK          2
#define PER01AD1_PER1AD12_MASK          4
#define PER01AD1_PER1AD13_MASK          8
#define PER01AD1_PER1AD14_MASK          16
#define PER01AD1_PER1AD15_MASK          32
#define PER01AD1_PER1AD16_MASK          64
#define PER01AD1_PER1AD17_MASK          128
#define PER01AD1_PER0AD10_MASK          256
#define PER01AD1_PER0AD11_MASK          512
#define PER01AD1_PER0AD12_MASK          1024
#define PER01AD1_PER0AD13_MASK          2048
#define PER01AD1_PER0AD14_MASK          4096
#define PER01AD1_PER0AD15_MASK          8192
#define PER01AD1_PER0AD16_MASK          16384
#define PER01AD1_PER0AD17_MASK          32768
#define PER01AD1_PER1AD_10_MASK         255
#define PER01AD1_PER1AD_10_BITNUM       0
#define PER01AD1_PER0AD_10_MASK         65280
#define PER01AD1_PER0AD_10_BITNUM       8


/*** CAN4CTL0 - MSCAN4 Control 0 Register; 0x00000280 ***/
typedef union {
  byte Byte;
  struct {
    byte INITRQ      :1;                                       /* Initialization Mode Request */
    byte SLPRQ       :1;                                       /* Sleep Mode Request */
    byte WUPE        :1;                                       /* Wake-Up Enable */
    byte TIME        :1;                                       /* Timer Enable */
    byte SYNCH       :1;                                       /* Synchronized Status */
    byte CSWAI       :1;                                       /* CAN Stops in Wait Mode */
    byte RXACT       :1;                                       /* Receiver Active Status */
    byte RXFRM       :1;                                       /* Received Frame Flag */
  } Bits;
} CAN4CTL0STR;
