Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
/*** CAN4RXDSR7 - MSCAN4 Receive Data Segment Register 7; 0x000002AB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN4RXDSR7STR;
extern volatile CAN4RXDSR7STR _CAN4RXDSR7 @(REG_BASE + 0x000002AB);
#define CAN4RXDSR7                      _CAN4RXDSR7.Byte
#define CAN4RXDSR7_DB0                  _CAN4RXDSR7.Bits.DB0
#define CAN4RXDSR7_DB1                  _CAN4RXDSR7.Bits.DB1
#define CAN4RXDSR7_DB2                  _CAN4RXDSR7.Bits.DB2
#define CAN4RXDSR7_DB3                  _CAN4RXDSR7.Bits.DB3
#define CAN4RXDSR7_DB4                  _CAN4RXDSR7.Bits.DB4
#define CAN4RXDSR7_DB5                  _CAN4RXDSR7.Bits.DB5
#define CAN4RXDSR7_DB6                  _CAN4RXDSR7.Bits.DB6
#define CAN4RXDSR7_DB7                  _CAN4RXDSR7.Bits.DB7

#define CAN4RXDSR7_DB0_MASK             1
#define CAN4RXDSR7_DB1_MASK             2
#define CAN4RXDSR7_DB2_MASK             4
#define CAN4RXDSR7_DB3_MASK             8
#define CAN4RXDSR7_DB4_MASK             16
#define CAN4RXDSR7_DB5_MASK             32
#define CAN4RXDSR7_DB6_MASK             64
#define CAN4RXDSR7_DB7_MASK             128


/*** CAN4RXDLR - MSCAN4 Receive Data Length Register; 0x000002AC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4RXDLRSTR;
extern volatile CAN4RXDLRSTR _CAN4RXDLR @(REG_BASE + 0x000002AC);
#define CAN4RXDLR                       _CAN4RXDLR.Byte
#define CAN4RXDLR_DLC0                  _CAN4RXDLR.Bits.DLC0
#define CAN4RXDLR_DLC1                  _CAN4RXDLR.Bits.DLC1
#define CAN4RXDLR_DLC2                  _CAN4RXDLR.Bits.DLC2
#define CAN4RXDLR_DLC3                  _CAN4RXDLR.Bits.DLC3
#define CAN4RXDLR_DLC                   _CAN4RXDLR.MergedBits.grpDLC

#define CAN4RXDLR_DLC0_MASK             1
#define CAN4RXDLR_DLC1_MASK             2
#define CAN4RXDLR_DLC2_MASK             4
#define CAN4RXDLR_DLC3_MASK             8
#define CAN4RXDLR_DLC_MASK              15
#define CAN4RXDLR_DLC_BITNUM            0


/*** CAN4RXTSR - MSCAN4 Receive Time Stamp Register; 0x000002AE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN4RXTSRH - MSCAN4 Receive Time Stamp Register High; 0x000002AE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
    } CAN4RXTSRHSTR;
    #define CAN4RXTSRH                  _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Byte
    #define CAN4RXTSRH_TSR8             _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR8
    #define CAN4RXTSRH_TSR9             _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR9
    #define CAN4RXTSRH_TSR10            _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR10
    #define CAN4RXTSRH_TSR11            _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR11
    #define CAN4RXTSRH_TSR12            _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR12
    #define CAN4RXTSRH_TSR13            _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR13
    #define CAN4RXTSRH_TSR14            _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR14
    #define CAN4RXTSRH_TSR15            _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR15
    
    #define CAN4RXTSRH_TSR8_MASK        1
    #define CAN4RXTSRH_TSR9_MASK        2
    #define CAN4RXTSRH_TSR10_MASK       4
    #define CAN4RXTSRH_TSR11_MASK       8
    #define CAN4RXTSRH_TSR12_MASK       16
    #define CAN4RXTSRH_TSR13_MASK       32
    #define CAN4RXTSRH_TSR14_MASK       64
    #define CAN4RXTSRH_TSR15_MASK       128
    

    /*** CAN4RXTSRL - MSCAN4 Receive Time Stamp Register Low; 0x000002AF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
    } CAN4RXTSRLSTR;
    #define CAN4RXTSRL                  _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Byte
    #define CAN4RXTSRL_TSR0             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR0
    #define CAN4RXTSRL_TSR1             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR1
    #define CAN4RXTSRL_TSR2             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR2
    #define CAN4RXTSRL_TSR3             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR3
    #define CAN4RXTSRL_TSR4             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR4
    #define CAN4RXTSRL_TSR5             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR5
    #define CAN4RXTSRL_TSR6             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR6
    #define CAN4RXTSRL_TSR7             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR7
    
    #define CAN4RXTSRL_TSR0_MASK        1
    #define CAN4RXTSRL_TSR1_MASK        2
    #define CAN4RXTSRL_TSR2_MASK        4
    #define CAN4RXTSRL_TSR3_MASK        8
    #define CAN4RXTSRL_TSR4_MASK        16
    #define CAN4RXTSRL_TSR5_MASK        32
    #define CAN4RXTSRL_TSR6_MASK        64
    #define CAN4RXTSRL_TSR7_MASK        128
    
  } Overlap_STR;

