Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
/*** ATD0STAT2 - ATD 0 Status Register 2; 0x000002CA ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0STAT2H - ATD 0 Status Register 2 High; 0x000002CA ***/
    union {
      byte Byte;
      struct {
        byte CCF8        :1;                                       /* Conversion Complete Flag 8 */
        byte CCF9        :1;                                       /* Conversion Complete Flag 9 */
        byte CCF10       :1;                                       /* Conversion Complete Flag 10 */
        byte CCF11       :1;                                       /* Conversion Complete Flag 11 */
        byte CCF12       :1;                                       /* Conversion Complete Flag 12 */
        byte CCF13       :1;                                       /* Conversion Complete Flag 13 */
        byte CCF14       :1;                                       /* Conversion Complete Flag 14 */
        byte CCF15       :1;                                       /* Conversion Complete Flag 15 */
      } Bits;
    } ATD0STAT2HSTR;
    #define ATD0STAT2H                  _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Byte
    #define ATD0STAT2H_CCF8             _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Bits.CCF8
    #define ATD0STAT2H_CCF9             _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Bits.CCF9
    #define ATD0STAT2H_CCF10            _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Bits.CCF10
    #define ATD0STAT2H_CCF11            _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Bits.CCF11
    #define ATD0STAT2H_CCF12            _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Bits.CCF12
    #define ATD0STAT2H_CCF13            _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Bits.CCF13
    #define ATD0STAT2H_CCF14            _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Bits.CCF14
    #define ATD0STAT2H_CCF15            _ATD0STAT2.Overlap_STR.ATD0STAT2HSTR.Bits.CCF15
    
    #define ATD0STAT2H_CCF8_MASK        1
    #define ATD0STAT2H_CCF9_MASK        2
    #define ATD0STAT2H_CCF10_MASK       4
    #define ATD0STAT2H_CCF11_MASK       8
    #define ATD0STAT2H_CCF12_MASK       16
    #define ATD0STAT2H_CCF13_MASK       32
    #define ATD0STAT2H_CCF14_MASK       64
    #define ATD0STAT2H_CCF15_MASK       128
    

    /*** ATD0STAT2L - ATD 0 Status Register 2 Low; 0x000002CB ***/
    union {
      byte Byte;
      struct {
        byte CCF0        :1;                                       /* Conversion Complete Flag 0 */
        byte CCF1        :1;                                       /* Conversion Complete Flag 1 */
        byte CCF2        :1;                                       /* Conversion Complete Flag 2 */
        byte CCF3        :1;                                       /* Conversion Complete Flag 3 */
        byte CCF4        :1;                                       /* Conversion Complete Flag 4 */
        byte CCF5        :1;                                       /* Conversion Complete Flag 5 */
        byte CCF6        :1;                                       /* Conversion Complete Flag 6 */
        byte CCF7        :1;                                       /* Conversion Complete Flag 7 */
      } Bits;
    } ATD0STAT2LSTR;
    #define ATD0STAT2L                  _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Byte
    #define ATD0STAT2L_CCF0             _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Bits.CCF0
    #define ATD0STAT2L_CCF1             _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Bits.CCF1
    #define ATD0STAT2L_CCF2             _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Bits.CCF2
    #define ATD0STAT2L_CCF3             _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Bits.CCF3
    #define ATD0STAT2L_CCF4             _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Bits.CCF4
    #define ATD0STAT2L_CCF5             _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Bits.CCF5
    #define ATD0STAT2L_CCF6             _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Bits.CCF6
    #define ATD0STAT2L_CCF7             _ATD0STAT2.Overlap_STR.ATD0STAT2LSTR.Bits.CCF7
    
    #define ATD0STAT2L_CCF0_MASK        1
    #define ATD0STAT2L_CCF1_MASK        2
    #define ATD0STAT2L_CCF2_MASK        4
    #define ATD0STAT2L_CCF3_MASK        8
    #define ATD0STAT2L_CCF4_MASK        16
    #define ATD0STAT2L_CCF5_MASK        32
    #define ATD0STAT2L_CCF6_MASK        64
    #define ATD0STAT2L_CCF7_MASK        128
    
  } Overlap_STR;

  struct {
    word CCF0        :1;                                       /* Conversion Complete Flag 0 */
    word CCF1        :1;                                       /* Conversion Complete Flag 1 */
    word CCF2        :1;                                       /* Conversion Complete Flag 2 */
    word CCF3        :1;                                       /* Conversion Complete Flag 3 */
    word CCF4        :1;                                       /* Conversion Complete Flag 4 */
    word CCF5        :1;                                       /* Conversion Complete Flag 5 */
    word CCF6        :1;                                       /* Conversion Complete Flag 6 */
    word CCF7        :1;                                       /* Conversion Complete Flag 7 */
    word CCF8        :1;                                       /* Conversion Complete Flag 8 */
    word CCF9        :1;                                       /* Conversion Complete Flag 9 */
    word CCF10       :1;                                       /* Conversion Complete Flag 10 */
    word CCF11       :1;                                       /* Conversion Complete Flag 11 */
    word CCF12       :1;                                       /* Conversion Complete Flag 12 */
    word CCF13       :1;                                       /* Conversion Complete Flag 13 */
    word CCF14       :1;                                       /* Conversion Complete Flag 14 */
    word CCF15       :1;                                       /* Conversion Complete Flag 15 */
  } Bits;
} ATD0STAT2STR;
extern volatile ATD0STAT2STR _ATD0STAT2 @(REG_BASE + 0x000002CA);
#define ATD0STAT2                       _ATD0STAT2.Word
#define ATD0STAT2_CCF0                  _ATD0STAT2.Bits.CCF0
#define ATD0STAT2_CCF1                  _ATD0STAT2.Bits.CCF1
#define ATD0STAT2_CCF2                  _ATD0STAT2.Bits.CCF2
#define ATD0STAT2_CCF3                  _ATD0STAT2.Bits.CCF3
#define ATD0STAT2_CCF4                  _ATD0STAT2.Bits.CCF4
#define ATD0STAT2_CCF5                  _ATD0STAT2.Bits.CCF5
#define ATD0STAT2_CCF6                  _ATD0STAT2.Bits.CCF6
#define ATD0STAT2_CCF7                  _ATD0STAT2.Bits.CCF7
#define ATD0STAT2_CCF8                  _ATD0STAT2.Bits.CCF8
#define ATD0STAT2_CCF9                  _ATD0STAT2.Bits.CCF9
#define ATD0STAT2_CCF10                 _ATD0STAT2.Bits.CCF10
#define ATD0STAT2_CCF11                 _ATD0STAT2.Bits.CCF11
#define ATD0STAT2_CCF12                 _ATD0STAT2.Bits.CCF12
#define ATD0STAT2_CCF13                 _ATD0STAT2.Bits.CCF13
#define ATD0STAT2_CCF14                 _ATD0STAT2.Bits.CCF14
#define ATD0STAT2_CCF15                 _ATD0STAT2.Bits.CCF15

