Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
#define ATD0STAT2_CCF0_MASK             1
#define ATD0STAT2_CCF1_MASK             2
#define ATD0STAT2_CCF2_MASK             4
#define ATD0STAT2_CCF3_MASK             8
#define ATD0STAT2_CCF4_MASK             16
#define ATD0STAT2_CCF5_MASK             32
#define ATD0STAT2_CCF6_MASK             64
#define ATD0STAT2_CCF7_MASK             128
#define ATD0STAT2_CCF8_MASK             256
#define ATD0STAT2_CCF9_MASK             512
#define ATD0STAT2_CCF10_MASK            1024
#define ATD0STAT2_CCF11_MASK            2048
#define ATD0STAT2_CCF12_MASK            4096
#define ATD0STAT2_CCF13_MASK            8192
#define ATD0STAT2_CCF14_MASK            16384
#define ATD0STAT2_CCF15_MASK            32768


/*** ATD0DIEN - ATD 0 Input Enable Register; 0x000002CC ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DIENH - ATD 0 Input Enable Register High; 0x000002CC ***/
    union {
      byte Byte;
      struct {
        byte IEN8        :1;                                       /* ATD Digital Input Enable on channel 8 */
        byte IEN9        :1;                                       /* ATD Digital Input Enable on channel 9 */
        byte IEN10       :1;                                       /* ATD Digital Input Enable on channel 10 */
        byte IEN11       :1;                                       /* ATD Digital Input Enable on channel 11 */
        byte IEN12       :1;                                       /* ATD Digital Input Enable on channel 12 */
        byte IEN13       :1;                                       /* ATD Digital Input Enable on channel 13 */
        byte IEN14       :1;                                       /* ATD Digital Input Enable on channel 14 */
        byte IEN15       :1;                                       /* ATD Digital Input Enable on channel 15 */
      } Bits;
    } ATD0DIENHSTR;
    #define ATD0DIENH                   _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Byte
    #define ATD0DIENH_IEN8              _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Bits.IEN8
    #define ATD0DIENH_IEN9              _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Bits.IEN9
    #define ATD0DIENH_IEN10             _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Bits.IEN10
    #define ATD0DIENH_IEN11             _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Bits.IEN11
    #define ATD0DIENH_IEN12             _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Bits.IEN12
    #define ATD0DIENH_IEN13             _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Bits.IEN13
    #define ATD0DIENH_IEN14             _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Bits.IEN14
    #define ATD0DIENH_IEN15             _ATD0DIEN.Overlap_STR.ATD0DIENHSTR.Bits.IEN15
    
    #define ATD0DIENH_IEN8_MASK         1
    #define ATD0DIENH_IEN9_MASK         2
    #define ATD0DIENH_IEN10_MASK        4
    #define ATD0DIENH_IEN11_MASK        8
    #define ATD0DIENH_IEN12_MASK        16
    #define ATD0DIENH_IEN13_MASK        32
    #define ATD0DIENH_IEN14_MASK        64
    #define ATD0DIENH_IEN15_MASK        128
    

    /*** ATD0DIENL - ATD 0 Input Enable Register Low; 0x000002CD ***/
    union {
      byte Byte;
      struct {
        byte IEN0        :1;                                       /* ATD Digital Input Enable on channel 0 */
        byte IEN1        :1;                                       /* ATD Digital Input Enable on channel 1 */
        byte IEN2        :1;                                       /* ATD Digital Input Enable on channel 2 */
        byte IEN3        :1;                                       /* ATD Digital Input Enable on channel 3 */
        byte IEN4        :1;                                       /* ATD Digital Input Enable on channel 4 */
        byte IEN5        :1;                                       /* ATD Digital Input Enable on channel 5 */
        byte IEN6        :1;                                       /* ATD Digital Input Enable on channel 6 */
        byte IEN7        :1;                                       /* ATD Digital Input Enable on channel 7 */
      } Bits;
    } ATD0DIENLSTR;
    #define ATD0DIENL                   _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Byte
    #define ATD0DIENL_IEN0              _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Bits.IEN0
    #define ATD0DIENL_IEN1              _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Bits.IEN1
    #define ATD0DIENL_IEN2              _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Bits.IEN2
    #define ATD0DIENL_IEN3              _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Bits.IEN3
    #define ATD0DIENL_IEN4              _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Bits.IEN4
    #define ATD0DIENL_IEN5              _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Bits.IEN5
    #define ATD0DIENL_IEN6              _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Bits.IEN6
    #define ATD0DIENL_IEN7              _ATD0DIEN.Overlap_STR.ATD0DIENLSTR.Bits.IEN7
    
    #define ATD0DIENL_IEN0_MASK         1
    #define ATD0DIENL_IEN1_MASK         2
    #define ATD0DIENL_IEN2_MASK         4
    #define ATD0DIENL_IEN3_MASK         8
    #define ATD0DIENL_IEN4_MASK         16
    #define ATD0DIENL_IEN5_MASK         32
    #define ATD0DIENL_IEN6_MASK         64
    #define ATD0DIENL_IEN7_MASK         128
    
  } Overlap_STR;

  struct {
    word IEN0        :1;                                       /* ATD Digital Input Enable on channel 0 */
    word IEN1        :1;                                       /* ATD Digital Input Enable on channel 1 */
    word IEN2        :1;                                       /* ATD Digital Input Enable on channel 2 */
    word IEN3        :1;                                       /* ATD Digital Input Enable on channel 3 */
    word IEN4        :1;                                       /* ATD Digital Input Enable on channel 4 */
    word IEN5        :1;                                       /* ATD Digital Input Enable on channel 5 */
    word IEN6        :1;                                       /* ATD Digital Input Enable on channel 6 */
    word IEN7        :1;                                       /* ATD Digital Input Enable on channel 7 */
    word IEN8        :1;                                       /* ATD Digital Input Enable on channel 8 */
    word IEN9        :1;                                       /* ATD Digital Input Enable on channel 9 */
    word IEN10       :1;                                       /* ATD Digital Input Enable on channel 10 */
    word IEN11       :1;                                       /* ATD Digital Input Enable on channel 11 */
    word IEN12       :1;                                       /* ATD Digital Input Enable on channel 12 */
    word IEN13       :1;                                       /* ATD Digital Input Enable on channel 13 */
    word IEN14       :1;                                       /* ATD Digital Input Enable on channel 14 */
    word IEN15       :1;                                       /* ATD Digital Input Enable on channel 15 */
  } Bits;
} ATD0DIENSTR;
extern volatile ATD0DIENSTR _ATD0DIEN @(REG_BASE + 0x000002CC);
#define ATD0DIEN                        _ATD0DIEN.Word
#define ATD0DIEN_IEN0                   _ATD0DIEN.Bits.IEN0
#define ATD0DIEN_IEN1                   _ATD0DIEN.Bits.IEN1
#define ATD0DIEN_IEN2                   _ATD0DIEN.Bits.IEN2
#define ATD0DIEN_IEN3                   _ATD0DIEN.Bits.IEN3
#define ATD0DIEN_IEN4                   _ATD0DIEN.Bits.IEN4
#define ATD0DIEN_IEN5                   _ATD0DIEN.Bits.IEN5
#define ATD0DIEN_IEN6                   _ATD0DIEN.Bits.IEN6
#define ATD0DIEN_IEN7                   _ATD0DIEN.Bits.IEN7
#define ATD0DIEN_IEN8                   _ATD0DIEN.Bits.IEN8
#define ATD0DIEN_IEN9                   _ATD0DIEN.Bits.IEN9
#define ATD0DIEN_IEN10                  _ATD0DIEN.Bits.IEN10
#define ATD0DIEN_IEN11                  _ATD0DIEN.Bits.IEN11
#define ATD0DIEN_IEN12                  _ATD0DIEN.Bits.IEN12
#define ATD0DIEN_IEN13                  _ATD0DIEN.Bits.IEN13
#define ATD0DIEN_IEN14                  _ATD0DIEN.Bits.IEN14
#define ATD0DIEN_IEN15                  _ATD0DIEN.Bits.IEN15

#define ATD0DIEN_IEN0_MASK              1
#define ATD0DIEN_IEN1_MASK              2
#define ATD0DIEN_IEN2_MASK              4
#define ATD0DIEN_IEN3_MASK              8
#define ATD0DIEN_IEN4_MASK              16
#define ATD0DIEN_IEN5_MASK              32
#define ATD0DIEN_IEN6_MASK              64
#define ATD0DIEN_IEN7_MASK              128
#define ATD0DIEN_IEN8_MASK              256
#define ATD0DIEN_IEN9_MASK              512
#define ATD0DIEN_IEN10_MASK             1024
#define ATD0DIEN_IEN11_MASK             2048
#define ATD0DIEN_IEN12_MASK             4096
#define ATD0DIEN_IEN13_MASK             8192
#define ATD0DIEN_IEN14_MASK             16384
#define ATD0DIEN_IEN15_MASK             32768


