Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
/*** ATD0CMPHT - ATD 0 Compare Higher Than Register; 0x000002CE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0CMPHTH - ATD 0 Compare Higher Than Register High; 0x000002CE ***/
    union {
      byte Byte;
      struct {
        byte CMPHT8      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 8 of a Sequence */
        byte CMPHT9      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 9 of a Sequence */
        byte CMPHT10     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 10 of a Sequence */
        byte CMPHT11     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 11 of a Sequence */
        byte CMPHT12     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 12 of a Sequence */
        byte CMPHT13     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 13 of a Sequence */
        byte CMPHT14     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 14 of a Sequence */
        byte CMPHT15     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 15 of a Sequence */
      } Bits;
    } ATD0CMPHTHSTR;
    #define ATD0CMPHTH                  _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Byte
    #define ATD0CMPHTH_CMPHT8           _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Bits.CMPHT8
    #define ATD0CMPHTH_CMPHT9           _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Bits.CMPHT9
    #define ATD0CMPHTH_CMPHT10          _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Bits.CMPHT10
    #define ATD0CMPHTH_CMPHT11          _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Bits.CMPHT11
    #define ATD0CMPHTH_CMPHT12          _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Bits.CMPHT12
    #define ATD0CMPHTH_CMPHT13          _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Bits.CMPHT13
    #define ATD0CMPHTH_CMPHT14          _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Bits.CMPHT14
    #define ATD0CMPHTH_CMPHT15          _ATD0CMPHT.Overlap_STR.ATD0CMPHTHSTR.Bits.CMPHT15
    
    #define ATD0CMPHTH_CMPHT8_MASK      1
    #define ATD0CMPHTH_CMPHT9_MASK      2
    #define ATD0CMPHTH_CMPHT10_MASK     4
    #define ATD0CMPHTH_CMPHT11_MASK     8
    #define ATD0CMPHTH_CMPHT12_MASK     16
    #define ATD0CMPHTH_CMPHT13_MASK     32
    #define ATD0CMPHTH_CMPHT14_MASK     64
    #define ATD0CMPHTH_CMPHT15_MASK     128
    

    /*** ATD0CMPHTL - ATD 0 Compare Higher Than Register Low; 0x000002CF ***/
    union {
      byte Byte;
      struct {
        byte CMPHT0      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 0 of a Sequence */
        byte CMPHT1      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 1 of a Sequence */
        byte CMPHT2      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 2 of a Sequence */
        byte CMPHT3      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 3 of a Sequence */
        byte CMPHT4      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 4 of a Sequence */
        byte CMPHT5      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 5 of a Sequence */
        byte CMPHT6      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 6 of a Sequence */
        byte CMPHT7      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 7 of a Sequence */
      } Bits;
    } ATD0CMPHTLSTR;
    #define ATD0CMPHTL                  _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Byte
    #define ATD0CMPHTL_CMPHT0           _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Bits.CMPHT0
    #define ATD0CMPHTL_CMPHT1           _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Bits.CMPHT1
    #define ATD0CMPHTL_CMPHT2           _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Bits.CMPHT2
    #define ATD0CMPHTL_CMPHT3           _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Bits.CMPHT3
    #define ATD0CMPHTL_CMPHT4           _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Bits.CMPHT4
    #define ATD0CMPHTL_CMPHT5           _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Bits.CMPHT5
    #define ATD0CMPHTL_CMPHT6           _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Bits.CMPHT6
    #define ATD0CMPHTL_CMPHT7           _ATD0CMPHT.Overlap_STR.ATD0CMPHTLSTR.Bits.CMPHT7
    
    #define ATD0CMPHTL_CMPHT0_MASK      1
    #define ATD0CMPHTL_CMPHT1_MASK      2
    #define ATD0CMPHTL_CMPHT2_MASK      4
    #define ATD0CMPHTL_CMPHT3_MASK      8
    #define ATD0CMPHTL_CMPHT4_MASK      16
    #define ATD0CMPHTL_CMPHT5_MASK      32
    #define ATD0CMPHTL_CMPHT6_MASK      64
    #define ATD0CMPHTL_CMPHT7_MASK      128
    
  } Overlap_STR;

  struct {
    word CMPHT0      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 0 of a Sequence */
    word CMPHT1      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 1 of a Sequence */
    word CMPHT2      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 2 of a Sequence */
    word CMPHT3      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 3 of a Sequence */
    word CMPHT4      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 4 of a Sequence */
    word CMPHT5      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 5 of a Sequence */
    word CMPHT6      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 6 of a Sequence */
    word CMPHT7      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 7 of a Sequence */
    word CMPHT8      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 8 of a Sequence */
    word CMPHT9      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 9 of a Sequence */
    word CMPHT10     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 10 of a Sequence */
    word CMPHT11     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 11 of a Sequence */
    word CMPHT12     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 12 of a Sequence */
    word CMPHT13     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 13 of a Sequence */
    word CMPHT14     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 14 of a Sequence */
    word CMPHT15     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 15 of a Sequence */
  } Bits;
} ATD0CMPHTSTR;
extern volatile ATD0CMPHTSTR _ATD0CMPHT @(REG_BASE + 0x000002CE);
#define ATD0CMPHT                       _ATD0CMPHT.Word
#define ATD0CMPHT_CMPHT0                _ATD0CMPHT.Bits.CMPHT0
#define ATD0CMPHT_CMPHT1                _ATD0CMPHT.Bits.CMPHT1
#define ATD0CMPHT_CMPHT2                _ATD0CMPHT.Bits.CMPHT2
#define ATD0CMPHT_CMPHT3                _ATD0CMPHT.Bits.CMPHT3
#define ATD0CMPHT_CMPHT4                _ATD0CMPHT.Bits.CMPHT4
#define ATD0CMPHT_CMPHT5                _ATD0CMPHT.Bits.CMPHT5
#define ATD0CMPHT_CMPHT6                _ATD0CMPHT.Bits.CMPHT6
#define ATD0CMPHT_CMPHT7                _ATD0CMPHT.Bits.CMPHT7
#define ATD0CMPHT_CMPHT8                _ATD0CMPHT.Bits.CMPHT8
#define ATD0CMPHT_CMPHT9                _ATD0CMPHT.Bits.CMPHT9
#define ATD0CMPHT_CMPHT10               _ATD0CMPHT.Bits.CMPHT10
#define ATD0CMPHT_CMPHT11               _ATD0CMPHT.Bits.CMPHT11
#define ATD0CMPHT_CMPHT12               _ATD0CMPHT.Bits.CMPHT12
#define ATD0CMPHT_CMPHT13               _ATD0CMPHT.Bits.CMPHT13
#define ATD0CMPHT_CMPHT14               _ATD0CMPHT.Bits.CMPHT14
#define ATD0CMPHT_CMPHT15               _ATD0CMPHT.Bits.CMPHT15

#define ATD0CMPHT_CMPHT0_MASK           1
#define ATD0CMPHT_CMPHT1_MASK           2
#define ATD0CMPHT_CMPHT2_MASK           4
#define ATD0CMPHT_CMPHT3_MASK           8
#define ATD0CMPHT_CMPHT4_MASK           16
#define ATD0CMPHT_CMPHT5_MASK           32
#define ATD0CMPHT_CMPHT6_MASK           64
#define ATD0CMPHT_CMPHT7_MASK           128
#define ATD0CMPHT_CMPHT8_MASK           256
#define ATD0CMPHT_CMPHT9_MASK           512
#define ATD0CMPHT_CMPHT10_MASK          1024
#define ATD0CMPHT_CMPHT11_MASK          2048
#define ATD0CMPHT_CMPHT12_MASK          4096
#define ATD0CMPHT_CMPHT13_MASK          8192
#define ATD0CMPHT_CMPHT14_MASK          16384
#define ATD0CMPHT_CMPHT15_MASK          32768


/*** ATD0DR0 - ATD 0 Conversion Result Register 0; 0x000002D0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DR0H - ATD 0 Conversion Result Register 0 High; 0x000002D0 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD0DR0HSTR;
    #define ATD0DR0H                    _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Byte
    #define ATD0DR0H_BIT8               _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT8
    #define ATD0DR0H_BIT9               _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT9
    #define ATD0DR0H_BIT10              _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT10
    #define ATD0DR0H_BIT11              _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT11
    #define ATD0DR0H_BIT12              _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT12
    #define ATD0DR0H_BIT13              _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT13
    #define ATD0DR0H_BIT14              _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT14
    #define ATD0DR0H_BIT15              _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT15
    
    #define ATD0DR0H_BIT8_MASK          1
    #define ATD0DR0H_BIT9_MASK          2
    #define ATD0DR0H_BIT10_MASK         4
    #define ATD0DR0H_BIT11_MASK         8
    #define ATD0DR0H_BIT12_MASK         16
    #define ATD0DR0H_BIT13_MASK         32
    #define ATD0DR0H_BIT14_MASK         64
    #define ATD0DR0H_BIT15_MASK         128
    

    /*** ATD0DR0L - ATD 0 Conversion Result Register 0 Low; 0x000002D1 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD0DR0LSTR;
    #define ATD0DR0L                    _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Byte
    #define ATD0DR0L_BIT0               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT0
    #define ATD0DR0L_BIT1               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT1
    #define ATD0DR0L_BIT2               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT2
    #define ATD0DR0L_BIT3               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT3
    #define ATD0DR0L_BIT4               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT4
    #define ATD0DR0L_BIT5               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT5
    #define ATD0DR0L_BIT6               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT6
    #define ATD0DR0L_BIT7               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT7
    
    #define ATD0DR0L_BIT0_MASK          1
    #define ATD0DR0L_BIT1_MASK          2
    #define ATD0DR0L_BIT2_MASK          4
    #define ATD0DR0L_BIT3_MASK          8
    #define ATD0DR0L_BIT4_MASK          16
    #define ATD0DR0L_BIT5_MASK          32
    #define ATD0DR0L_BIT6_MASK          64
    #define ATD0DR0L_BIT7_MASK          128
    
  } Overlap_STR;

