Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD0DR9STR;
extern volatile ATD0DR9STR _ATD0DR9 @(REG_BASE + 0x000002E2);
#define ATD0DR9                         _ATD0DR9.Word
#define ATD0DR9_BIT0                    _ATD0DR9.Bits.BIT0
#define ATD0DR9_BIT1                    _ATD0DR9.Bits.BIT1
#define ATD0DR9_BIT2                    _ATD0DR9.Bits.BIT2
#define ATD0DR9_BIT3                    _ATD0DR9.Bits.BIT3
#define ATD0DR9_BIT4                    _ATD0DR9.Bits.BIT4
#define ATD0DR9_BIT5                    _ATD0DR9.Bits.BIT5
#define ATD0DR9_BIT6                    _ATD0DR9.Bits.BIT6
#define ATD0DR9_BIT7                    _ATD0DR9.Bits.BIT7
#define ATD0DR9_BIT8                    _ATD0DR9.Bits.BIT8
#define ATD0DR9_BIT9                    _ATD0DR9.Bits.BIT9
#define ATD0DR9_BIT10                   _ATD0DR9.Bits.BIT10
#define ATD0DR9_BIT11                   _ATD0DR9.Bits.BIT11
#define ATD0DR9_BIT12                   _ATD0DR9.Bits.BIT12
#define ATD0DR9_BIT13                   _ATD0DR9.Bits.BIT13
#define ATD0DR9_BIT14                   _ATD0DR9.Bits.BIT14
#define ATD0DR9_BIT15                   _ATD0DR9.Bits.BIT15

#define ATD0DR9_BIT0_MASK               1
#define ATD0DR9_BIT1_MASK               2
#define ATD0DR9_BIT2_MASK               4
#define ATD0DR9_BIT3_MASK               8
#define ATD0DR9_BIT4_MASK               16
#define ATD0DR9_BIT5_MASK               32
#define ATD0DR9_BIT6_MASK               64
#define ATD0DR9_BIT7_MASK               128
#define ATD0DR9_BIT8_MASK               256
#define ATD0DR9_BIT9_MASK               512
#define ATD0DR9_BIT10_MASK              1024
#define ATD0DR9_BIT11_MASK              2048
#define ATD0DR9_BIT12_MASK              4096
#define ATD0DR9_BIT13_MASK              8192
#define ATD0DR9_BIT14_MASK              16384
#define ATD0DR9_BIT15_MASK              32768


/*** ATD0DR10 - ATD 0 Conversion Result Register 10; 0x000002E4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DR10H - ATD 0 Conversion Result Register 10 High; 0x000002E4 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD0DR10HSTR;
    #define ATD0DR10H                   _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Byte
    #define ATD0DR10H_BIT8              _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Bits.BIT8
    #define ATD0DR10H_BIT9              _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Bits.BIT9
    #define ATD0DR10H_BIT10             _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Bits.BIT10
    #define ATD0DR10H_BIT11             _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Bits.BIT11
    #define ATD0DR10H_BIT12             _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Bits.BIT12
    #define ATD0DR10H_BIT13             _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Bits.BIT13
    #define ATD0DR10H_BIT14             _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Bits.BIT14
    #define ATD0DR10H_BIT15             _ATD0DR10.Overlap_STR.ATD0DR10HSTR.Bits.BIT15
    
    #define ATD0DR10H_BIT8_MASK         1
    #define ATD0DR10H_BIT9_MASK         2
    #define ATD0DR10H_BIT10_MASK        4
    #define ATD0DR10H_BIT11_MASK        8
    #define ATD0DR10H_BIT12_MASK        16
    #define ATD0DR10H_BIT13_MASK        32
    #define ATD0DR10H_BIT14_MASK        64
    #define ATD0DR10H_BIT15_MASK        128
    

    /*** ATD0DR10L - ATD 0 Conversion Result Register 10 Low; 0x000002E5 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD0DR10LSTR;
    #define ATD0DR10L                   _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Byte
    #define ATD0DR10L_BIT0              _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Bits.BIT0
    #define ATD0DR10L_BIT1              _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Bits.BIT1
    #define ATD0DR10L_BIT2              _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Bits.BIT2
    #define ATD0DR10L_BIT3              _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Bits.BIT3
    #define ATD0DR10L_BIT4              _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Bits.BIT4
    #define ATD0DR10L_BIT5              _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Bits.BIT5
    #define ATD0DR10L_BIT6              _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Bits.BIT6
    #define ATD0DR10L_BIT7              _ATD0DR10.Overlap_STR.ATD0DR10LSTR.Bits.BIT7
    
