Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
/*** RDRR - Port R Reduced Drive Register; 0x0000036B ***/
typedef union {
  byte Byte;
  struct {
    byte RDRR0       :1;                                       /* Port R reduced drive bit 0 */
    byte RDRR1       :1;                                       /* Port R reduced drive bit 1 */
    byte RDRR2       :1;                                       /* Port R reduced drive bit 2 */
    byte RDRR3       :1;                                       /* Port R reduced drive bit 3 */
    byte RDRR4       :1;                                       /* Port R reduced drive bit 4 */
    byte RDRR5       :1;                                       /* Port R reduced drive bit 5 */
    byte RDRR6       :1;                                       /* Port R reduced drive bit 6 */
    byte RDRR7       :1;                                       /* Port R reduced drive bit 7 */
  } Bits;
} RDRRSTR;
extern volatile RDRRSTR _RDRR @(REG_BASE + 0x0000036B);
#define RDRR                            _RDRR.Byte
#define RDRR_RDRR0                      _RDRR.Bits.RDRR0
#define RDRR_RDRR1                      _RDRR.Bits.RDRR1
#define RDRR_RDRR2                      _RDRR.Bits.RDRR2
#define RDRR_RDRR3                      _RDRR.Bits.RDRR3
#define RDRR_RDRR4                      _RDRR.Bits.RDRR4
#define RDRR_RDRR5                      _RDRR.Bits.RDRR5
#define RDRR_RDRR6                      _RDRR.Bits.RDRR6
#define RDRR_RDRR7                      _RDRR.Bits.RDRR7

#define RDRR_RDRR0_MASK                 1
#define RDRR_RDRR1_MASK                 2
#define RDRR_RDRR2_MASK                 4
#define RDRR_RDRR3_MASK                 8
#define RDRR_RDRR4_MASK                 16
#define RDRR_RDRR5_MASK                 32
#define RDRR_RDRR6_MASK                 64
#define RDRR_RDRR7_MASK                 128


/*** PERR - Port R Pull Device Enable Register; 0x0000036C ***/
typedef union {
  byte Byte;
  struct {
    byte PERR0       :1;                                       /* Port R pull device enable bit 0 */
    byte PERR1       :1;                                       /* Port R pull device enable bit 1 */
    byte PERR2       :1;                                       /* Port R pull device enable bit 2 */
    byte PERR3       :1;                                       /* Port R pull device enable bit 3 */
    byte PERR4       :1;                                       /* Port R pull device enable bit 4 */
    byte PERR5       :1;                                       /* Port R pull device enable bit 5 */
    byte PERR6       :1;                                       /* Port R pull device enable bit 6 */
    byte PERR7       :1;                                       /* Port R pull device enable bit 7 */
  } Bits;
} PERRSTR;
extern volatile PERRSTR _PERR @(REG_BASE + 0x0000036C);
#define PERR                            _PERR.Byte
#define PERR_PERR0                      _PERR.Bits.PERR0
#define PERR_PERR1                      _PERR.Bits.PERR1
#define PERR_PERR2                      _PERR.Bits.PERR2
#define PERR_PERR3                      _PERR.Bits.PERR3
#define PERR_PERR4                      _PERR.Bits.PERR4
#define PERR_PERR5                      _PERR.Bits.PERR5
#define PERR_PERR6                      _PERR.Bits.PERR6
#define PERR_PERR7                      _PERR.Bits.PERR7

#define PERR_PERR0_MASK                 1
#define PERR_PERR1_MASK                 2
#define PERR_PERR2_MASK                 4
#define PERR_PERR3_MASK                 8
#define PERR_PERR4_MASK                 16
#define PERR_PERR5_MASK                 32
#define PERR_PERR6_MASK                 64
#define PERR_PERR7_MASK                 128


/*** PPSR - Port R Polarity Select Register; 0x0000036D ***/
typedef union {
  byte Byte;
  struct {
    byte PPSR0       :1;                                       /* Port R pull device select bit 0 */
    byte PPSR1       :1;                                       /* Port R pull device select bit 1 */
    byte PPSR2       :1;                                       /* Port R pull device select bit 2 */
    byte PPSR3       :1;                                       /* Port R pull device select bit 3 */
    byte PPSR4       :1;                                       /* Port R pull device select bit 4 */
    byte PPSR5       :1;                                       /* Port R pull device select bit 5 */
    byte PPSR6       :1;                                       /* Port R pull device select bit 6 */
    byte PPSR7       :1;                                       /* Port R pull device select bit 7 */
  } Bits;
} PPSRSTR;
extern volatile PPSRSTR _PPSR @(REG_BASE + 0x0000036D);
#define PPSR                            _PPSR.Byte
#define PPSR_PPSR0                      _PPSR.Bits.PPSR0
#define PPSR_PPSR1                      _PPSR.Bits.PPSR1
#define PPSR_PPSR2                      _PPSR.Bits.PPSR2
#define PPSR_PPSR3                      _PPSR.Bits.PPSR3
#define PPSR_PPSR4                      _PPSR.Bits.PPSR4
#define PPSR_PPSR5                      _PPSR.Bits.PPSR5
#define PPSR_PPSR6                      _PPSR.Bits.PPSR6
#define PPSR_PPSR7                      _PPSR.Bits.PPSR7

#define PPSR_PPSR0_MASK                 1
#define PPSR_PPSR1_MASK                 2
#define PPSR_PPSR2_MASK                 4
#define PPSR_PPSR3_MASK                 8
#define PPSR_PPSR4_MASK                 16
#define PPSR_PPSR5_MASK                 32
#define PPSR_PPSR6_MASK                 64
#define PPSR_PPSR7_MASK                 128


/*** PTRRR - Port R Routing Register; 0x0000036F ***/
typedef union {
  byte Byte;
  struct {
    byte PTRRR0      :1;                                       /* Port R  routing */
    byte PTRRR1      :1;                                       /* Port R  routing */
    byte PTRRR2      :1;                                       /* Port R  routing */
    byte PTRRR3      :1;                                       /* Port R  routing */
    byte PTRRR4      :1;                                       /* Port R  routing */
    byte PTRRR5      :1;                                       /* Port R  routing */
    byte PTRRR6      :1;                                       /* Port R  routing */
    byte PTRRR7      :1;                                       /* Port R  routing */
  } Bits;
} PTRRRSTR;
extern volatile PTRRRSTR _PTRRR @(REG_BASE + 0x0000036F);
#define PTRRR                           _PTRRR.Byte
#define PTRRR_PTRRR0                    _PTRRR.Bits.PTRRR0
#define PTRRR_PTRRR1                    _PTRRR.Bits.PTRRR1
#define PTRRR_PTRRR2                    _PTRRR.Bits.PTRRR2
#define PTRRR_PTRRR3                    _PTRRR.Bits.PTRRR3
#define PTRRR_PTRRR4                    _PTRRR.Bits.PTRRR4
#define PTRRR_PTRRR5                    _PTRRR.Bits.PTRRR5
#define PTRRR_PTRRR6                    _PTRRR.Bits.PTRRR6
#define PTRRR_PTRRR7                    _PTRRR.Bits.PTRRR7

