Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
#define PTLRR_PTLRR4_MASK               16
#define PTLRR_PTLRR5_MASK               32
#define PTLRR_PTLRR6_MASK               64
#define PTLRR_PTLRR7_MASK               128
#define PTLRR_PTLRR_4_MASK              240
#define PTLRR_PTLRR_4_BITNUM            4


/*** PTF - Port F Data Register; 0x00000378 ***/
typedef union {
  byte Byte;
  struct {
    byte PTF0        :1;                                       /* Port F general purpose input/output data bit 0 */
    byte PTF1        :1;                                       /* Port F general purpose input/output data bit 1 */
    byte PTF2        :1;                                       /* Port F general purpose input/output data bit 2 */
    byte PTF3        :1;                                       /* Port F general purpose input/output data bit 3 */
    byte PTF4        :1;                                       /* Port F general purpose input/output data bit 4 */
    byte PTF5        :1;                                       /* Port F general purpose input/output data bit 5 */
    byte PTF6        :1;                                       /* Port F general purpose input/output data bit 6 */
    byte PTF7        :1;                                       /* Port F general purpose input/output data bit 7 */
  } Bits;
} PTFSTR;
extern volatile PTFSTR _PTF @(REG_BASE + 0x00000378);
#define PTF                             _PTF.Byte
#define PTF_PTF0                        _PTF.Bits.PTF0
#define PTF_PTF1                        _PTF.Bits.PTF1
#define PTF_PTF2                        _PTF.Bits.PTF2
#define PTF_PTF3                        _PTF.Bits.PTF3
#define PTF_PTF4                        _PTF.Bits.PTF4
#define PTF_PTF5                        _PTF.Bits.PTF5
#define PTF_PTF6                        _PTF.Bits.PTF6
#define PTF_PTF7                        _PTF.Bits.PTF7

#define PTF_PTF0_MASK                   1
#define PTF_PTF1_MASK                   2
#define PTF_PTF2_MASK                   4
#define PTF_PTF3_MASK                   8
#define PTF_PTF4_MASK                   16
#define PTF_PTF5_MASK                   32
#define PTF_PTF6_MASK                   64
#define PTF_PTF7_MASK                   128


/*** PTIF - Port F Input Register; 0x00000379 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIF0       :1;                                       /* Port F input data bit 0 */
    byte PTIF1       :1;                                       /* Port F input data bit 1 */
    byte PTIF2       :1;                                       /* Port F input data bit 2 */
    byte PTIF3       :1;                                       /* Port F input data bit 3 */
    byte PTIF4       :1;                                       /* Port F input data bit 4 */
    byte PTIF5       :1;                                       /* Port F input data bit 5 */
    byte PTIF6       :1;                                       /* Port F input data bit 6 */
    byte PTIF7       :1;                                       /* Port F input data bit 7 */
  } Bits;
} PTIFSTR;
extern volatile PTIFSTR _PTIF @(REG_BASE + 0x00000379);
#define PTIF                            _PTIF.Byte
#define PTIF_PTIF0                      _PTIF.Bits.PTIF0
#define PTIF_PTIF1                      _PTIF.Bits.PTIF1
#define PTIF_PTIF2                      _PTIF.Bits.PTIF2
#define PTIF_PTIF3                      _PTIF.Bits.PTIF3
#define PTIF_PTIF4                      _PTIF.Bits.PTIF4
#define PTIF_PTIF5                      _PTIF.Bits.PTIF5
#define PTIF_PTIF6                      _PTIF.Bits.PTIF6
#define PTIF_PTIF7                      _PTIF.Bits.PTIF7

#define PTIF_PTIF0_MASK                 1
#define PTIF_PTIF1_MASK                 2
#define PTIF_PTIF2_MASK                 4
#define PTIF_PTIF3_MASK                 8
#define PTIF_PTIF4_MASK                 16
#define PTIF_PTIF5_MASK                 32
#define PTIF_PTIF6_MASK                 64
#define PTIF_PTIF7_MASK                 128


/*** DDRF - Port F Data Direction Register; 0x0000037A ***/
typedef union {
  byte Byte;
  struct {
    byte DDRF0       :1;                                       /* Port F data direction bit 0 */
    byte DDRF1       :1;                                       /* Port F data direction bit 1 */
    byte DDRF2       :1;                                       /* Port F data direction bit 2 */
    byte DDRF3       :1;                                       /* Port F data direction bit 3 */
    byte DDRF4       :1;                                       /* Port F data direction bit 4 */
    byte DDRF5       :1;                                       /* Port F data direction bit 5 */
    byte DDRF6       :1;                                       /* Port F data direction bit 6 */
    byte DDRF7       :1;                                       /* Port F data direction bit 7 */
  } Bits;
} DDRFSTR;
extern volatile DDRFSTR _DDRF @(REG_BASE + 0x0000037A);
#define DDRF                            _DDRF.Byte
#define DDRF_DDRF0                      _DDRF.Bits.DDRF0
#define DDRF_DDRF1                      _DDRF.Bits.DDRF1
#define DDRF_DDRF2                      _DDRF.Bits.DDRF2
#define DDRF_DDRF3                      _DDRF.Bits.DDRF3
#define DDRF_DDRF4                      _DDRF.Bits.DDRF4
#define DDRF_DDRF5                      _DDRF.Bits.DDRF5
#define DDRF_DDRF6                      _DDRF.Bits.DDRF6
#define DDRF_DDRF7                      _DDRF.Bits.DDRF7

#define DDRF_DDRF0_MASK                 1
#define DDRF_DDRF1_MASK                 2
#define DDRF_DDRF2_MASK                 4
#define DDRF_DDRF3_MASK                 8
#define DDRF_DDRF4_MASK                 16
#define DDRF_DDRF5_MASK                 32
#define DDRF_DDRF6_MASK                 64
#define DDRF_DDRF7_MASK                 128


/*** RDRF - Port F Reduced Drive Register; 0x0000037B ***/
typedef union {
  byte Byte;
  struct {
    byte RDRF0       :1;                                       /* Port F reduced drive bit 0 */
    byte RDRF1       :1;                                       /* Port F reduced drive bit 1 */
    byte RDRF2       :1;                                       /* Port F reduced drive bit 2 */
    byte RDRF3       :1;                                       /* Port F reduced drive bit 3 */
    byte RDRF4       :1;                                       /* Port F reduced drive bit 4 */
    byte RDRF5       :1;                                       /* Port F reduced drive bit 5 */
    byte RDRF6       :1;                                       /* Port F reduced drive bit 6 */
    byte RDRF7       :1;                                       /* Port F reduced drive bit 7 */
  } Bits;
} RDRFSTR;
extern volatile RDRFSTR _RDRF @(REG_BASE + 0x0000037B);
#define RDRF                            _RDRF.Byte
#define RDRF_RDRF0                      _RDRF.Bits.RDRF0
#define RDRF_RDRF1                      _RDRF.Bits.RDRF1
#define RDRF_RDRF2                      _RDRF.Bits.RDRF2
#define RDRF_RDRF3                      _RDRF.Bits.RDRF3
#define RDRF_RDRF4                      _RDRF.Bits.RDRF4
#define RDRF_RDRF5                      _RDRF.Bits.RDRF5
#define RDRF_RDRF6                      _RDRF.Bits.RDRF6
#define RDRF_RDRF7                      _RDRF.Bits.RDRF7

#define RDRF_RDRF0_MASK                 1
#define RDRF_RDRF1_MASK                 2
#define RDRF_RDRF2_MASK                 4
#define RDRF_RDRF3_MASK                 8
#define RDRF_RDRF4_MASK                 16
#define RDRF_RDRF5_MASK                 32
#define RDRF_RDRF6_MASK                 64
#define RDRF_RDRF7_MASK                 128


/*** PERF - Port F Pull Device Enable Register; 0x0000037C ***/
typedef union {
  byte Byte;
  struct {
    byte PERF0       :1;                                       /* Port F pull device enable bit 0 */
    byte PERF1       :1;                                       /* Port F pull device enable bit 1 */
    byte PERF2       :1;                                       /* Port F pull device enable bit 2 */
    byte PERF3       :1;                                       /* Port F pull device enable bit 3 */
    byte PERF4       :1;                                       /* Port F pull device enable bit 4 */
    byte PERF5       :1;                                       /* Port F pull device enable bit 5 */
    byte PERF6       :1;                                       /* Port F pull device enable bit 6 */
    byte PERF7       :1;                                       /* Port F pull device enable bit 7 */
  } Bits;
} PERFSTR;
