Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
extern volatile XGIF_5F_50STR _XGIF_5F_50 @(REG_BASE + 0x0000038C);
#define XGIF_5F_50                      _XGIF_5F_50.Word
#define XGIF_5F_50_XGIF_50              _XGIF_5F_50.Bits.XGIF_50
#define XGIF_5F_50_XGIF_51              _XGIF_5F_50.Bits.XGIF_51
#define XGIF_5F_50_XGIF_52              _XGIF_5F_50.Bits.XGIF_52
#define XGIF_5F_50_XGIF_53              _XGIF_5F_50.Bits.XGIF_53
#define XGIF_5F_50_XGIF_54              _XGIF_5F_50.Bits.XGIF_54
#define XGIF_5F_50_XGIF_55              _XGIF_5F_50.Bits.XGIF_55
#define XGIF_5F_50_XGIF_56              _XGIF_5F_50.Bits.XGIF_56
#define XGIF_5F_50_XGIF_57              _XGIF_5F_50.Bits.XGIF_57
#define XGIF_5F_50_XGIF_58              _XGIF_5F_50.Bits.XGIF_58
#define XGIF_5F_50_XGIF_59              _XGIF_5F_50.Bits.XGIF_59
#define XGIF_5F_50_XGIF_5A              _XGIF_5F_50.Bits.XGIF_5A
#define XGIF_5F_50_XGIF_5B              _XGIF_5F_50.Bits.XGIF_5B
#define XGIF_5F_50_XGIF_5C              _XGIF_5F_50.Bits.XGIF_5C
#define XGIF_5F_50_XGIF_5D              _XGIF_5F_50.Bits.XGIF_5D
#define XGIF_5F_50_XGIF_5E              _XGIF_5F_50.Bits.XGIF_5E
#define XGIF_5F_50_XGIF_5F              _XGIF_5F_50.Bits.XGIF_5F
#define XGIF_5F_50_XGIF__50             _XGIF_5F_50.MergedBits.grpXGIF__50
#define XGIF_5F_50_XGIF_                XGIF_5F_50_XGIF__50

#define XGIF_5F_50_XGIF_50_MASK         1
#define XGIF_5F_50_XGIF_51_MASK         2
#define XGIF_5F_50_XGIF_52_MASK         4
#define XGIF_5F_50_XGIF_53_MASK         8
#define XGIF_5F_50_XGIF_54_MASK         16
#define XGIF_5F_50_XGIF_55_MASK         32
#define XGIF_5F_50_XGIF_56_MASK         64
#define XGIF_5F_50_XGIF_57_MASK         128
#define XGIF_5F_50_XGIF_58_MASK         256
#define XGIF_5F_50_XGIF_59_MASK         512
#define XGIF_5F_50_XGIF_5A_MASK         1024
#define XGIF_5F_50_XGIF_5B_MASK         2048
#define XGIF_5F_50_XGIF_5C_MASK         4096
#define XGIF_5F_50_XGIF_5D_MASK         8192
#define XGIF_5F_50_XGIF_5E_MASK         16384
#define XGIF_5F_50_XGIF_5F_MASK         32768
#define XGIF_5F_50_XGIF__50_MASK        1023
#define XGIF_5F_50_XGIF__50_BITNUM      0


/*** XGIF_4F_40 - XGATE Channel Interrupt Flag Vector; 0x0000038E ***/
typedef union {
  word Word;
  struct {
    word XGIF_40     :1;                                       /* Channel Interrupt Flags */
    word XGIF_41     :1;                                       /* Channel Interrupt Flags */
    word XGIF_42     :1;                                       /* Channel Interrupt Flags */
    word XGIF_43     :1;                                       /* Channel Interrupt Flags */
    word XGIF_44     :1;                                       /* Channel Interrupt Flags */
    word XGIF_45     :1;                                       /* Channel Interrupt Flags */
    word XGIF_46     :1;                                       /* Channel Interrupt Flags */
    word XGIF_47     :1;                                       /* Channel Interrupt Flags */
    word XGIF_48     :1;                                       /* Channel Interrupt Flags */
    word XGIF_49     :1;                                       /* Channel Interrupt Flags */
    word XGIF_4A     :1;                                       /* Channel Interrupt Flags */
    word XGIF_4B     :1;                                       /* Channel Interrupt Flags */
    word XGIF_4C     :1;                                       /* Channel Interrupt Flags */
    word XGIF_4D     :1;                                       /* Channel Interrupt Flags */
    word XGIF_4E     :1;                                       /* Channel Interrupt Flags */
    word XGIF_4F     :1;                                       /* Channel Interrupt Flags */
  } Bits;
  struct {
    word grpXGIF__40 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_4F_40STR;
extern volatile XGIF_4F_40STR _XGIF_4F_40 @(REG_BASE + 0x0000038E);
#define XGIF_4F_40                      _XGIF_4F_40.Word
#define XGIF_4F_40_XGIF_40              _XGIF_4F_40.Bits.XGIF_40
#define XGIF_4F_40_XGIF_41              _XGIF_4F_40.Bits.XGIF_41
#define XGIF_4F_40_XGIF_42              _XGIF_4F_40.Bits.XGIF_42
#define XGIF_4F_40_XGIF_43              _XGIF_4F_40.Bits.XGIF_43
#define XGIF_4F_40_XGIF_44              _XGIF_4F_40.Bits.XGIF_44
#define XGIF_4F_40_XGIF_45              _XGIF_4F_40.Bits.XGIF_45
#define XGIF_4F_40_XGIF_46              _XGIF_4F_40.Bits.XGIF_46
#define XGIF_4F_40_XGIF_47              _XGIF_4F_40.Bits.XGIF_47
#define XGIF_4F_40_XGIF_48              _XGIF_4F_40.Bits.XGIF_48
#define XGIF_4F_40_XGIF_49              _XGIF_4F_40.Bits.XGIF_49
#define XGIF_4F_40_XGIF_4A              _XGIF_4F_40.Bits.XGIF_4A
#define XGIF_4F_40_XGIF_4B              _XGIF_4F_40.Bits.XGIF_4B
#define XGIF_4F_40_XGIF_4C              _XGIF_4F_40.Bits.XGIF_4C
#define XGIF_4F_40_XGIF_4D              _XGIF_4F_40.Bits.XGIF_4D
#define XGIF_4F_40_XGIF_4E              _XGIF_4F_40.Bits.XGIF_4E
#define XGIF_4F_40_XGIF_4F              _XGIF_4F_40.Bits.XGIF_4F
#define XGIF_4F_40_XGIF__40             _XGIF_4F_40.MergedBits.grpXGIF__40
#define XGIF_4F_40_XGIF_                XGIF_4F_40_XGIF__40

#define XGIF_4F_40_XGIF_40_MASK         1
#define XGIF_4F_40_XGIF_41_MASK         2
#define XGIF_4F_40_XGIF_42_MASK         4
#define XGIF_4F_40_XGIF_43_MASK         8
#define XGIF_4F_40_XGIF_44_MASK         16
#define XGIF_4F_40_XGIF_45_MASK         32
#define XGIF_4F_40_XGIF_46_MASK         64
#define XGIF_4F_40_XGIF_47_MASK         128
#define XGIF_4F_40_XGIF_48_MASK         256
#define XGIF_4F_40_XGIF_49_MASK         512
#define XGIF_4F_40_XGIF_4A_MASK         1024
#define XGIF_4F_40_XGIF_4B_MASK         2048
#define XGIF_4F_40_XGIF_4C_MASK         4096
#define XGIF_4F_40_XGIF_4D_MASK         8192
#define XGIF_4F_40_XGIF_4E_MASK         16384
#define XGIF_4F_40_XGIF_4F_MASK         32768
#define XGIF_4F_40_XGIF__40_MASK        1023
#define XGIF_4F_40_XGIF__40_BITNUM      0


/*** XGIF_3F_30 - XGATE Channel Interrupt Flag Vector; 0x00000390 ***/
typedef union {
  word Word;
  struct {
    word XGIF_30     :1;                                       /* Channel Interrupt Flags */
    word XGIF_31     :1;                                       /* Channel Interrupt Flags */
    word XGIF_32     :1;                                       /* Channel Interrupt Flags */
    word XGIF_33     :1;                                       /* Channel Interrupt Flags */
    word XGIF_34     :1;                                       /* Channel Interrupt Flags */
    word XGIF_35     :1;                                       /* Channel Interrupt Flags */
    word XGIF_36     :1;                                       /* Channel Interrupt Flags */
    word XGIF_37     :1;                                       /* Channel Interrupt Flags */
    word XGIF_38     :1;                                       /* Channel Interrupt Flags */
    word XGIF_39     :1;                                       /* Channel Interrupt Flags */
    word XGIF_3A     :1;                                       /* Channel Interrupt Flags */
    word XGIF_3B     :1;                                       /* Channel Interrupt Flags */
    word XGIF_3C     :1;                                       /* Channel Interrupt Flags */
    word XGIF_3D     :1;                                       /* Channel Interrupt Flags */
    word XGIF_3E     :1;                                       /* Channel Interrupt Flags */
    word XGIF_3F     :1;                                       /* Channel Interrupt Flags */
  } Bits;
  struct {
    word grpXGIF__30 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_3F_30STR;
