Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
extern volatile XGIF_3F_30STR _XGIF_3F_30 @(REG_BASE + 0x00000390);
#define XGIF_3F_30                      _XGIF_3F_30.Word
#define XGIF_3F_30_XGIF_30              _XGIF_3F_30.Bits.XGIF_30
#define XGIF_3F_30_XGIF_31              _XGIF_3F_30.Bits.XGIF_31
#define XGIF_3F_30_XGIF_32              _XGIF_3F_30.Bits.XGIF_32
#define XGIF_3F_30_XGIF_33              _XGIF_3F_30.Bits.XGIF_33
#define XGIF_3F_30_XGIF_34              _XGIF_3F_30.Bits.XGIF_34
#define XGIF_3F_30_XGIF_35              _XGIF_3F_30.Bits.XGIF_35
#define XGIF_3F_30_XGIF_36              _XGIF_3F_30.Bits.XGIF_36
#define XGIF_3F_30_XGIF_37              _XGIF_3F_30.Bits.XGIF_37
#define XGIF_3F_30_XGIF_38              _XGIF_3F_30.Bits.XGIF_38
#define XGIF_3F_30_XGIF_39              _XGIF_3F_30.Bits.XGIF_39
#define XGIF_3F_30_XGIF_3A              _XGIF_3F_30.Bits.XGIF_3A
#define XGIF_3F_30_XGIF_3B              _XGIF_3F_30.Bits.XGIF_3B
#define XGIF_3F_30_XGIF_3C              _XGIF_3F_30.Bits.XGIF_3C
#define XGIF_3F_30_XGIF_3D              _XGIF_3F_30.Bits.XGIF_3D
#define XGIF_3F_30_XGIF_3E              _XGIF_3F_30.Bits.XGIF_3E
#define XGIF_3F_30_XGIF_3F              _XGIF_3F_30.Bits.XGIF_3F
#define XGIF_3F_30_XGIF__30             _XGIF_3F_30.MergedBits.grpXGIF__30
#define XGIF_3F_30_XGIF_                XGIF_3F_30_XGIF__30

#define XGIF_3F_30_XGIF_30_MASK         1
#define XGIF_3F_30_XGIF_31_MASK         2
#define XGIF_3F_30_XGIF_32_MASK         4
#define XGIF_3F_30_XGIF_33_MASK         8
#define XGIF_3F_30_XGIF_34_MASK         16
#define XGIF_3F_30_XGIF_35_MASK         32
#define XGIF_3F_30_XGIF_36_MASK         64
#define XGIF_3F_30_XGIF_37_MASK         128
#define XGIF_3F_30_XGIF_38_MASK         256
#define XGIF_3F_30_XGIF_39_MASK         512
#define XGIF_3F_30_XGIF_3A_MASK         1024
#define XGIF_3F_30_XGIF_3B_MASK         2048
#define XGIF_3F_30_XGIF_3C_MASK         4096
#define XGIF_3F_30_XGIF_3D_MASK         8192
#define XGIF_3F_30_XGIF_3E_MASK         16384
#define XGIF_3F_30_XGIF_3F_MASK         32768
#define XGIF_3F_30_XGIF__30_MASK        1023
#define XGIF_3F_30_XGIF__30_BITNUM      0


/*** XGIF_2F_20 - XGATE Channel Interrupt Flag Vector; 0x00000392 ***/
typedef union {
  word Word;
  struct {
    word XGIF_20     :1;                                       /* Channel Interrupt Flags */
    word XGIF_21     :1;                                       /* Channel Interrupt Flags */
    word XGIF_22     :1;                                       /* Channel Interrupt Flags */
    word XGIF_23     :1;                                       /* Channel Interrupt Flags */
    word XGIF_24     :1;                                       /* Channel Interrupt Flags */
    word XGIF_25     :1;                                       /* Channel Interrupt Flags */
    word XGIF_26     :1;                                       /* Channel Interrupt Flags */
    word XGIF_27     :1;                                       /* Channel Interrupt Flags */
    word XGIF_28     :1;                                       /* Channel Interrupt Flags */
    word XGIF_29     :1;                                       /* Channel Interrupt Flags */
    word XGIF_2A     :1;                                       /* Channel Interrupt Flags */
    word XGIF_2B     :1;                                       /* Channel Interrupt Flags */
    word XGIF_2C     :1;                                       /* Channel Interrupt Flags */
    word XGIF_2D     :1;                                       /* Channel Interrupt Flags */
    word XGIF_2E     :1;                                       /* Channel Interrupt Flags */
    word XGIF_2F     :1;                                       /* Channel Interrupt Flags */
  } Bits;
  struct {
    word grpXGIF__20 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_2F_20STR;
extern volatile XGIF_2F_20STR _XGIF_2F_20 @(REG_BASE + 0x00000392);
#define XGIF_2F_20                      _XGIF_2F_20.Word
#define XGIF_2F_20_XGIF_20              _XGIF_2F_20.Bits.XGIF_20
#define XGIF_2F_20_XGIF_21              _XGIF_2F_20.Bits.XGIF_21
#define XGIF_2F_20_XGIF_22              _XGIF_2F_20.Bits.XGIF_22
#define XGIF_2F_20_XGIF_23              _XGIF_2F_20.Bits.XGIF_23
#define XGIF_2F_20_XGIF_24              _XGIF_2F_20.Bits.XGIF_24
#define XGIF_2F_20_XGIF_25              _XGIF_2F_20.Bits.XGIF_25
#define XGIF_2F_20_XGIF_26              _XGIF_2F_20.Bits.XGIF_26
#define XGIF_2F_20_XGIF_27              _XGIF_2F_20.Bits.XGIF_27
#define XGIF_2F_20_XGIF_28              _XGIF_2F_20.Bits.XGIF_28
#define XGIF_2F_20_XGIF_29              _XGIF_2F_20.Bits.XGIF_29
#define XGIF_2F_20_XGIF_2A              _XGIF_2F_20.Bits.XGIF_2A
#define XGIF_2F_20_XGIF_2B              _XGIF_2F_20.Bits.XGIF_2B
#define XGIF_2F_20_XGIF_2C              _XGIF_2F_20.Bits.XGIF_2C
#define XGIF_2F_20_XGIF_2D              _XGIF_2F_20.Bits.XGIF_2D
#define XGIF_2F_20_XGIF_2E              _XGIF_2F_20.Bits.XGIF_2E
#define XGIF_2F_20_XGIF_2F              _XGIF_2F_20.Bits.XGIF_2F
#define XGIF_2F_20_XGIF__20             _XGIF_2F_20.MergedBits.grpXGIF__20
#define XGIF_2F_20_XGIF_                XGIF_2F_20_XGIF__20

#define XGIF_2F_20_XGIF_20_MASK         1
#define XGIF_2F_20_XGIF_21_MASK         2
#define XGIF_2F_20_XGIF_22_MASK         4
#define XGIF_2F_20_XGIF_23_MASK         8
#define XGIF_2F_20_XGIF_24_MASK         16
#define XGIF_2F_20_XGIF_25_MASK         32
#define XGIF_2F_20_XGIF_26_MASK         64
#define XGIF_2F_20_XGIF_27_MASK         128
#define XGIF_2F_20_XGIF_28_MASK         256
#define XGIF_2F_20_XGIF_29_MASK         512
#define XGIF_2F_20_XGIF_2A_MASK         1024
#define XGIF_2F_20_XGIF_2B_MASK         2048
#define XGIF_2F_20_XGIF_2C_MASK         4096
#define XGIF_2F_20_XGIF_2D_MASK         8192
#define XGIF_2F_20_XGIF_2E_MASK         16384
#define XGIF_2F_20_XGIF_2F_MASK         32768
#define XGIF_2F_20_XGIF__20_MASK        1023
#define XGIF_2F_20_XGIF__20_BITNUM      0


/*** XGIF_1F_10 - XGATE Channel Interrupt Flag Vector; 0x00000394 ***/
typedef union {
  word Word;
  struct {
    word XGIF_10     :1;                                       /* Channel Interrupt Flags */
    word XGIF_11     :1;                                       /* Channel Interrupt Flags */
    word XGIF_12     :1;                                       /* Channel Interrupt Flags */
    word XGIF_13     :1;                                       /* Channel Interrupt Flags */
    word XGIF_14     :1;                                       /* Channel Interrupt Flags */
    word XGIF_15     :1;                                       /* Channel Interrupt Flags */
    word XGIF_16     :1;                                       /* Channel Interrupt Flags */
    word XGIF_17     :1;                                       /* Channel Interrupt Flags */
    word XGIF_18     :1;                                       /* Channel Interrupt Flags */
    word XGIF_19     :1;                                       /* Channel Interrupt Flags */
    word XGIF_1A     :1;                                       /* Channel Interrupt Flags */
    word XGIF_1B     :1;                                       /* Channel Interrupt Flags */
    word XGIF_1C     :1;                                       /* Channel Interrupt Flags */
    word XGIF_1D     :1;                                       /* Channel Interrupt Flags */
    word XGIF_1E     :1;                                       /* Channel Interrupt Flags */
    word XGIF_1F     :1;                                       /* Channel Interrupt Flags */
  } Bits;
  struct {
    word grpXGIF__10 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_1F_10STR;
