Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
extern volatile XGIF_1F_10STR _XGIF_1F_10 @(REG_BASE + 0x00000394);
#define XGIF_1F_10                      _XGIF_1F_10.Word
#define XGIF_1F_10_XGIF_10              _XGIF_1F_10.Bits.XGIF_10
#define XGIF_1F_10_XGIF_11              _XGIF_1F_10.Bits.XGIF_11
#define XGIF_1F_10_XGIF_12              _XGIF_1F_10.Bits.XGIF_12
#define XGIF_1F_10_XGIF_13              _XGIF_1F_10.Bits.XGIF_13
#define XGIF_1F_10_XGIF_14              _XGIF_1F_10.Bits.XGIF_14
#define XGIF_1F_10_XGIF_15              _XGIF_1F_10.Bits.XGIF_15
#define XGIF_1F_10_XGIF_16              _XGIF_1F_10.Bits.XGIF_16
#define XGIF_1F_10_XGIF_17              _XGIF_1F_10.Bits.XGIF_17
#define XGIF_1F_10_XGIF_18              _XGIF_1F_10.Bits.XGIF_18
#define XGIF_1F_10_XGIF_19              _XGIF_1F_10.Bits.XGIF_19
#define XGIF_1F_10_XGIF_1A              _XGIF_1F_10.Bits.XGIF_1A
#define XGIF_1F_10_XGIF_1B              _XGIF_1F_10.Bits.XGIF_1B
#define XGIF_1F_10_XGIF_1C              _XGIF_1F_10.Bits.XGIF_1C
#define XGIF_1F_10_XGIF_1D              _XGIF_1F_10.Bits.XGIF_1D
#define XGIF_1F_10_XGIF_1E              _XGIF_1F_10.Bits.XGIF_1E
#define XGIF_1F_10_XGIF_1F              _XGIF_1F_10.Bits.XGIF_1F
#define XGIF_1F_10_XGIF__10             _XGIF_1F_10.MergedBits.grpXGIF__10
#define XGIF_1F_10_XGIF_                XGIF_1F_10_XGIF__10

#define XGIF_1F_10_XGIF_10_MASK         1
#define XGIF_1F_10_XGIF_11_MASK         2
#define XGIF_1F_10_XGIF_12_MASK         4
#define XGIF_1F_10_XGIF_13_MASK         8
#define XGIF_1F_10_XGIF_14_MASK         16
#define XGIF_1F_10_XGIF_15_MASK         32
#define XGIF_1F_10_XGIF_16_MASK         64
#define XGIF_1F_10_XGIF_17_MASK         128
#define XGIF_1F_10_XGIF_18_MASK         256
#define XGIF_1F_10_XGIF_19_MASK         512
#define XGIF_1F_10_XGIF_1A_MASK         1024
#define XGIF_1F_10_XGIF_1B_MASK         2048
#define XGIF_1F_10_XGIF_1C_MASK         4096
#define XGIF_1F_10_XGIF_1D_MASK         8192
#define XGIF_1F_10_XGIF_1E_MASK         16384
#define XGIF_1F_10_XGIF_1F_MASK         32768
#define XGIF_1F_10_XGIF__10_MASK        1023
#define XGIF_1F_10_XGIF__10_BITNUM      0


/*** XGIF_0F_00 - XGATE Channel Interrupt Flag Vector; 0x00000396 ***/
typedef union {
  word Word;
  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word XGIF_09     :1;                                       /* Channel Interrupt Flags */
    word XGIF_0A     :1;                                       /* Channel Interrupt Flags */
    word XGIF_0B     :1;                                       /* Channel Interrupt Flags */
    word XGIF_0C     :1;                                       /* Channel Interrupt Flags */
    word XGIF_0D     :1;                                       /* Channel Interrupt Flags */
    word XGIF_0E     :1;                                       /* Channel Interrupt Flags */
    word XGIF_0F     :1;                                       /* Channel Interrupt Flags */
  } Bits;
} XGIF_0F_00STR;
extern volatile XGIF_0F_00STR _XGIF_0F_00 @(REG_BASE + 0x00000396);
#define XGIF_0F_00                      _XGIF_0F_00.Word
#define XGIF_0F_00_XGIF_09              _XGIF_0F_00.Bits.XGIF_09
#define XGIF_0F_00_XGIF_0A              _XGIF_0F_00.Bits.XGIF_0A
#define XGIF_0F_00_XGIF_0B              _XGIF_0F_00.Bits.XGIF_0B
#define XGIF_0F_00_XGIF_0C              _XGIF_0F_00.Bits.XGIF_0C
#define XGIF_0F_00_XGIF_0D              _XGIF_0F_00.Bits.XGIF_0D
#define XGIF_0F_00_XGIF_0E              _XGIF_0F_00.Bits.XGIF_0E
#define XGIF_0F_00_XGIF_0F              _XGIF_0F_00.Bits.XGIF_0F

#define XGIF_0F_00_XGIF_09_MASK         512
#define XGIF_0F_00_XGIF_0A_MASK         1024
#define XGIF_0F_00_XGIF_0B_MASK         2048
#define XGIF_0F_00_XGIF_0C_MASK         4096
#define XGIF_0F_00_XGIF_0D_MASK         8192
#define XGIF_0F_00_XGIF_0E_MASK         16384
#define XGIF_0F_00_XGIF_0F_MASK         32768


/*** XGSWT - XGATE Control Register; 0x00000398 ***/
typedef union {
  word Word;
  struct {
    word XGSWT_grp   :8;                                       /* Software Trigger Bits */ /*Warning: group name is duplicated with register name*/
    word XGSWTM      :8;                                       /* Software Trigger Mask */
  } Bits;
} XGSWTSTR;
extern volatile XGSWTSTR _XGSWT @(REG_BASE + 0x00000398);
#define XGSWT                           _XGSWT.Word
#define XGSWT_XGSWT                     _XGSWT.Bits.XGSWT_grp
#define XGSWT_XGSWTM                    _XGSWT.Bits.XGSWTM

#define XGSWT_XGSWT_MASK                255
#define XGSWT_XGSWT_BITNUM              0
#define XGSWT_XGSWTM_MASK               65280
#define XGSWT_XGSWTM_BITNUM             8


/*** XGSEM - XGATE Semaphore Register; 0x0000039A ***/
typedef union {
  word Word;
  struct {
    word XGSEM_grp   :8;                                       /* Semaphore Bits */ /*Warning: group name is duplicated with register name*/
    word XGSEMM      :8;                                       /* Semaphore Mask */
  } Bits;
} XGSEMSTR;
extern volatile XGSEMSTR _XGSEM @(REG_BASE + 0x0000039A);
#define XGSEM                           _XGSEM.Word
#define XGSEM_XGSEM                     _XGSEM.Bits.XGSEM_grp
#define XGSEM_XGSEMM                    _XGSEM.Bits.XGSEMM

#define XGSEM_XGSEM_MASK                255
#define XGSEM_XGSEM_BITNUM              0
#define XGSEM_XGSEMM_MASK               65280
#define XGSEM_XGSEMM_BITNUM             8


/*** XGCCR - XGATE Condition Code Register; 0x0000039D ***/
typedef union {
  byte Byte;
  struct {
    byte XGC         :1;                                       /* Carry Flag */
    byte XGV         :1;                                       /* Overflow Flag */
    byte XGZ         :1;                                       /* Zero Flag */
    byte XGN         :1;                                       /* Sign Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} XGCCRSTR;
extern volatile XGCCRSTR _XGCCR @(REG_BASE + 0x0000039D);
#define XGCCR                           _XGCCR.Byte
#define XGCCR_XGC                       _XGCCR.Bits.XGC
#define XGCCR_XGV                       _XGCCR.Bits.XGV
#define XGCCR_XGZ                       _XGCCR.Bits.XGZ
#define XGCCR_XGN                       _XGCCR.Bits.XGN

#define XGCCR_XGC_MASK                  1
#define XGCCR_XGV_MASK                  2
#define XGCCR_XGZ_MASK                  4
#define XGCCR_XGN_MASK                  8


/*** XGPC - XGATE Program Counter Register; 0x0000039E ***/
typedef union {
  word Word;
} XGPCSTR;
extern volatile XGPCSTR _XGPC @(REG_BASE + 0x0000039E);
#define XGPC                            _XGPC.Word


/*** XGR1 - XGATE Register 1; 0x000003A2 ***/
typedef union {
  word Word;
} XGR1STR;
extern volatile XGR1STR _XGR1 @(REG_BASE + 0x000003A2);
#define XGR1                            _XGR1.Word


