Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
#define CAN1TDSR6_DB6                    CAN1TXDSR6_DB6
#define CAN1TDSR6_DB7                    CAN1TXDSR6_DB7
#define CAN1TDSR6_DB0_MASK               CAN1TXDSR6_DB0_MASK
#define CAN1TDSR6_DB1_MASK               CAN1TXDSR6_DB1_MASK
#define CAN1TDSR6_DB2_MASK               CAN1TXDSR6_DB2_MASK
#define CAN1TDSR6_DB3_MASK               CAN1TXDSR6_DB3_MASK
#define CAN1TDSR6_DB4_MASK               CAN1TXDSR6_DB4_MASK
#define CAN1TDSR6_DB5_MASK               CAN1TXDSR6_DB5_MASK
#define CAN1TDSR6_DB6_MASK               CAN1TXDSR6_DB6_MASK
#define CAN1TDSR6_DB7_MASK               CAN1TXDSR6_DB7_MASK
#define CAN1TDSR7                        CAN1TXDSR7
#define CAN1TDSR7_DB0                    CAN1TXDSR7_DB0
#define CAN1TDSR7_DB1                    CAN1TXDSR7_DB1
#define CAN1TDSR7_DB2                    CAN1TXDSR7_DB2
#define CAN1TDSR7_DB3                    CAN1TXDSR7_DB3
#define CAN1TDSR7_DB4                    CAN1TXDSR7_DB4
#define CAN1TDSR7_DB5                    CAN1TXDSR7_DB5
#define CAN1TDSR7_DB6                    CAN1TXDSR7_DB6
#define CAN1TDSR7_DB7                    CAN1TXDSR7_DB7
#define CAN1TDSR7_DB0_MASK               CAN1TXDSR7_DB0_MASK
#define CAN1TDSR7_DB1_MASK               CAN1TXDSR7_DB1_MASK
#define CAN1TDSR7_DB2_MASK               CAN1TXDSR7_DB2_MASK
#define CAN1TDSR7_DB3_MASK               CAN1TXDSR7_DB3_MASK
#define CAN1TDSR7_DB4_MASK               CAN1TXDSR7_DB4_MASK
#define CAN1TDSR7_DB5_MASK               CAN1TXDSR7_DB5_MASK
#define CAN1TDSR7_DB6_MASK               CAN1TXDSR7_DB6_MASK
#define CAN1TDSR7_DB7_MASK               CAN1TXDSR7_DB7_MASK
#define CAN1TDLR                         CAN1TXDLR
#define CAN1TDLR_DLC0                    CAN1TXDLR_DLC0
#define CAN1TDLR_DLC1                    CAN1TXDLR_DLC1
#define CAN1TDLR_DLC2                    CAN1TXDLR_DLC2
#define CAN1TDLR_DLC3                    CAN1TXDLR_DLC3
#define CAN1TDLR_DLC                     CAN1TXDLR_DLC
#define CAN1TDLR_DLC0_MASK               CAN1TXDLR_DLC0_MASK
#define CAN1TDLR_DLC1_MASK               CAN1TXDLR_DLC1_MASK
#define CAN1TDLR_DLC2_MASK               CAN1TXDLR_DLC2_MASK
#define CAN1TDLR_DLC3_MASK               CAN1TXDLR_DLC3_MASK
#define CAN1TDLR_DLC_MASK                CAN1TXDLR_DLC_MASK
#define CAN1TDLR_DLC_BITNUM              CAN1TXDLR_DLC_BITNUM
#define CAN1TTBPR                        CAN1TXTBPR
#define CAN1TTBPR_PRIO0                  CAN1TXTBPR_PRIO0
#define CAN1TTBPR_PRIO1                  CAN1TXTBPR_PRIO1
#define CAN1TTBPR_PRIO2                  CAN1TXTBPR_PRIO2
#define CAN1TTBPR_PRIO3                  CAN1TXTBPR_PRIO3
#define CAN1TTBPR_PRIO4                  CAN1TXTBPR_PRIO4
#define CAN1TTBPR_PRIO5                  CAN1TXTBPR_PRIO5
#define CAN1TTBPR_PRIO6                  CAN1TXTBPR_PRIO6
#define CAN1TTBPR_PRIO7                  CAN1TXTBPR_PRIO7
#define CAN1TTBPR_PRIO0_MASK             CAN1TXTBPR_PRIO0_MASK
#define CAN1TTBPR_PRIO1_MASK             CAN1TXTBPR_PRIO1_MASK
#define CAN1TTBPR_PRIO2_MASK             CAN1TXTBPR_PRIO2_MASK
#define CAN1TTBPR_PRIO3_MASK             CAN1TXTBPR_PRIO3_MASK
#define CAN1TTBPR_PRIO4_MASK             CAN1TXTBPR_PRIO4_MASK
#define CAN1TTBPR_PRIO5_MASK             CAN1TXTBPR_PRIO5_MASK
#define CAN1TTBPR_PRIO6_MASK             CAN1TXTBPR_PRIO6_MASK
#define CAN1TTBPR_PRIO7_MASK             CAN1TXTBPR_PRIO7_MASK
#define CAN1TTSRH                        CAN1TXTSRH
#define CAN1TTSRH_TSR8                   CAN1TXTSRH_TSR8
#define CAN1TTSRH_TSR9                   CAN1TXTSRH_TSR9
#define CAN1TTSRH_TSR10                  CAN1TXTSRH_TSR10
#define CAN1TTSRH_TSR11                  CAN1TXTSRH_TSR11
#define CAN1TTSRH_TSR12                  CAN1TXTSRH_TSR12
#define CAN1TTSRH_TSR13                  CAN1TXTSRH_TSR13
#define CAN1TTSRH_TSR14                  CAN1TXTSRH_TSR14
#define CAN1TTSRH_TSR15                  CAN1TXTSRH_TSR15
#define CAN1TTSRH_TSR8_MASK              CAN1TXTSRH_TSR8_MASK
#define CAN1TTSRH_TSR9_MASK              CAN1TXTSRH_TSR9_MASK
#define CAN1TTSRH_TSR10_MASK             CAN1TXTSRH_TSR10_MASK
#define CAN1TTSRH_TSR11_MASK             CAN1TXTSRH_TSR11_MASK
#define CAN1TTSRH_TSR12_MASK             CAN1TXTSRH_TSR12_MASK
#define CAN1TTSRH_TSR13_MASK             CAN1TXTSRH_TSR13_MASK
#define CAN1TTSRH_TSR14_MASK             CAN1TXTSRH_TSR14_MASK
#define CAN1TTSRH_TSR15_MASK             CAN1TXTSRH_TSR15_MASK
#define CAN1TTSRL                        CAN1TXTSRL
#define CAN1TTSRL_TSR0                   CAN1TXTSRL_TSR0
#define CAN1TTSRL_TSR1                   CAN1TXTSRL_TSR1
#define CAN1TTSRL_TSR2                   CAN1TXTSRL_TSR2
#define CAN1TTSRL_TSR3                   CAN1TXTSRL_TSR3
#define CAN1TTSRL_TSR4                   CAN1TXTSRL_TSR4
#define CAN1TTSRL_TSR5                   CAN1TXTSRL_TSR5
#define CAN1TTSRL_TSR6                   CAN1TXTSRL_TSR6
#define CAN1TTSRL_TSR7                   CAN1TXTSRL_TSR7
#define CAN1TTSRL_TSR0_MASK              CAN1TXTSRL_TSR0_MASK
#define CAN1TTSRL_TSR1_MASK              CAN1TXTSRL_TSR1_MASK
#define CAN1TTSRL_TSR2_MASK              CAN1TXTSRL_TSR2_MASK
#define CAN1TTSRL_TSR3_MASK              CAN1TXTSRL_TSR3_MASK
#define CAN1TTSRL_TSR4_MASK              CAN1TXTSRL_TSR4_MASK
#define CAN1TTSRL_TSR5_MASK              CAN1TXTSRL_TSR5_MASK
#define CAN1TTSRL_TSR6_MASK              CAN1TXTSRL_TSR6_MASK
#define CAN1TTSRL_TSR7_MASK              CAN1TXTSRL_TSR7_MASK
#define CAN1TTSR                         CAN1TXTSR
#define CAN1TTSR_TSR0                    CAN1TXTSR_TSR0
#define CAN1TTSR_TSR1                    CAN1TXTSR_TSR1
#define CAN1TTSR_TSR2                    CAN1TXTSR_TSR2
#define CAN1TTSR_TSR3                    CAN1TXTSR_TSR3
#define CAN1TTSR_TSR4                    CAN1TXTSR_TSR4
#define CAN1TTSR_TSR5                    CAN1TXTSR_TSR5
#define CAN1TTSR_TSR6                    CAN1TXTSR_TSR6
#define CAN1TTSR_TSR7                    CAN1TXTSR_TSR7
#define CAN1TTSR_TSR8                    CAN1TXTSR_TSR8
#define CAN1TTSR_TSR9                    CAN1TXTSR_TSR9
#define CAN1TTSR_TSR10                   CAN1TXTSR_TSR10
#define CAN1TTSR_TSR11                   CAN1TXTSR_TSR11
#define CAN1TTSR_TSR12                   CAN1TXTSR_TSR12
#define CAN1TTSR_TSR13                   CAN1TXTSR_TSR13
#define CAN1TTSR_TSR14                   CAN1TXTSR_TSR14
#define CAN1TTSR_TSR15                   CAN1TXTSR_TSR15
#define CAN1TTSR_TSR0_MASK               CAN1TXTSR_TSR0_MASK
#define CAN1TTSR_TSR1_MASK               CAN1TXTSR_TSR1_MASK
#define CAN1TTSR_TSR2_MASK               CAN1TXTSR_TSR2_MASK
#define CAN1TTSR_TSR3_MASK               CAN1TXTSR_TSR3_MASK
#define CAN1TTSR_TSR4_MASK               CAN1TXTSR_TSR4_MASK
#define CAN1TTSR_TSR5_MASK               CAN1TXTSR_TSR5_MASK
#define CAN1TTSR_TSR6_MASK               CAN1TXTSR_TSR6_MASK
#define CAN1TTSR_TSR7_MASK               CAN1TXTSR_TSR7_MASK
#define CAN1TTSR_TSR8_MASK               CAN1TXTSR_TSR8_MASK
#define CAN1TTSR_TSR9_MASK               CAN1TXTSR_TSR9_MASK
#define CAN1TTSR_TSR10_MASK              CAN1TXTSR_TSR10_MASK
#define CAN1TTSR_TSR11_MASK              CAN1TXTSR_TSR11_MASK
#define CAN1TTSR_TSR12_MASK              CAN1TXTSR_TSR12_MASK
#define CAN1TTSR_TSR13_MASK              CAN1TXTSR_TSR13_MASK
#define CAN1TTSR_TSR14_MASK              CAN1TXTSR_TSR14_MASK
#define CAN1TTSR_TSR15_MASK              CAN1TXTSR_TSR15_MASK
#define CAN4RIDR0                        CAN4RXIDR0
#define CAN4RIDR0_ID21                   CAN4RXIDR0_ID21
#define CAN4RIDR0_ID22                   CAN4RXIDR0_ID22
#define CAN4RIDR0_ID23                   CAN4RXIDR0_ID23
#define CAN4RIDR0_ID24                   CAN4RXIDR0_ID24
#define CAN4RIDR0_ID25                   CAN4RXIDR0_ID25
#define CAN4RIDR0_ID26                   CAN4RXIDR0_ID26
#define CAN4RIDR0_ID27                   CAN4RXIDR0_ID27
#define CAN4RIDR0_ID28                   CAN4RXIDR0_ID28
#define CAN4RIDR_ARR                     This_symb_has_been_depreciated
#define CAN4RIDR0_ID21_MASK              CAN4RXIDR0_ID21_MASK
#define CAN4RIDR0_ID22_MASK              CAN4RXIDR0_ID22_MASK
#define CAN4RIDR0_ID23_MASK              CAN4RXIDR0_ID23_MASK
#define CAN4RIDR0_ID24_MASK              CAN4RXIDR0_ID24_MASK
#define CAN4RIDR0_ID25_MASK              CAN4RXIDR0_ID25_MASK
#define CAN4RIDR0_ID26_MASK              CAN4RXIDR0_ID26_MASK
#define CAN4RIDR0_ID27_MASK              CAN4RXIDR0_ID27_MASK
#define CAN4RIDR0_ID28_MASK              CAN4RXIDR0_ID28_MASK
#define CAN4RIDR1                        CAN4RXIDR1
#define CAN4RIDR1_ID15                   CAN4RXIDR1_ID15
#define CAN4RIDR1_ID16                   CAN4RXIDR1_ID16
#define CAN4RIDR1_ID17                   CAN4RXIDR1_ID17
#define CAN4RIDR1_IDE                    CAN4RXIDR1_IDE
#define CAN4RIDR1_SRR                    CAN4RXIDR1_SRR
#define CAN4RIDR1_ID18                   CAN4RXIDR1_ID18
#define CAN4RIDR1_ID19                   CAN4RXIDR1_ID19
#define CAN4RIDR1_ID20                   CAN4RXIDR1_ID20
#define CAN4RIDR1_ID_15                  CAN4RXIDR1_ID_15
#define CAN4RIDR1_ID_18                  CAN4RXIDR1_ID_18
#define CAN4RIDR1_ID                     CAN4RXIDR1_ID
#define CAN4RIDR1_ID15_MASK              CAN4RXIDR1_ID15_MASK
#define CAN4RIDR1_ID16_MASK              CAN4RXIDR1_ID16_MASK
#define CAN4RIDR1_ID17_MASK              CAN4RXIDR1_ID17_MASK
#define CAN4RIDR1_IDE_MASK               CAN4RXIDR1_IDE_MASK
#define CAN4RIDR1_SRR_MASK               CAN4RXIDR1_SRR_MASK
#define CAN4RIDR1_ID18_MASK              CAN4RXIDR1_ID18_MASK
#define CAN4RIDR1_ID19_MASK              CAN4RXIDR1_ID19_MASK
#define CAN4RIDR1_ID20_MASK              CAN4RXIDR1_ID20_MASK
#define CAN4RIDR1_ID_15_MASK             CAN4RXIDR1_ID_15_MASK
#define CAN4RIDR1_ID_15_BITNUM           CAN4RXIDR1_ID_15_BITNUM
#define CAN4RIDR1_ID_18_MASK             CAN4RXIDR1_ID_18_MASK
#define CAN4RIDR1_ID_18_BITNUM           CAN4RXIDR1_ID_18_BITNUM
#define CAN4RIDR2                        CAN4RXIDR2
#define CAN4RIDR2_ID7                    CAN4RXIDR2_ID7
#define CAN4RIDR2_ID8                    CAN4RXIDR2_ID8
#define CAN4RIDR2_ID9                    CAN4RXIDR2_ID9
#define CAN4RIDR2_ID10                   CAN4RXIDR2_ID10
#define CAN4RIDR2_ID11                   CAN4RXIDR2_ID11
#define CAN4RIDR2_ID12                   CAN4RXIDR2_ID12
#define CAN4RIDR2_ID13                   CAN4RXIDR2_ID13
#define CAN4RIDR2_ID14                   CAN4RXIDR2_ID14
#define CAN4RIDR2_ID7_MASK               CAN4RXIDR2_ID7_MASK
#define CAN4RIDR2_ID8_MASK               CAN4RXIDR2_ID8_MASK
#define CAN4RIDR2_ID9_MASK               CAN4RXIDR2_ID9_MASK
#define CAN4RIDR2_ID10_MASK              CAN4RXIDR2_ID10_MASK
#define CAN4RIDR2_ID11_MASK              CAN4RXIDR2_ID11_MASK
#define CAN4RIDR2_ID12_MASK              CAN4RXIDR2_ID12_MASK
#define CAN4RIDR2_ID13_MASK              CAN4RXIDR2_ID13_MASK
#define CAN4RIDR2_ID14_MASK              CAN4RXIDR2_ID14_MASK
#define CAN4RIDR3                        CAN4RXIDR3
#define CAN4RIDR3_RTR                    CAN4RXIDR3_RTR
#define CAN4RIDR3_ID0                    CAN4RXIDR3_ID0
#define CAN4RIDR3_ID1                    CAN4RXIDR3_ID1
#define CAN4RIDR3_ID2                    CAN4RXIDR3_ID2
#define CAN4RIDR3_ID3                    CAN4RXIDR3_ID3
#define CAN4RIDR3_ID4                    CAN4RXIDR3_ID4
#define CAN4RIDR3_ID5                    CAN4RXIDR3_ID5
#define CAN4RIDR3_ID6                    CAN4RXIDR3_ID6
#define CAN4RIDR3_ID                     CAN4RXIDR3_ID
#define CAN4RIDR3_RTR_MASK               CAN4RXIDR3_RTR_MASK
#define CAN4RIDR3_ID0_MASK               CAN4RXIDR3_ID0_MASK
#define CAN4RIDR3_ID1_MASK               CAN4RXIDR3_ID1_MASK
#define CAN4RIDR3_ID2_MASK               CAN4RXIDR3_ID2_MASK
#define CAN4RIDR3_ID3_MASK               CAN4RXIDR3_ID3_MASK
#define CAN4RIDR3_ID4_MASK               CAN4RXIDR3_ID4_MASK
#define CAN4RIDR3_ID5_MASK               CAN4RXIDR3_ID5_MASK
#define CAN4RIDR3_ID6_MASK               CAN4RXIDR3_ID6_MASK
#define CAN4RIDR3_ID_MASK                CAN4RXIDR3_ID_MASK
#define CAN4RIDR3_ID_BITNUM              CAN4RXIDR3_ID_BITNUM
#define CAN4RDSR0                        CAN4RXDSR0
#define CAN4RDSR0_DB0                    CAN4RXDSR0_DB0
#define CAN4RDSR0_DB1                    CAN4RXDSR0_DB1
#define CAN4RDSR0_DB2                    CAN4RXDSR0_DB2
#define CAN4RDSR0_DB3                    CAN4RXDSR0_DB3
#define CAN4RDSR0_DB4                    CAN4RXDSR0_DB4
#define CAN4RDSR0_DB5                    CAN4RXDSR0_DB5
#define CAN4RDSR0_DB6                    CAN4RXDSR0_DB6
#define CAN4RDSR0_DB7                    CAN4RXDSR0_DB7
#define CAN4RDSR_ARR                     This_symb_has_been_depreciated
#define CAN4RDSR0_DB0_MASK               CAN4RXDSR0_DB0_MASK
#define CAN4RDSR0_DB1_MASK               CAN4RXDSR0_DB1_MASK
#define CAN4RDSR0_DB2_MASK               CAN4RXDSR0_DB2_MASK
#define CAN4RDSR0_DB3_MASK               CAN4RXDSR0_DB3_MASK
#define CAN4RDSR0_DB4_MASK               CAN4RXDSR0_DB4_MASK
#define CAN4RDSR0_DB5_MASK               CAN4RXDSR0_DB5_MASK
#define CAN4RDSR0_DB6_MASK               CAN4RXDSR0_DB6_MASK
#define CAN4RDSR0_DB7_MASK               CAN4RXDSR0_DB7_MASK
#define CAN4RDSR1                        CAN4RXDSR1
#define CAN4RDSR1_DB0                    CAN4RXDSR1_DB0
#define CAN4RDSR1_DB1                    CAN4RXDSR1_DB1
#define CAN4RDSR1_DB2                    CAN4RXDSR1_DB2
#define CAN4RDSR1_DB3                    CAN4RXDSR1_DB3
#define CAN4RDSR1_DB4                    CAN4RXDSR1_DB4
#define CAN4RDSR1_DB5                    CAN4RXDSR1_DB5
#define CAN4RDSR1_DB6                    CAN4RXDSR1_DB6
#define CAN4RDSR1_DB7                    CAN4RXDSR1_DB7
#define CAN4RDSR1_DB0_MASK               CAN4RXDSR1_DB0_MASK
#define CAN4RDSR1_DB1_MASK               CAN4RXDSR1_DB1_MASK
#define CAN4RDSR1_DB2_MASK               CAN4RXDSR1_DB2_MASK
#define CAN4RDSR1_DB3_MASK               CAN4RXDSR1_DB3_MASK
#define CAN4RDSR1_DB4_MASK               CAN4RXDSR1_DB4_MASK
#define CAN4RDSR1_DB5_MASK               CAN4RXDSR1_DB5_MASK
#define CAN4RDSR1_DB6_MASK               CAN4RXDSR1_DB6_MASK
#define CAN4RDSR1_DB7_MASK               CAN4RXDSR1_DB7_MASK
#define CAN4RDSR2                        CAN4RXDSR2
#define CAN4RDSR2_DB0                    CAN4RXDSR2_DB0
#define CAN4RDSR2_DB1                    CAN4RXDSR2_DB1
#define CAN4RDSR2_DB2                    CAN4RXDSR2_DB2
#define CAN4RDSR2_DB3                    CAN4RXDSR2_DB3
#define CAN4RDSR2_DB4                    CAN4RXDSR2_DB4
#define CAN4RDSR2_DB5                    CAN4RXDSR2_DB5
#define CAN4RDSR2_DB6                    CAN4RXDSR2_DB6
#define CAN4RDSR2_DB7                    CAN4RXDSR2_DB7
#define CAN4RDSR2_DB0_MASK               CAN4RXDSR2_DB0_MASK
#define CAN4RDSR2_DB1_MASK               CAN4RXDSR2_DB1_MASK
#define CAN4RDSR2_DB2_MASK               CAN4RXDSR2_DB2_MASK
#define CAN4RDSR2_DB3_MASK               CAN4RXDSR2_DB3_MASK
#define CAN4RDSR2_DB4_MASK               CAN4RXDSR2_DB4_MASK
#define CAN4RDSR2_DB5_MASK               CAN4RXDSR2_DB5_MASK
#define CAN4RDSR2_DB6_MASK               CAN4RXDSR2_DB6_MASK
#define CAN4RDSR2_DB7_MASK               CAN4RXDSR2_DB7_MASK
#define CAN4RDSR3                        CAN4RXDSR3
#define CAN4RDSR3_DB0                    CAN4RXDSR3_DB0
#define CAN4RDSR3_DB1                    CAN4RXDSR3_DB1
#define CAN4RDSR3_DB2                    CAN4RXDSR3_DB2
#define CAN4RDSR3_DB3                    CAN4RXDSR3_DB3
#define CAN4RDSR3_DB4                    CAN4RXDSR3_DB4
#define CAN4RDSR3_DB5                    CAN4RXDSR3_DB5
#define CAN4RDSR3_DB6                    CAN4RXDSR3_DB6
#define CAN4RDSR3_DB7                    CAN4RXDSR3_DB7
#define CAN4RDSR3_DB0_MASK               CAN4RXDSR3_DB0_MASK
#define CAN4RDSR3_DB1_MASK               CAN4RXDSR3_DB1_MASK
#define CAN4RDSR3_DB2_MASK               CAN4RXDSR3_DB2_MASK
#define CAN4RDSR3_DB3_MASK               CAN4RXDSR3_DB3_MASK
#define CAN4RDSR3_DB4_MASK               CAN4RXDSR3_DB4_MASK
#define CAN4RDSR3_DB5_MASK               CAN4RXDSR3_DB5_MASK
#define CAN4RDSR3_DB6_MASK               CAN4RXDSR3_DB6_MASK
#define CAN4RDSR3_DB7_MASK               CAN4RXDSR3_DB7_MASK
#define CAN4RDSR4                        CAN4RXDSR4
#define CAN4RDSR4_DB0                    CAN4RXDSR4_DB0
#define CAN4RDSR4_DB1                    CAN4RXDSR4_DB1
#define CAN4RDSR4_DB2                    CAN4RXDSR4_DB2
#define CAN4RDSR4_DB3                    CAN4RXDSR4_DB3
#define CAN4RDSR4_DB4                    CAN4RXDSR4_DB4
#define CAN4RDSR4_DB5                    CAN4RXDSR4_DB5
#define CAN4RDSR4_DB6                    CAN4RXDSR4_DB6
#define CAN4RDSR4_DB7                    CAN4RXDSR4_DB7
#define CAN4RDSR4_DB0_MASK               CAN4RXDSR4_DB0_MASK
#define CAN4RDSR4_DB1_MASK               CAN4RXDSR4_DB1_MASK
#define CAN4RDSR4_DB2_MASK               CAN4RXDSR4_DB2_MASK
#define CAN4RDSR4_DB3_MASK               CAN4RXDSR4_DB3_MASK
#define CAN4RDSR4_DB4_MASK               CAN4RXDSR4_DB4_MASK
#define CAN4RDSR4_DB5_MASK               CAN4RXDSR4_DB5_MASK
#define CAN4RDSR4_DB6_MASK               CAN4RXDSR4_DB6_MASK
#define CAN4RDSR4_DB7_MASK               CAN4RXDSR4_DB7_MASK
#define CAN4RDSR5                        CAN4RXDSR5
#define CAN4RDSR5_DB0                    CAN4RXDSR5_DB0
#define CAN4RDSR5_DB1                    CAN4RXDSR5_DB1
#define CAN4RDSR5_DB2                    CAN4RXDSR5_DB2
#define CAN4RDSR5_DB3                    CAN4RXDSR5_DB3
#define CAN4RDSR5_DB4                    CAN4RXDSR5_DB4
#define CAN4RDSR5_DB5                    CAN4RXDSR5_DB5
#define CAN4RDSR5_DB6                    CAN4RXDSR5_DB6
#define CAN4RDSR5_DB7                    CAN4RXDSR5_DB7
#define CAN4RDSR5_DB0_MASK               CAN4RXDSR5_DB0_MASK
#define CAN4RDSR5_DB1_MASK               CAN4RXDSR5_DB1_MASK
#define CAN4RDSR5_DB2_MASK               CAN4RXDSR5_DB2_MASK
#define CAN4RDSR5_DB3_MASK               CAN4RXDSR5_DB3_MASK
#define CAN4RDSR5_DB4_MASK               CAN4RXDSR5_DB4_MASK
#define CAN4RDSR5_DB5_MASK               CAN4RXDSR5_DB5_MASK
#define CAN4RDSR5_DB6_MASK               CAN4RXDSR5_DB6_MASK
#define CAN4RDSR5_DB7_MASK               CAN4RXDSR5_DB7_MASK
#define CAN4RDSR6                        CAN4RXDSR6
#define CAN4RDSR6_DB0                    CAN4RXDSR6_DB0
#define CAN4RDSR6_DB1                    CAN4RXDSR6_DB1
#define CAN4RDSR6_DB2                    CAN4RXDSR6_DB2
#define CAN4RDSR6_DB3                    CAN4RXDSR6_DB3
#define CAN4RDSR6_DB4                    CAN4RXDSR6_DB4
#define CAN4RDSR6_DB5                    CAN4RXDSR6_DB5
#define CAN4RDSR6_DB6                    CAN4RXDSR6_DB6
#define CAN4RDSR6_DB7                    CAN4RXDSR6_DB7
#define CAN4RDSR6_DB0_MASK               CAN4RXDSR6_DB0_MASK
#define CAN4RDSR6_DB1_MASK               CAN4RXDSR6_DB1_MASK
#define CAN4RDSR6_DB2_MASK               CAN4RXDSR6_DB2_MASK
#define CAN4RDSR6_DB3_MASK               CAN4RXDSR6_DB3_MASK
#define CAN4RDSR6_DB4_MASK               CAN4RXDSR6_DB4_MASK
#define CAN4RDSR6_DB5_MASK               CAN4RXDSR6_DB5_MASK
#define CAN4RDSR6_DB6_MASK               CAN4RXDSR6_DB6_MASK
#define CAN4RDSR6_DB7_MASK               CAN4RXDSR6_DB7_MASK
#define CAN4RDSR7                        CAN4RXDSR7
#define CAN4RDSR7_DB0                    CAN4RXDSR7_DB0
#define CAN4RDSR7_DB1                    CAN4RXDSR7_DB1
#define CAN4RDSR7_DB2                    CAN4RXDSR7_DB2
#define CAN4RDSR7_DB3                    CAN4RXDSR7_DB3
#define CAN4RDSR7_DB4                    CAN4RXDSR7_DB4
#define CAN4RDSR7_DB5                    CAN4RXDSR7_DB5
#define CAN4RDSR7_DB6                    CAN4RXDSR7_DB6
#define CAN4RDSR7_DB7                    CAN4RXDSR7_DB7
#define CAN4RDSR7_DB0_MASK               CAN4RXDSR7_DB0_MASK
#define CAN4RDSR7_DB1_MASK               CAN4RXDSR7_DB1_MASK
#define CAN4RDSR7_DB2_MASK               CAN4RXDSR7_DB2_MASK
#define CAN4RDSR7_DB3_MASK               CAN4RXDSR7_DB3_MASK
#define CAN4RDSR7_DB4_MASK               CAN4RXDSR7_DB4_MASK
#define CAN4RDSR7_DB5_MASK               CAN4RXDSR7_DB5_MASK
#define CAN4RDSR7_DB6_MASK               CAN4RXDSR7_DB6_MASK
#define CAN4RDSR7_DB7_MASK               CAN4RXDSR7_DB7_MASK
#define CAN4RDLR                         CAN4RXDLR
#define CAN4RDLR_DLC0                    CAN4RXDLR_DLC0
#define CAN4RDLR_DLC1                    CAN4RXDLR_DLC1
#define CAN4RDLR_DLC2                    CAN4RXDLR_DLC2
#define CAN4RDLR_DLC3                    CAN4RXDLR_DLC3
#define CAN4RDLR_DLC                     CAN4RXDLR_DLC
#define CAN4RDLR_DLC0_MASK               CAN4RXDLR_DLC0_MASK
#define CAN4RDLR_DLC1_MASK               CAN4RXDLR_DLC1_MASK
#define CAN4RDLR_DLC2_MASK               CAN4RXDLR_DLC2_MASK
#define CAN4RDLR_DLC3_MASK               CAN4RXDLR_DLC3_MASK
#define CAN4RDLR_DLC_MASK                CAN4RXDLR_DLC_MASK
#define CAN4RDLR_DLC_BITNUM              CAN4RXDLR_DLC_BITNUM
#define CAN4RTSRH                        CAN4RXTSRH
#define CAN4RTSRH_TSR8                   CAN4RXTSRH_TSR8
#define CAN4RTSRH_TSR9                   CAN4RXTSRH_TSR9
#define CAN4RTSRH_TSR10                  CAN4RXTSRH_TSR10
#define CAN4RTSRH_TSR11                  CAN4RXTSRH_TSR11
#define CAN4RTSRH_TSR12                  CAN4RXTSRH_TSR12
#define CAN4RTSRH_TSR13                  CAN4RXTSRH_TSR13
#define CAN4RTSRH_TSR14                  CAN4RXTSRH_TSR14
#define CAN4RTSRH_TSR15                  CAN4RXTSRH_TSR15
#define CAN4RTSRH_TSR8_MASK              CAN4RXTSRH_TSR8_MASK
#define CAN4RTSRH_TSR9_MASK              CAN4RXTSRH_TSR9_MASK
#define CAN4RTSRH_TSR10_MASK             CAN4RXTSRH_TSR10_MASK
#define CAN4RTSRH_TSR11_MASK             CAN4RXTSRH_TSR11_MASK
#define CAN4RTSRH_TSR12_MASK             CAN4RXTSRH_TSR12_MASK
#define CAN4RTSRH_TSR13_MASK             CAN4RXTSRH_TSR13_MASK
#define CAN4RTSRH_TSR14_MASK             CAN4RXTSRH_TSR14_MASK
#define CAN4RTSRH_TSR15_MASK             CAN4RXTSRH_TSR15_MASK
#define CAN4RTSRL                        CAN4RXTSRL
#define CAN4RTSRL_TSR0                   CAN4RXTSRL_TSR0
#define CAN4RTSRL_TSR1                   CAN4RXTSRL_TSR1
#define CAN4RTSRL_TSR2                   CAN4RXTSRL_TSR2
#define CAN4RTSRL_TSR3                   CAN4RXTSRL_TSR3
#define CAN4RTSRL_TSR4                   CAN4RXTSRL_TSR4
#define CAN4RTSRL_TSR5                   CAN4RXTSRL_TSR5
#define CAN4RTSRL_TSR6                   CAN4RXTSRL_TSR6
#define CAN4RTSRL_TSR7                   CAN4RXTSRL_TSR7
#define CAN4RTSRL_TSR0_MASK              CAN4RXTSRL_TSR0_MASK
#define CAN4RTSRL_TSR1_MASK              CAN4RXTSRL_TSR1_MASK
#define CAN4RTSRL_TSR2_MASK              CAN4RXTSRL_TSR2_MASK
#define CAN4RTSRL_TSR3_MASK              CAN4RXTSRL_TSR3_MASK
#define CAN4RTSRL_TSR4_MASK              CAN4RXTSRL_TSR4_MASK
#define CAN4RTSRL_TSR5_MASK              CAN4RXTSRL_TSR5_MASK
#define CAN4RTSRL_TSR6_MASK              CAN4RXTSRL_TSR6_MASK
#define CAN4RTSRL_TSR7_MASK              CAN4RXTSRL_TSR7_MASK
#define CAN4RTSR                         CAN4RXTSR
#define CAN4RTSR_TSR0                    CAN4RXTSR_TSR0
#define CAN4RTSR_TSR1                    CAN4RXTSR_TSR1
#define CAN4RTSR_TSR2                    CAN4RXTSR_TSR2
#define CAN4RTSR_TSR3                    CAN4RXTSR_TSR3
#define CAN4RTSR_TSR4                    CAN4RXTSR_TSR4
#define CAN4RTSR_TSR5                    CAN4RXTSR_TSR5
#define CAN4RTSR_TSR6                    CAN4RXTSR_TSR6
#define CAN4RTSR_TSR7                    CAN4RXTSR_TSR7
#define CAN4RTSR_TSR8                    CAN4RXTSR_TSR8
#define CAN4RTSR_TSR9                    CAN4RXTSR_TSR9
#define CAN4RTSR_TSR10                   CAN4RXTSR_TSR10
#define CAN4RTSR_TSR11                   CAN4RXTSR_TSR11
#define CAN4RTSR_TSR12                   CAN4RXTSR_TSR12
#define CAN4RTSR_TSR13                   CAN4RXTSR_TSR13
#define CAN4RTSR_TSR14                   CAN4RXTSR_TSR14
#define CAN4RTSR_TSR15                   CAN4RXTSR_TSR15
#define CAN4RTSR_TSR0_MASK               CAN4RXTSR_TSR0_MASK
#define CAN4RTSR_TSR1_MASK               CAN4RXTSR_TSR1_MASK
#define CAN4RTSR_TSR2_MASK               CAN4RXTSR_TSR2_MASK
#define CAN4RTSR_TSR3_MASK               CAN4RXTSR_TSR3_MASK
#define CAN4RTSR_TSR4_MASK               CAN4RXTSR_TSR4_MASK
#define CAN4RTSR_TSR5_MASK               CAN4RXTSR_TSR5_MASK
#define CAN4RTSR_TSR6_MASK               CAN4RXTSR_TSR6_MASK
