Super0415/TEST/GEC16W-1-M115 V1.0/Heads/mc9s12xet256.h
#define CAN4RTSR_TSR7_MASK               CAN4RXTSR_TSR7_MASK
#define CAN4RTSR_TSR8_MASK               CAN4RXTSR_TSR8_MASK
#define CAN4RTSR_TSR9_MASK               CAN4RXTSR_TSR9_MASK
#define CAN4RTSR_TSR10_MASK              CAN4RXTSR_TSR10_MASK
#define CAN4RTSR_TSR11_MASK              CAN4RXTSR_TSR11_MASK
#define CAN4RTSR_TSR12_MASK              CAN4RXTSR_TSR12_MASK
#define CAN4RTSR_TSR13_MASK              CAN4RXTSR_TSR13_MASK
#define CAN4RTSR_TSR14_MASK              CAN4RXTSR_TSR14_MASK
#define CAN4RTSR_TSR15_MASK              CAN4RXTSR_TSR15_MASK
#define CAN4TIDR0                        CAN4TXIDR0
#define CAN4TIDR0_ID21                   CAN4TXIDR0_ID21
#define CAN4TIDR0_ID22                   CAN4TXIDR0_ID22
#define CAN4TIDR0_ID23                   CAN4TXIDR0_ID23
#define CAN4TIDR0_ID24                   CAN4TXIDR0_ID24
#define CAN4TIDR0_ID25                   CAN4TXIDR0_ID25
#define CAN4TIDR0_ID26                   CAN4TXIDR0_ID26
#define CAN4TIDR0_ID27                   CAN4TXIDR0_ID27
#define CAN4TIDR0_ID28                   CAN4TXIDR0_ID28
#define CAN4TIDR_ARR                     This_symb_has_been_depreciated
#define CAN4TIDR0_ID21_MASK              CAN4TXIDR0_ID21_MASK
#define CAN4TIDR0_ID22_MASK              CAN4TXIDR0_ID22_MASK
#define CAN4TIDR0_ID23_MASK              CAN4TXIDR0_ID23_MASK
#define CAN4TIDR0_ID24_MASK              CAN4TXIDR0_ID24_MASK
#define CAN4TIDR0_ID25_MASK              CAN4TXIDR0_ID25_MASK
#define CAN4TIDR0_ID26_MASK              CAN4TXIDR0_ID26_MASK
#define CAN4TIDR0_ID27_MASK              CAN4TXIDR0_ID27_MASK
#define CAN4TIDR0_ID28_MASK              CAN4TXIDR0_ID28_MASK
#define CAN4TIDR1                        CAN4TXIDR1
#define CAN4TIDR1_ID15                   CAN4TXIDR1_ID15
#define CAN4TIDR1_ID16                   CAN4TXIDR1_ID16
#define CAN4TIDR1_ID17                   CAN4TXIDR1_ID17
#define CAN4TIDR1_IDE                    CAN4TXIDR1_IDE
#define CAN4TIDR1_SRR                    CAN4TXIDR1_SRR
#define CAN4TIDR1_ID18                   CAN4TXIDR1_ID18
#define CAN4TIDR1_ID19                   CAN4TXIDR1_ID19
#define CAN4TIDR1_ID20                   CAN4TXIDR1_ID20
#define CAN4TIDR1_ID_15                  CAN4TXIDR1_ID_15
#define CAN4TIDR1_ID_18                  CAN4TXIDR1_ID_18
#define CAN4TIDR1_ID                     CAN4TXIDR1_ID
#define CAN4TIDR1_ID15_MASK              CAN4TXIDR1_ID15_MASK
#define CAN4TIDR1_ID16_MASK              CAN4TXIDR1_ID16_MASK
#define CAN4TIDR1_ID17_MASK              CAN4TXIDR1_ID17_MASK
#define CAN4TIDR1_IDE_MASK               CAN4TXIDR1_IDE_MASK
#define CAN4TIDR1_SRR_MASK               CAN4TXIDR1_SRR_MASK
#define CAN4TIDR1_ID18_MASK              CAN4TXIDR1_ID18_MASK
#define CAN4TIDR1_ID19_MASK              CAN4TXIDR1_ID19_MASK
#define CAN4TIDR1_ID20_MASK              CAN4TXIDR1_ID20_MASK
#define CAN4TIDR1_ID_15_MASK             CAN4TXIDR1_ID_15_MASK
#define CAN4TIDR1_ID_15_BITNUM           CAN4TXIDR1_ID_15_BITNUM
#define CAN4TIDR1_ID_18_MASK             CAN4TXIDR1_ID_18_MASK
#define CAN4TIDR1_ID_18_BITNUM           CAN4TXIDR1_ID_18_BITNUM
#define CAN4TIDR2                        CAN4TXIDR2
#define CAN4TIDR2_ID7                    CAN4TXIDR2_ID7
#define CAN4TIDR2_ID8                    CAN4TXIDR2_ID8
#define CAN4TIDR2_ID9                    CAN4TXIDR2_ID9
#define CAN4TIDR2_ID10                   CAN4TXIDR2_ID10
#define CAN4TIDR2_ID11                   CAN4TXIDR2_ID11
#define CAN4TIDR2_ID12                   CAN4TXIDR2_ID12
#define CAN4TIDR2_ID13                   CAN4TXIDR2_ID13
#define CAN4TIDR2_ID14                   CAN4TXIDR2_ID14
#define CAN4TIDR2_ID7_MASK               CAN4TXIDR2_ID7_MASK
#define CAN4TIDR2_ID8_MASK               CAN4TXIDR2_ID8_MASK
#define CAN4TIDR2_ID9_MASK               CAN4TXIDR2_ID9_MASK
#define CAN4TIDR2_ID10_MASK              CAN4TXIDR2_ID10_MASK
#define CAN4TIDR2_ID11_MASK              CAN4TXIDR2_ID11_MASK
#define CAN4TIDR2_ID12_MASK              CAN4TXIDR2_ID12_MASK
#define CAN4TIDR2_ID13_MASK              CAN4TXIDR2_ID13_MASK
#define CAN4TIDR2_ID14_MASK              CAN4TXIDR2_ID14_MASK
#define CAN4TIDR3                        CAN4TXIDR3
#define CAN4TIDR3_RTR                    CAN4TXIDR3_RTR
#define CAN4TIDR3_ID0                    CAN4TXIDR3_ID0
#define CAN4TIDR3_ID1                    CAN4TXIDR3_ID1
#define CAN4TIDR3_ID2                    CAN4TXIDR3_ID2
#define CAN4TIDR3_ID3                    CAN4TXIDR3_ID3
#define CAN4TIDR3_ID4                    CAN4TXIDR3_ID4
#define CAN4TIDR3_ID5                    CAN4TXIDR3_ID5
#define CAN4TIDR3_ID6                    CAN4TXIDR3_ID6
#define CAN4TIDR3_ID                     CAN4TXIDR3_ID
#define CAN4TIDR3_RTR_MASK               CAN4TXIDR3_RTR_MASK
#define CAN4TIDR3_ID0_MASK               CAN4TXIDR3_ID0_MASK
#define CAN4TIDR3_ID1_MASK               CAN4TXIDR3_ID1_MASK
#define CAN4TIDR3_ID2_MASK               CAN4TXIDR3_ID2_MASK
#define CAN4TIDR3_ID3_MASK               CAN4TXIDR3_ID3_MASK
#define CAN4TIDR3_ID4_MASK               CAN4TXIDR3_ID4_MASK
#define CAN4TIDR3_ID5_MASK               CAN4TXIDR3_ID5_MASK
#define CAN4TIDR3_ID6_MASK               CAN4TXIDR3_ID6_MASK
#define CAN4TIDR3_ID_MASK                CAN4TXIDR3_ID_MASK
#define CAN4TIDR3_ID_BITNUM              CAN4TXIDR3_ID_BITNUM
#define CAN4TDSR0                        CAN4TXDSR0
#define CAN4TDSR0_DB0                    CAN4TXDSR0_DB0
#define CAN4TDSR0_DB1                    CAN4TXDSR0_DB1
#define CAN4TDSR0_DB2                    CAN4TXDSR0_DB2
#define CAN4TDSR0_DB3                    CAN4TXDSR0_DB3
#define CAN4TDSR0_DB4                    CAN4TXDSR0_DB4
#define CAN4TDSR0_DB5                    CAN4TXDSR0_DB5
#define CAN4TDSR0_DB6                    CAN4TXDSR0_DB6
#define CAN4TDSR0_DB7                    CAN4TXDSR0_DB7
#define CAN4TDSR_ARR                     This_symb_has_been_depreciated
#define CAN4TDSR0_DB0_MASK               CAN4TXDSR0_DB0_MASK
#define CAN4TDSR0_DB1_MASK               CAN4TXDSR0_DB1_MASK
#define CAN4TDSR0_DB2_MASK               CAN4TXDSR0_DB2_MASK
#define CAN4TDSR0_DB3_MASK               CAN4TXDSR0_DB3_MASK
#define CAN4TDSR0_DB4_MASK               CAN4TXDSR0_DB4_MASK
#define CAN4TDSR0_DB5_MASK               CAN4TXDSR0_DB5_MASK
#define CAN4TDSR0_DB6_MASK               CAN4TXDSR0_DB6_MASK
#define CAN4TDSR0_DB7_MASK               CAN4TXDSR0_DB7_MASK
#define CAN4TDSR1                        CAN4TXDSR1
#define CAN4TDSR1_DB0                    CAN4TXDSR1_DB0
#define CAN4TDSR1_DB1                    CAN4TXDSR1_DB1
#define CAN4TDSR1_DB2                    CAN4TXDSR1_DB2
#define CAN4TDSR1_DB3                    CAN4TXDSR1_DB3
#define CAN4TDSR1_DB4                    CAN4TXDSR1_DB4
#define CAN4TDSR1_DB5                    CAN4TXDSR1_DB5
#define CAN4TDSR1_DB6                    CAN4TXDSR1_DB6
#define CAN4TDSR1_DB7                    CAN4TXDSR1_DB7
#define CAN4TDSR1_DB0_MASK               CAN4TXDSR1_DB0_MASK
#define CAN4TDSR1_DB1_MASK               CAN4TXDSR1_DB1_MASK
#define CAN4TDSR1_DB2_MASK               CAN4TXDSR1_DB2_MASK
#define CAN4TDSR1_DB3_MASK               CAN4TXDSR1_DB3_MASK
#define CAN4TDSR1_DB4_MASK               CAN4TXDSR1_DB4_MASK
#define CAN4TDSR1_DB5_MASK               CAN4TXDSR1_DB5_MASK
#define CAN4TDSR1_DB6_MASK               CAN4TXDSR1_DB6_MASK
#define CAN4TDSR1_DB7_MASK               CAN4TXDSR1_DB7_MASK
#define CAN4TDSR2                        CAN4TXDSR2
#define CAN4TDSR2_DB0                    CAN4TXDSR2_DB0
#define CAN4TDSR2_DB1                    CAN4TXDSR2_DB1
#define CAN4TDSR2_DB2                    CAN4TXDSR2_DB2
#define CAN4TDSR2_DB3                    CAN4TXDSR2_DB3
#define CAN4TDSR2_DB4                    CAN4TXDSR2_DB4
#define CAN4TDSR2_DB5                    CAN4TXDSR2_DB5
#define CAN4TDSR2_DB6                    CAN4TXDSR2_DB6
#define CAN4TDSR2_DB7                    CAN4TXDSR2_DB7
#define CAN4TDSR2_DB0_MASK               CAN4TXDSR2_DB0_MASK
#define CAN4TDSR2_DB1_MASK               CAN4TXDSR2_DB1_MASK
#define CAN4TDSR2_DB2_MASK               CAN4TXDSR2_DB2_MASK
#define CAN4TDSR2_DB3_MASK               CAN4TXDSR2_DB3_MASK
#define CAN4TDSR2_DB4_MASK               CAN4TXDSR2_DB4_MASK
#define CAN4TDSR2_DB5_MASK               CAN4TXDSR2_DB5_MASK
#define CAN4TDSR2_DB6_MASK               CAN4TXDSR2_DB6_MASK
#define CAN4TDSR2_DB7_MASK               CAN4TXDSR2_DB7_MASK
#define CAN4TDSR3                        CAN4TXDSR3
#define CAN4TDSR3_DB0                    CAN4TXDSR3_DB0
#define CAN4TDSR3_DB1                    CAN4TXDSR3_DB1
#define CAN4TDSR3_DB2                    CAN4TXDSR3_DB2
#define CAN4TDSR3_DB3                    CAN4TXDSR3_DB3
#define CAN4TDSR3_DB4                    CAN4TXDSR3_DB4
#define CAN4TDSR3_DB5                    CAN4TXDSR3_DB5
#define CAN4TDSR3_DB6                    CAN4TXDSR3_DB6
#define CAN4TDSR3_DB7                    CAN4TXDSR3_DB7
#define CAN4TDSR3_DB0_MASK               CAN4TXDSR3_DB0_MASK
#define CAN4TDSR3_DB1_MASK               CAN4TXDSR3_DB1_MASK
#define CAN4TDSR3_DB2_MASK               CAN4TXDSR3_DB2_MASK
#define CAN4TDSR3_DB3_MASK               CAN4TXDSR3_DB3_MASK
#define CAN4TDSR3_DB4_MASK               CAN4TXDSR3_DB4_MASK
#define CAN4TDSR3_DB5_MASK               CAN4TXDSR3_DB5_MASK
#define CAN4TDSR3_DB6_MASK               CAN4TXDSR3_DB6_MASK
#define CAN4TDSR3_DB7_MASK               CAN4TXDSR3_DB7_MASK
#define CAN4TDSR4                        CAN4TXDSR4
#define CAN4TDSR4_DB0                    CAN4TXDSR4_DB0
#define CAN4TDSR4_DB1                    CAN4TXDSR4_DB1
#define CAN4TDSR4_DB2                    CAN4TXDSR4_DB2
#define CAN4TDSR4_DB3                    CAN4TXDSR4_DB3
#define CAN4TDSR4_DB4                    CAN4TXDSR4_DB4
#define CAN4TDSR4_DB5                    CAN4TXDSR4_DB5
#define CAN4TDSR4_DB6                    CAN4TXDSR4_DB6
#define CAN4TDSR4_DB7                    CAN4TXDSR4_DB7
#define CAN4TDSR4_DB0_MASK               CAN4TXDSR4_DB0_MASK
#define CAN4TDSR4_DB1_MASK               CAN4TXDSR4_DB1_MASK
#define CAN4TDSR4_DB2_MASK               CAN4TXDSR4_DB2_MASK
#define CAN4TDSR4_DB3_MASK               CAN4TXDSR4_DB3_MASK
#define CAN4TDSR4_DB4_MASK               CAN4TXDSR4_DB4_MASK
#define CAN4TDSR4_DB5_MASK               CAN4TXDSR4_DB5_MASK
#define CAN4TDSR4_DB6_MASK               CAN4TXDSR4_DB6_MASK
#define CAN4TDSR4_DB7_MASK               CAN4TXDSR4_DB7_MASK
#define CAN4TDSR5                        CAN4TXDSR5
#define CAN4TDSR5_DB0                    CAN4TXDSR5_DB0
#define CAN4TDSR5_DB1                    CAN4TXDSR5_DB1
#define CAN4TDSR5_DB2                    CAN4TXDSR5_DB2
#define CAN4TDSR5_DB3                    CAN4TXDSR5_DB3
#define CAN4TDSR5_DB4                    CAN4TXDSR5_DB4
#define CAN4TDSR5_DB5                    CAN4TXDSR5_DB5
#define CAN4TDSR5_DB6                    CAN4TXDSR5_DB6
#define CAN4TDSR5_DB7                    CAN4TXDSR5_DB7
#define CAN4TDSR5_DB0_MASK               CAN4TXDSR5_DB0_MASK
#define CAN4TDSR5_DB1_MASK               CAN4TXDSR5_DB1_MASK
#define CAN4TDSR5_DB2_MASK               CAN4TXDSR5_DB2_MASK
#define CAN4TDSR5_DB3_MASK               CAN4TXDSR5_DB3_MASK
#define CAN4TDSR5_DB4_MASK               CAN4TXDSR5_DB4_MASK
#define CAN4TDSR5_DB5_MASK               CAN4TXDSR5_DB5_MASK
#define CAN4TDSR5_DB6_MASK               CAN4TXDSR5_DB6_MASK
#define CAN4TDSR5_DB7_MASK               CAN4TXDSR5_DB7_MASK
#define CAN4TDSR6                        CAN4TXDSR6
#define CAN4TDSR6_DB0                    CAN4TXDSR6_DB0
#define CAN4TDSR6_DB1                    CAN4TXDSR6_DB1
#define CAN4TDSR6_DB2                    CAN4TXDSR6_DB2
#define CAN4TDSR6_DB3                    CAN4TXDSR6_DB3
#define CAN4TDSR6_DB4                    CAN4TXDSR6_DB4
#define CAN4TDSR6_DB5                    CAN4TXDSR6_DB5
#define CAN4TDSR6_DB6                    CAN4TXDSR6_DB6
#define CAN4TDSR6_DB7                    CAN4TXDSR6_DB7
#define CAN4TDSR6_DB0_MASK               CAN4TXDSR6_DB0_MASK
#define CAN4TDSR6_DB1_MASK               CAN4TXDSR6_DB1_MASK
#define CAN4TDSR6_DB2_MASK               CAN4TXDSR6_DB2_MASK
#define CAN4TDSR6_DB3_MASK               CAN4TXDSR6_DB3_MASK
#define CAN4TDSR6_DB4_MASK               CAN4TXDSR6_DB4_MASK
#define CAN4TDSR6_DB5_MASK               CAN4TXDSR6_DB5_MASK
#define CAN4TDSR6_DB6_MASK               CAN4TXDSR6_DB6_MASK
#define CAN4TDSR6_DB7_MASK               CAN4TXDSR6_DB7_MASK
#define CAN4TDSR7                        CAN4TXDSR7
#define CAN4TDSR7_DB0                    CAN4TXDSR7_DB0
#define CAN4TDSR7_DB1                    CAN4TXDSR7_DB1
#define CAN4TDSR7_DB2                    CAN4TXDSR7_DB2
#define CAN4TDSR7_DB3                    CAN4TXDSR7_DB3
#define CAN4TDSR7_DB4                    CAN4TXDSR7_DB4
#define CAN4TDSR7_DB5                    CAN4TXDSR7_DB5
#define CAN4TDSR7_DB6                    CAN4TXDSR7_DB6
#define CAN4TDSR7_DB7                    CAN4TXDSR7_DB7
#define CAN4TDSR7_DB0_MASK               CAN4TXDSR7_DB0_MASK
#define CAN4TDSR7_DB1_MASK               CAN4TXDSR7_DB1_MASK
#define CAN4TDSR7_DB2_MASK               CAN4TXDSR7_DB2_MASK
#define CAN4TDSR7_DB3_MASK               CAN4TXDSR7_DB3_MASK
#define CAN4TDSR7_DB4_MASK               CAN4TXDSR7_DB4_MASK
#define CAN4TDSR7_DB5_MASK               CAN4TXDSR7_DB5_MASK
#define CAN4TDSR7_DB6_MASK               CAN4TXDSR7_DB6_MASK
#define CAN4TDSR7_DB7_MASK               CAN4TXDSR7_DB7_MASK
#define CAN4TDLR                         CAN4TXDLR
#define CAN4TDLR_DLC0                    CAN4TXDLR_DLC0
#define CAN4TDLR_DLC1                    CAN4TXDLR_DLC1
#define CAN4TDLR_DLC2                    CAN4TXDLR_DLC2
#define CAN4TDLR_DLC3                    CAN4TXDLR_DLC3
#define CAN4TDLR_DLC                     CAN4TXDLR_DLC
#define CAN4TDLR_DLC0_MASK               CAN4TXDLR_DLC0_MASK
#define CAN4TDLR_DLC1_MASK               CAN4TXDLR_DLC1_MASK
#define CAN4TDLR_DLC2_MASK               CAN4TXDLR_DLC2_MASK
#define CAN4TDLR_DLC3_MASK               CAN4TXDLR_DLC3_MASK
#define CAN4TDLR_DLC_MASK                CAN4TXDLR_DLC_MASK
#define CAN4TDLR_DLC_BITNUM              CAN4TXDLR_DLC_BITNUM
#define CAN4TTBPR                        CAN4TXTBPR
#define CAN4TTBPR_PRIO0                  CAN4TXTBPR_PRIO0
#define CAN4TTBPR_PRIO1                  CAN4TXTBPR_PRIO1
#define CAN4TTBPR_PRIO2                  CAN4TXTBPR_PRIO2
#define CAN4TTBPR_PRIO3                  CAN4TXTBPR_PRIO3
#define CAN4TTBPR_PRIO4                  CAN4TXTBPR_PRIO4
#define CAN4TTBPR_PRIO5                  CAN4TXTBPR_PRIO5
#define CAN4TTBPR_PRIO6                  CAN4TXTBPR_PRIO6
#define CAN4TTBPR_PRIO7                  CAN4TXTBPR_PRIO7
#define CAN4TTBPR_PRIO0_MASK             CAN4TXTBPR_PRIO0_MASK
#define CAN4TTBPR_PRIO1_MASK             CAN4TXTBPR_PRIO1_MASK
#define CAN4TTBPR_PRIO2_MASK             CAN4TXTBPR_PRIO2_MASK
#define CAN4TTBPR_PRIO3_MASK             CAN4TXTBPR_PRIO3_MASK
#define CAN4TTBPR_PRIO4_MASK             CAN4TXTBPR_PRIO4_MASK
#define CAN4TTBPR_PRIO5_MASK             CAN4TXTBPR_PRIO5_MASK
#define CAN4TTBPR_PRIO6_MASK             CAN4TXTBPR_PRIO6_MASK
#define CAN4TTBPR_PRIO7_MASK             CAN4TXTBPR_PRIO7_MASK
#define CAN4TTSRH                        CAN4TXTSRH
#define CAN4TTSRH_TSR8                   CAN4TXTSRH_TSR8
#define CAN4TTSRH_TSR9                   CAN4TXTSRH_TSR9
#define CAN4TTSRH_TSR10                  CAN4TXTSRH_TSR10
#define CAN4TTSRH_TSR11                  CAN4TXTSRH_TSR11
#define CAN4TTSRH_TSR12                  CAN4TXTSRH_TSR12
#define CAN4TTSRH_TSR13                  CAN4TXTSRH_TSR13
#define CAN4TTSRH_TSR14                  CAN4TXTSRH_TSR14
#define CAN4TTSRH_TSR15                  CAN4TXTSRH_TSR15
#define CAN4TTSRH_TSR8_MASK              CAN4TXTSRH_TSR8_MASK
#define CAN4TTSRH_TSR9_MASK              CAN4TXTSRH_TSR9_MASK
#define CAN4TTSRH_TSR10_MASK             CAN4TXTSRH_TSR10_MASK
#define CAN4TTSRH_TSR11_MASK             CAN4TXTSRH_TSR11_MASK
#define CAN4TTSRH_TSR12_MASK             CAN4TXTSRH_TSR12_MASK
#define CAN4TTSRH_TSR13_MASK             CAN4TXTSRH_TSR13_MASK
#define CAN4TTSRH_TSR14_MASK             CAN4TXTSRH_TSR14_MASK
#define CAN4TTSRH_TSR15_MASK             CAN4TXTSRH_TSR15_MASK
#define CAN4TTSRL                        CAN4TXTSRL
#define CAN4TTSRL_TSR0                   CAN4TXTSRL_TSR0
#define CAN4TTSRL_TSR1                   CAN4TXTSRL_TSR1
#define CAN4TTSRL_TSR2                   CAN4TXTSRL_TSR2
#define CAN4TTSRL_TSR3                   CAN4TXTSRL_TSR3
#define CAN4TTSRL_TSR4                   CAN4TXTSRL_TSR4
#define CAN4TTSRL_TSR5                   CAN4TXTSRL_TSR5
#define CAN4TTSRL_TSR6                   CAN4TXTSRL_TSR6
#define CAN4TTSRL_TSR7                   CAN4TXTSRL_TSR7
#define CAN4TTSRL_TSR0_MASK              CAN4TXTSRL_TSR0_MASK
#define CAN4TTSRL_TSR1_MASK              CAN4TXTSRL_TSR1_MASK
#define CAN4TTSRL_TSR2_MASK              CAN4TXTSRL_TSR2_MASK
#define CAN4TTSRL_TSR3_MASK              CAN4TXTSRL_TSR3_MASK
#define CAN4TTSRL_TSR4_MASK              CAN4TXTSRL_TSR4_MASK
#define CAN4TTSRL_TSR5_MASK              CAN4TXTSRL_TSR5_MASK
#define CAN4TTSRL_TSR6_MASK              CAN4TXTSRL_TSR6_MASK
#define CAN4TTSRL_TSR7_MASK              CAN4TXTSRL_TSR7_MASK
#define CAN4TTSR                         CAN4TXTSR
#define CAN4TTSR_TSR0                    CAN4TXTSR_TSR0
#define CAN4TTSR_TSR1                    CAN4TXTSR_TSR1
#define CAN4TTSR_TSR2                    CAN4TXTSR_TSR2
#define CAN4TTSR_TSR3                    CAN4TXTSR_TSR3
#define CAN4TTSR_TSR4                    CAN4TXTSR_TSR4
#define CAN4TTSR_TSR5                    CAN4TXTSR_TSR5
#define CAN4TTSR_TSR6                    CAN4TXTSR_TSR6
#define CAN4TTSR_TSR7                    CAN4TXTSR_TSR7
#define CAN4TTSR_TSR8                    CAN4TXTSR_TSR8
#define CAN4TTSR_TSR9                    CAN4TXTSR_TSR9
#define CAN4TTSR_TSR10                   CAN4TXTSR_TSR10
#define CAN4TTSR_TSR11                   CAN4TXTSR_TSR11
#define CAN4TTSR_TSR12                   CAN4TXTSR_TSR12
#define CAN4TTSR_TSR13                   CAN4TXTSR_TSR13
#define CAN4TTSR_TSR14                   CAN4TXTSR_TSR14
#define CAN4TTSR_TSR15                   CAN4TXTSR_TSR15
#define CAN4TTSR_TSR0_MASK               CAN4TXTSR_TSR0_MASK
#define CAN4TTSR_TSR1_MASK               CAN4TXTSR_TSR1_MASK
#define CAN4TTSR_TSR2_MASK               CAN4TXTSR_TSR2_MASK
#define CAN4TTSR_TSR3_MASK               CAN4TXTSR_TSR3_MASK
#define CAN4TTSR_TSR4_MASK               CAN4TXTSR_TSR4_MASK
#define CAN4TTSR_TSR5_MASK               CAN4TXTSR_TSR5_MASK
#define CAN4TTSR_TSR6_MASK               CAN4TXTSR_TSR6_MASK
#define CAN4TTSR_TSR7_MASK               CAN4TXTSR_TSR7_MASK
#define CAN4TTSR_TSR8_MASK               CAN4TXTSR_TSR8_MASK
#define CAN4TTSR_TSR9_MASK               CAN4TXTSR_TSR9_MASK
#define CAN4TTSR_TSR10_MASK              CAN4TXTSR_TSR10_MASK
#define CAN4TTSR_TSR11_MASK              CAN4TXTSR_TSR11_MASK
#define CAN4TTSR_TSR12_MASK              CAN4TXTSR_TSR12_MASK
#define CAN4TTSR_TSR13_MASK              CAN4TXTSR_TSR13_MASK
#define CAN4TTSR_TSR14_MASK              CAN4TXTSR_TSR14_MASK
#define CAN4TTSR_TSR15_MASK              CAN4TXTSR_TSR15_MASK
#define ATD0CTL2_AWAI                    ATD0CTL2_ICLKSTP
#define ATD0CTL2_AWAI_MASK               ATD0CTL2_ICLKSTP_MASK
#define ATD0CTL23_AWAI                   ATD0CTL23_ICLKSTP
#define ATD0CTL23_AWAI_MASK              ATD0CTL23_ICLKSTP_MASK
#define XGMCTL_XGSWEIFM                  XGMCTL_XGSWEFM
#define XGMCTL_XGSWEIFM_MASK             XGMCTL_XGSWEFM_MASK
#define NVFSEC_RNV6                      NVFSEC_KEYEN0
#define NVFSEC_RNV6_MASK                 NVFSEC_KEYEN0_MASK

/* 14.01.2008 */

#define Vtimmdcu                         Vectmdcu
#define Vtimpabovf                       Vectpabovf
#define VectorNumber_Vtimmdcu            VectorNumber_Vectmdcu
#define VectorNumber_Vtimpabovf          VectorNumber_Vectpabovf

#ifndef __V30COMPATIBLE__
#pragma OPTION DEL V30toV31Compatible
#endif

#endif
